{"seed": 42, "num_examples": 512, "batch_size": 1, "captions": [[["An elephant in the back of a truck."], ["A woman sitting on the stairs of a stairs."]], [["A person doing a trick on a skateboard."], ["A person standing next to a skateboard on a sidewalk."]], [["A man standing on a tennis court holding a racket."], ["Three girls playing soccer on a field."]], [["A man standing in a box with a pizza in it."], ["A little girl with a painting of a vase in it."]], [["A pair of shoes and a pair of shoes on a table."], ["A painting of a man with a picture of a man."]], [["A table with glasses of wine and plates of bread."], ["A table with a hot dog and a salad and a salad."]], [["A living room with a table and a couch."], ["A group of tables and chairs on a room."]], [["A man sitting at a table with a laptop computer."], ["Three bowls of food sitting on the train station."]], [["A desk with two computer monitors and a keyboard."], ["An open suitcase with a cell phone in it."]], [["Two elephants and a baby elephant standing in a zoo."], ["A cat with its head on top of a table."]], [["A bathroom with a toilet with a table."], ["A group of umbrellas sitting on a table."]], [["An airplane sitting on top of an airport runway."], ["A group of seats and an orange and white airplane."]], [["A group of people riding a bike down a street."], ["A group of men sitting next to a bike."]], [["Two giraffes and a baby giraffe standing next to each other."], ["A painting of a bed with a horse and a giraffe."]], [["A woman sitting on a toilet on the sidewalk."], ["Black and white photo of men holding a bucket."]], [["A large clock on the wall of a building."], ["A clock on a box next to a window."]], [["A man laying on the beach next to a surfboard."], ["A group of animals flying in the sky over a body of water."]], [["A cat laying on the hood of a car."], ["A painting of a dog with a stick in its mouth."]], [["A bride and groom standing next to a wedding cake."], ["A man sitting in a window of a store."]], [["A large dog sleeping on a bed."], ["A baby having a shadow on a couch."]], [["A baby laying in a bed with a blanket."], ["A woman sitting on a couch holding a wii controller."]], [["A train is sitting on the tracks in a train yard."], ["A herd of trucks on a dirt road."]], [["A stack of pancakes sitting on a plate on a table."], ["A teddy bear sitting on top of a plate."]], [["A pair of scissors sitting on top of a piece of paper."], ["A bottle of water on a shelf in a room."]], [["A book shelf with a bunch of books."], ["Three shelves of sandwiches sitting on blue wall."]], [["Two birds sitting on top of a tree branch."], ["A man sitting in a tree in a forest."]], [["A woman sitting at a table eating food."], ["A black and white photo of a woman holding chocolate donuts."]], [["A man standing in the grass with a frisbee."], ["A man and a dog with a ball."]], [["A parking meter sitting on the side of a street."], ["A picture of animals on the back of a park."]], [["A banana sitting on top of a desk."], ["A bunch of items on a white table."]], [["A group of people in costumes walking down a street."], ["A woman holding a bag of meat in a street."]], [["A white bouquet of white flowers on a table."], ["A person taking a picture of a pair of shoes on a cell phone."]], [["A woman standing in a kitchen with a pot of food."], ["Two girls cooking food in a kitchen."]], [["A clock tower in the middle of a city street."], ["A man walking down a city street with red trees."]], [["Two tennis players shaking hands on a tennis court."], ["A person and a little girl shaking a baseball bat."]], [["A living room with a couch and a table."], ["Three white chairs with a newspaper on a balcony."]], [["A man sitting on a bench in front of a church."], ["A painting of people on top of a tower on top of a hill."]], [["A man riding on the back of an elephant."], ["A fallen asleep on the sand on a beach."]], [["A stop sign with writing on it."], ["A basket with little cups on top of it."]], [["A white bathroom with a bath tub and a toilet."], ["A glass case with a cell phone in it."]], [["A group of people standing in front of an airplane."], ["A group of people standing in front of a plane."]], [["A green bus driving down a street."], ["Two people sitting on green green green trucks."]], [["Two black and white cats laying next to each other."], ["A black and white cat looking at a mirror with a horse."]], [["A pizza sitting on top of a white plate on a table."], ["A microphone with chicken in a white bowl on a table."]], [["A man riding a wave on a surfboard with a dog."], ["Two birds swimming in the water with a frisbee."]], [["A plate with a sandwich and french fries."], ["A group of bowls of food on a table."]], [["A red and white bus parked on the street."], ["A car with a painted on the top of it and a street."]], [["A train is sitting on the tracks in a field."], ["A row of colorful toys in a field."]], [["A black and white photo of a group of people."], ["An old picture of an old man with a table."]], [["A man standing on a tennis court holding a racket."], ["A person with their feet on top of a bike."]], [["A black and white stove top oven in a kitchen."], ["A glass case with a group of vases in it."]], [["An intersection with a traffic light and a building."], ["A statue of a man standing in front of a window."]], [["A banana sitting on a plate next to a table."], ["A toy comfortably sitting in a white plate on a table."]], [["A man in a white uniform holding a knife."], ["A group of chefs standing in a white kitchen."]], [["A man standing on skis on top of a snow covered slope."], ["A picture of two people on top of a snow covered mountain."]], [["A kitchen with a table and chairs in it."], ["A bedroom with a bed and a television in it."]], [["A man flying through the air on a snowboard."], ["Two orange elephant standing on top of a blue blanket."]], [["A pizza on a plate on a table."], ["A plastic container with a light in it."]], [["A cat playing with its reflection in a mirror."], ["A group of people with their feet on a washing machine."]], [["A vase with red flowers in front of a fireplace."], ["A glass bowl with stuffed animals and fruit on it."]], [["A group of women standing around a table with a cake."], ["Two girls sitting at a picnic table with a stuffed animal."]], [["A woman standing next to an elderly man."], ["A man and a woman holding a pink teddy bear."]], [["A clock on a pole on a city street."], ["A clock on the side of houses on a street."]], [["A bathroom with two sinks and a wall."], ["Three white cups sitting on a rack in a room."]], [["A man with a dog in a backpack."], ["Two young people holding a teddy bear."]], [["Three teddy bears sitting next to each other."], ["A man laying in a bed with a cat on his head."]], [["A young man riding a skateboard at a skate park."], ["A woman holding a knife on a wall."]], [["A stuffed teddy bear wearing a mask on a bed."], ["A group of stuffed animals in mask on a table."]], [["A group of people riding skis on a ski lift."], ["A man riding a snowboard down a snow covered slope."]], [["A black bird sitting on the sidewalk next to a man."], ["A group of people sitting on a ski lift."]], [["A dining room with a table and chairs."], ["A display of old characters on display in a store."]], [["A young boy swinging a baseball bat at a ball."], ["A young boy holding a toy next to a fence."]], [["A city street at night with traffic lights."], ["A bottle with a fire hydrant in a city."]], [["A woman standing on skis in the snow."], ["Two men in costumes standing in front of a street."]], [["A wooden bed with pillows on top of it."], ["A group of people wearing helmets on a couch."]], [["A man doing a trick on a skateboard at a skate park."], ["A woman sitting on a bench with her feet on a table."]], [["A man riding a wave on a surfboard in the ocean."], ["A painting of a man standing on a paddle board in the water."]], [["A group of horses grazing in a field."], ["A painting of animals grazing in a field."]], [["A swimming pool with a table and a table."], ["A group of surfboards on a beach."]], [["A group of people standing on a bus at a bus stop."], ["A group of men standing next to a train."]], [["A black cat sitting in front of a door."], ["A bed with white sheets on top of it."]], [["A woman standing on a tennis court with a ball."], ["Two people standing next to a tree with an elephant."]], [["A man standing on a tennis court with a racket."], ["Two children standing on a road with umbrellas."]], [["A large bed with red pillows on top of it."], ["A plastic container sitting in a window."]], [["An airplane flying over a tree in the sky."], ["A little girl flying a kite in a field."]], [["A construction truck and orange cones on a street."], ["A painting of a yellow school bus driving down a road."]], [["A hot dog sitting next to a bottle of soda."], ["A group of meat wrapped in plastic on a counter."]], [["A red stop sign on the side of a street."], ["An old red sign holding a baseball bat in it."]], [["A white polar bear laying on top of a rock."], ["A painting of a cat and a polar bear."]], [["A bunch of baskets of carrots and vegetables on a table."], ["Three baskets and a decoration on a wall."]], [["A group of white teddy bears sitting on a table."], ["A plate of three cupcakes with sprinkles on it."]], [["A train is on the tracks under a bridge."], ["A painting of a sheep in a pen."]], [["A white plate of food on a table."], ["A statue of a man next to a horse and a cupcake."]], [["A city street with a sign on the side of it."], ["A bed with a lamp in front of a window."]], [["A seagull flying over a beach next to the ocean."], ["A painting of a green vase flying in the sky."]], [["A kitten laying on top of a laptop computer."], ["Three gloves and three cell phones on a glass table."]], [["A group of people standing in front of a bus."], ["A doll house with a teddy bear in it."]], [["A bike sitting on the side of a train."], ["A small room with a boat on the floor."]], [["A man holding a yellow kite in a kitchen."], ["A group of men wearing hats hanging from a table."]], [["A black dog sitting in front of a mirror."], ["Three cups with cake sitting on top of a table."]], [["A person flying a kite in a field next to the ocean."], ["A young boy jumping in the air to catch a pink kite."]], [["A person holding a cell phone in their hand."], ["A group of items sitting next to each other."]], [["A row of bikes parked next to each other."], ["A wooden table with a bunch of bikes on it."]], [["Two elephants standing next to each other in a zoo."], ["A herd of elephants walking down a dirt road."]], [["A man holding a vase of flowers on a wall."], ["A person jumping in the air with head in the air."]], [["A horse standing next to a fence in a field."], ["A painting of a horse and a baby standing next to a fence."]], [["A red double decker bus with people on it."], ["A red train is sitting in a crowd of people."]], [["A motorcycle parked next to a tent in a field."], ["A painting of a green umbrella sitting in a table."]], [["A black stove top oven sitting in a kitchen."], ["A group of toy cars sitting on top of boxes."]], [["A blender sitting on top of a table."], ["A table with plates of cakes on it."]], [["A group of people flying kites in a field."], ["A painting of a garden with a guitar and a table."]], [["A group of people sitting at a table eating food."], ["Two men sitting at a restaurant eating a sandwich."]], [["Two cars parked in a parking lot with a surfboard on top of it."], ["A small car on top of a rock."]], [["A man standing next to a fire hydrant with water."], ["A person laying on the ground next to a fire hydrant."]], [["A group of people flying kites in the air."], ["Three water with two umbrellas on top of it."]], [["A herd of cows grazing in a field with a mountain in the background."], ["A dog running in a field with animals."]], [["A bus parked on the side of a street."], ["An ice cream truck driving down a city street."]], [["A man riding a wave on a surfboard in the ocean."], ["Two teddy bears sitting on a table with water."]], [["A parking meter on the side of a street."], ["A pipe with graffiti on the side of a window."]], [["A woman eating a sandwich and a drink."], ["A painting of a man holding a wooden box."]], [["A horse grazing in the grass next to a house."], ["A man riding a bike next to a wall."]], [["A man standing on a snowboard on a snow covered slope."], ["A man with a backpack is in the air on a beach."]], [["A person riding a motorcycle on a race track."], ["A painting of a fire hydrant with a can of water."]], [["A double decker bus driving down a street."], ["An orange and white bus driving down a city street."]], [["A man sitting on a motorcycle."], ["An old man sitting on a row of motorcycles."]], [["A baseball player swinging a bat at a ball."], ["Three dogs sitting on top of a tee with a ball."]], [["A man and a woman laying on a bed."], ["A picture of two women in front of a mirror."]], [["A group of pictures of food on a table."], ["A group of pictures of a boat with a boat."]], [["Two people playing tennis on a tennis court."], ["A girl hitting a tennis ball with a racket."]], [["A red double decker bus on a city street."], ["A bottle of water sitting on top of a bed."]], [["A man taking a picture of himself in a mirror."], ["A statue of a man holding a vase."]], [["A group of people playing with a cow on the beach."], ["Two umbrellas and chairs in a room with the water."]], [["A man in a costume standing on a trolley."], ["A woman carrying a snowboard down a street."]], [["A woman holding a nintendo wii game controller."], ["A man with a suitcase holding an umbrella."]], [["A group of construction workers standing next to a fire hydrant."], ["A group of young men holding a skateboard."]], [["A white toilet with three skateboards on top of it."], ["A book sitting on a bed next to a bed."]], [["Two giraffes and a baby giraffe standing next to a building."], ["A baby giraffe standing next to a building."]], [["A pizza and a cup of coffee on a table."], ["A table with a pizza and a cup of coffee."]], [["A parking meter sitting on the side of a street."], ["A man on a ladder with a clock and a clock."]], [["A man doing a trick on a skateboard over an orange cone."], ["A little girl riding a skateboard with cheese."]], [["A group of people standing in a field flying kites."], ["A young boy sitting on a bed with a stuffed animal."]], [["A man brushing his teeth in front of a mirror."], ["A man sitting on a couch with three baseball bats."]], [["A person standing next to a pole on a street."], ["A man standing on a rug holding a piece of pizza."]], [["A group of chairs sitting around a table in a room."], ["A kitchen with a stove and a cage."]], [["Two young men playing a video game with a wii."], ["A man hanging from the ceiling of a room."]], [["A group of people standing around a table with food."], ["A man with a beard holding a sign in a room."]], [["A zebra standing next to a baby zebra."], ["A zebra with a bird on top of a large rock."]], [["A woman jumping in the air on a tennis court."], ["A group of girls flying kites in the air."]], [["A cat sitting on top of a chair."], ["Three objects in a leather chair."]], [["A blue bike parked on the side of a street."], ["A view of a group of people running in a window."]], [["A group of people sitting at a table."], ["A woman wearing headphones getting her hair in a chair."]], [["A young boy holding a baseball bat."], ["A doll holding a wooden board."]], [["A young boy riding a skateboard in a park."], ["A painting of a man holding a skateboard in the water."]], [["A herd of giraffes running in a field."], ["A group of action figures playing soccer in a field."]], [["Two men in suits and ties standing on a street."], ["A man in a suit and tie standing in front of two balls."]], [["A street sign with a person on it."], ["Three pictures of snowboards on a pole."]], [["A man holding a tennis ball on a tennis court."], ["A person jumping in the air with a snowboard."]], [["A group of boats sitting in front of a fence."], ["A group of elephants sitting next to a fence with boxes."]], [["A man wearing a red hat talking on a cell phone."], ["A girl with goggles and a pink hat holding a pair of scissors."]], [["A person playing with a frisbee in a field."], ["A painting of a man with beard sitting on a chair."]], [["A teddy bear sitting on top of a red jacket."], ["An orange cat laying on top of a red couch."]], [["A man cutting a cake at a table."], ["A man standing in front of a bed."]], [["A group of people walking in the rain with umbrellas."], ["A person taking a picture of a city with a bird."]], [["Three people standing on skis in the snow."], ["Two men standing in front of a bus stop with tennis rackets."]], [["A pile of luggage with a person standing next to it."], ["A man cutting a red blanket on a table."]], [["A white truck driving down a street with street signs."], ["A table with bottles of wine on it."]], [["A man walking on the tracks next to a train."], ["A painting of two trains on the tracks next to trains."]], [["A woman riding a wave on a surfboard in the ocean."], ["A group of people standing on the beach with surfboards."]], [["A banana split is sitting on top of a table."], ["A person holding a plastic container of food with eggs on it."]], [["A hotel room with a sink and a table."], ["Three people sitting at a table with a paper dunking on it."]], [["A wooden bench next to a truck in a street."], ["A white truck on a rail on a rail."]], [["A desk with two computer monitors and a laptop."], ["A car and a laptop sitting in a glass case."]], [["A man riding a horse on a dirt road."], ["Two young boys riding on a swing in a field."]], [["A person riding a dirt bike on a dirt road."], ["A motorcycle parked next to a soccer ball."]], [["A man flying through the air while riding skis."], ["A toy is sitting on a bed next to a computer keyboard."]], [["A pizza sitting on top of a cutting board."], ["A counter with a bowl of food and a cell phone."]], [["A man and a girl looking in a small refrigerator."], ["A little girl laying on a couch with a remote."]], [["A city street at night with cars and traffic lights."], ["A museum with a bunch of cars in it."]], [["A group of people playing a game of frisbee."], ["A large group of people swinging a baseball bat at a ball."]], [["An open refrigerator with food in a table."], ["A doll house with a doll in a bedroom."]], [["A kitchen with a stove and a refrigerator."], ["A doll and doll in a room with tables."]], [["Two cats sitting in front of a window."], ["A bunch of craft supplies sitting on a table."]], [["A statue of a clock on top of a street."], ["A statue of a dragon is sitting on a light."]], [["A television in a bathroom with two sinks."], ["A group of people on a wall watching television."]], [["A dog laying on the floor in a room with a desk."], ["A group of toy animals sitting next to a toy house."]], [["A group of people standing in a field."], ["A man jumping in the air with a frisbee."]], [["A cat sitting on the floor next to a bottle of water."], ["A animal is sitting on top of a table."]], [["A group of people flying kites on the beach."], ["A small boat sitting on a beach in the ocean."]], [["A woman sitting in a chair holding an umbrella."], ["A picture of a girl brushing her teeth."]], [["Two giraffes standing in a field of grass."], ["A statue of a person holding a kite on a road."]], [["A chair with a laptop computer sitting on a desk."], ["A suitcase with headphones and a table."]], [["A bedroom with a bed and a fireplace."], ["A group of people standing on top of a bed."]], [["A small bird sitting on top of a tree branch."], ["A bird sitting on the side of a row of vases."]], [["A bus with a picture on the side of a street."], ["A large teddy bear truck parked in a parking lot."]], [["A zebra standing in a field next to a tree."], ["A zebra with its head on its head."]], [["A person sitting at a table with two plates of pizza and salad."], ["A man holding a fish on a plate."]], [["A man sleeping in a bed with a cat."], ["A painting of a man running in a room."]], [["A man riding a wave on a surfboard in the ocean."], ["A pair of scissors sitting in the water."]], [["A group of zebras walking in the dirt."], ["A herd of zebras running in a field."]], [["A group of jets flying in formation in the sky."], ["A flower in the water on a table."]], [["A room with a laptop and a dresser on a bed."], ["A group of green army trucks on a table."]], [["A person holding a group of cupcakes on a table."], ["A person cutting paper with scissors on top of it."]], [["A group of children feeding a giraffe at a zoo."], ["A painting of two boys holding a baseball bat."]], [["A group of people standing around a field with animals."], ["A painting of horses on a city street."]], [["A little girl eating a banana."], ["A group of yellow chairs with a woman on top of it."]], [["A bride and groom standing in a wedding."], ["A man and a woman shaking a book."]], [["A desk with a computer monitor and a keyboard."], ["A glass table with a computer monitor on top of it."]], [["A man and a woman standing in front of fruit."], ["A man and a woman fruit on a wooden table."]], [["An airplane flying in the sky."], ["A painting of an airplane on a blanket."]], [["A herd of zebras grazing in a field."], ["A painting of zebras grazing on hay in a field."]], [["A small black dog wearing a red tie."], ["A toy cake with a woman on top of it."]], [["A baby standing next to a box of apples."], ["A group of baskets on a table with red apples."]], [["Two elephants standing next to each other in the dirt."], ["A person cutting an animal with their hand."]], [["A picture of a group of people on a bathroom floor."], ["A teddy bear hanging from the ceiling of a table."]], [["A train is on the tracks in a field."], ["A painting of an old trolley train car."]], [["A man and a child sitting on a park bench."], ["A woman sitting in two chairs with a baby."]], [["A train is sitting on the tracks."], ["A man standing in front of a train."]], [["A tree with apples on top of it."], ["A basketball sitting next to a tree."]], [["A man standing on a tennis court holding a ball."], ["A man walking down a bend with an umbrella."]], [["Two people sitting in front of an airplane on a beach."], ["Three people standing on a beach with a blanket."]], [["A statue of a cow standing in front of a street."], ["A fake sheep with a cover on it."]], [["A kitchen with a stove and a pot on the floor."], ["A painting of animals on a bed in a room."]], [["A piece of cakes and other pastries on a table in a bakery."], ["A bunch of cheese and bananas on a table."]], [["A dog hanging its head out the side view mirror of a car."], ["A picture of a man on a bike in a kitchen."]], [["A toy is sitting on a desk with a computer."], ["A doll and a tennis racket on the floor."]], [["A pizza sitting next to a can of soda on a table."], ["A plate of food with nuts and a can of soda."]], [["A desk with a laptop computer sitting on top of it."], ["A display case with an elephant eating food with an animal."]], [["A crowd of people walking on a sidewalk."], ["A group of people standing in front of a vehicle."]], [["A woman sitting at a table with two slices of pizza."], ["A man in a stroller with two plates of food."]], [["A truck driving down a road with a pile of hay."], ["A painting of a truck with a dog in a street."]], [["A group of street signs on a pole."], ["A painting of a group of motorcycles."]], [["A group of surfboards sitting on top of a beach."], ["A piece of cake sitting on top of a table."]], [["A man standing on a tennis court with a ball."], ["A woman flying a kite in front of a crowd."]], [["A bathroom with a sink and a toilet."], ["A bathroom with a toilet and a window."]], [["A group of chefs preparing food in a kitchen."], ["A large crowd of women eating food in a buffet."]], [["A group of people standing around a table with a cake."], ["A girl in a doll uniform sitting in a room with a table."]], [["A man and a woman riding a pink bike down a street."], ["A man riding a bike with a child on it."]], [["A plate of food and a glass of wine on a table."], ["A half eaten banana sitting on top of a white shoe."]], [["A white cat laying on top of a chair."], ["A white bird sitting on top of a table."]], [["A group of people standing in front of a bakery."], ["A man preparing food at a food stand."]], [["A group of people with umbrellas."], ["A man is standing on a red bench with an umbrella."]], [["Two boats and a tractor sitting on a beach."], ["A painting of green army boats on a table."]], [["A refrigerator with magnets on it in a kitchen."], ["Three boxes sitting on top of a table."]], [["Two cups and a table with a table."], ["A group of orange and white vases on a bed."]], [["Two planes flying next to each other in the sky."], ["A small plane flying in the air on a blanket."]], [["A group of cars stopped at a red traffic light."], ["A small car with a sign on the back of it."]], [["A person flying a kite in front of a lake."], ["A black and white animal is in the water."]], [["A bathroom with a sink and a toilet and a shower."], ["A bathroom with green tiles on the floor and a sink."]], [["Two people sitting in front of a large umbrella."], ["A dog jumping in the air with a man."]], [["A fighter jet parked on display at a show."], ["A fighter jet sitting on a rack on a road."]], [["A teddy bear sitting next to a table with a tennis racket."], ["A woman sitting on a bus with a remote."]], [["A group of people sitting at a table eating food."], ["Two girls sitting at a table with cups."]], [["A bunch of clocks on a wall in a room."], ["A mirror and a traffic light in front of a building."]], [["A lunch box with a sandwich and fruit in it."], ["A cake in a box on a table."]], [["A cow and a calf standing in a field."], ["A person jumping on a cow in the air."]], [["A wooden bench sitting in the grass next to the ocean."], ["A person sitting on a pier in the water."]], [["A tall tower with a clock on the top of it."], ["A mirror on the side of a building on a street."]], [["A black cat sitting in the seat of a car."], ["A cat sitting on the seat of a car with a remote."]], [["A group of cars stopped at a traffic light."], ["A painting of a traffic light on a table."]], [["A group of people sitting at a table."], ["A man laying on a bed on a room with boxes."]], [["A man wearing a skirt and a tie."], ["An old man holding a brush on a table."]], [["A woman riding a bike down a city street with cars."], ["A group of people in the back of a car."]], [["A group of zebras standing on the side of a dirt road."], ["A painting of two zebras jumping in the air."]], [["A man walking on a sidewalk next to a fire hydrant."], ["A young boy sitting on the floor with a teddy bear."]], [["A statue of a clock with two birds on top of it."], ["A microwave sitting on the side of a fence with a clock tower."]], [["An airplane flying in the sky."], ["A yellow dead orange laying on top of a bed."]], [["A kitchen with a sink and a counter."], ["A bedroom with a sink and a bed."]], [["A teddy bear and a stuffed animal sitting on a bench."], ["Three stuffed animals playing in an outdoor patio."]], [["A man and a woman holding a piece of cake."], ["A group of people with donuts in a room."]], [["A man riding a motorcycle down a street."], ["A statue of a man wearing a costume."]], [["A plate with a sandwich and a bird on a table."], ["A woman sitting on a boat in the water."]], [["A yellow and pink bus parked in a field."], ["A painting of a pink train and a yellow train."]], [["Two people sitting at a table with two pizzas."], ["A statue of a group of people in a window."]], [["A group of cows laying in the hay in a barn."], ["A bunch of vases sitting on a shelf in a store."]], [["A young boy sitting at a table with a plate of food."], ["A little girl eating a pot of food with a spoon."]], [["Two people playing a video game on a wii."], ["A group of men playing a basketball on a stage."]], [["A group of people riding horses in a field."], ["A row of clothes standing in front of a white building."]], [["Two shots of two people standing on a table."], ["A man and a woman sitting on skis."]], [["Two giraffes standing in a field with a tent."], ["A giraffe and a zebra in a field."]], [["A baseball player holding a bat on a field."], ["A man riding skis down a snow covered slope."]], [["A teddy bear sitting on the side of a tree."], ["A group of animals on display in a building."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A yellow markers on the side of a table."]], [["A bathroom with a sink and a mirror."], ["A canopy bed with a bowl on top of it."]], [["A baseball player holding a bat on a field."], ["Two baseball players sitting on top of a statue."]], [["A bunch of vegetables on a cutting board with a knife."], ["A tray with a microwave and green beans on it."]], [["A group of people skiing down a snow covered mountain."], ["A toy airplane flying in the air over white snow."]], [["A toilet in a bathroom with a green wall."], ["A group of towels on a shower curtain."]], [["A clock tower in the middle of a street."], ["A large sign with a clock on top of it."]], [["A clock on a pole in the middle of a field."], ["A painting of a clock and a television."]], [["A white toilet in a bathroom with a table."], ["A pair of shoes sitting on top of a table."]], [["Two computer monitors and a keyboard on a desk."], ["A cell phone and a laptop computer on a table."]], [["A person holding a sandwich on a plate."], ["A fish in a bath tub of water."]], [["A man riding a skateboard on a ramp."], ["A group of men riding on top of a suitcase."]], [["A person holding a piece of food in front of a building."], ["An elephant is on the side of a building."]], [["A woman taking a picture of a dog in a car window."], ["A person holding a nintendo wii game controller."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A blanket on top of a table."]], [["A pair of scissors sitting on top of a wooden box."], ["A black and white umbrella sitting on a table with soccer balls."]], [["A desk with three computers and a keyboard on it."], ["A black dog sitting at a desk with a table."]], [["A man sitting in a hospital room holding a plate of food."], ["A woman with sunglasses and a pot of food."]], [["A cat sitting next to a laptop computer."], ["A statue of a dog with a wooden boat."]], [["A man hitting a tennis ball with a racket."], ["A baby standing on top of a baby having a tennis match."]], [["A blue sign on the side of a city street."], ["A city street with a sign on the side of it."]], [["A yellow and red train is on the tracks."], ["A painting of yellow school buses in a field."]], [["A train is on a bridge over a city."], ["A graffiti on the side of a train with buildings."]], [["A group of cows standing in front of a church."], ["A dog and a cat looking at a building."]], [["Two seagulls standing on rocks next to the water."], ["A group of people standing next to a christmas tree."]], [["A man riding on the back of an elephant."], ["A statue of a man in the water."]], [["A desk with a laptop and a computer on it."], ["A row of white benches sitting on a curved stairs."]], [["A train is on the tracks next to a dirt road."], ["Two green and white double decker buses in the sand."]], [["A black cat sitting on top of a television."], ["A backpack with a television in the top of it."]], [["A computer keyboard and a mouse on a desk."], ["Two pieces of bread on top of a pile of couch."]], [["Three people standing in front of a display of donuts."], ["Three pictures of children sitting in the store with their cell phones."]], [["A yellow truck parked in a parking lot."], ["A painting of a yellow taxi with a tree."]], [["A group of people standing in the snow."], ["A picture of a man doing a trick on skis."]], [["A group of people riding skis down a snow covered slope."], ["A group of people playing with horses in the sand."]], [["A baseball player holding a bat on a field."], ["A doll sitting on top of a green field with a hair."]], [["A woman standing on a tennis court holding a racket."], ["A man jumping in the air with a tennis racket."]], [["A man standing on the beach holding a surfboard."], ["A man standing on the beach flying a kite."]], [["A man swinging a tennis racket on a court."], ["A painting of a man throwing a baseball with a guitar."]], [["A group of people skiing down a snow covered slope."], ["A white piece of white shirts on top of an airplane."]], [["A man and a woman standing in the snow."], ["A man and a woman on a roof."]], [["A white plate of broccoli and meat on a table."], ["A painting of a bird on the ground next to a skateboard."]], [["A person holding a sandwich and a cup of coffee."], ["A person s hand standing in front of a glass vase."]], [["A tray with a sandwich and a salad on a table."], ["An open suitcase with bottles of beer on a table."]], [["A cat laying on top of a laptop computer."], ["A dog sleeping in a pillow with a pillow."]], [["A red fire hydrant in the middle of leaves."], ["A fire hydrant in the middle of a forest."]], [["A kitchen with a stove and a refrigerator."], ["A kitchen with a paper towel on the floor."]], [["A group of people walking on a city street with a double decker bus."], ["A black and white photo of a city street with buses."]], [["A group of horses and a baby horse eating hay."], ["A picture of a man riding on top of an elephant with a dog."]], [["A bird standing in the water in a body of water."], ["A bird standing on top of a beach."]], [["A baseball player throwing a ball on a field."], ["A baseball player running on a field with a fence."]], [["A man sitting at a table with a cup of coffee."], ["A woman sitting on the ground with a glove."]], [["A bus driving down a city street with a building."], ["A group of graffiti on top of a city street."]], [["A woman standing in a kitchen preparing food."], ["Three women working in a room with boxes of toilet paper."]], [["A man doing a trick in the air on a skateboard."], ["A group of people flying kites on a body of water."]], [["A pizza sitting on top of a table in a restaurant."], ["A group of people sitting at an airport."]], [["A row of toilets in a bathroom."], ["A person holding a pair of glove and a mirror."]], [["A plate of food with broccoli and a table."], ["A beige coffee table with a tennis racket on it."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A blanket on top of a table."]], [["A man walking a bike down a street."], ["A black and white photo of a man with a bike."]], [["A plate of rice and vegetables on a table."], ["A group of fish with fish on top of a plate."]], [["A small plane sitting on top of an airport runway."], ["A fighter jet sitting on top of a highway."]], [["A wooden bench sitting in the middle of a park."], ["A bath tub and a bench in a garden."]], [["A wooden table with plates of food on it."], ["Two plates of food on a wooden table with a spoon."]], [["A group of people standing on a beach."], ["A group of people riding paddling in the water."]], [["A cat is standing on the wall in a room."], ["A picture of a kite with a picture on it."]], [["A man and a woman standing next to each other."], ["A black and white photo of a man holding a cup of coffee."]], [["A dog wearing a helmet sitting next to a motorcycle."], ["Two women playing with a video game on a table."]], [["A group of young people flying kites."], ["A man and a woman flying kites on a beach."]], [["A woman taking a picture of a cell phone."], ["Two people holding their cell phones in front of a building."]], [["Two street signs on a wooden pole."], ["Two neon signs on the wall in a bathroom."]], [["A person riding a skateboard at a skate park."], ["A group of people riding skateboards on a suitcase."]], [["A group of people with luggage at an airport."], ["A crowd of people walking in a city with a frisbee."]], [["A woman in a black dress standing in front of a refrigerator."], ["A woman in a dress standing on a floor in front of a refrigerator."]], [["A group of street signs in front of a tall building."], ["A large bathroom with a bunch of street signs."]], [["A man riding a wave on a surfboard in the ocean."], ["A painting of a woman walking on a beach."]], [["A man in a white shirt and tie."], ["A woman holding a baby in a car."]], [["A blue suitcase sitting next to a pair of shoes."], ["A person with their feet on a table with a bunch of shoes."]], [["A person holding a piece of chocolate cake with a drink."], ["A person holding a cup with a stick."]], [["A plate of food on a table with a glass of wine."], ["A piece of fish in a plate on a table."]], [["A plate of food with meat and a salad."], ["A plate of food and a fork on a table."]], [["A group of trucks parked in a parking lot."], ["A painting of a crowd of people watching a horse."]], [["A herd of elephants walking in a field."], ["A display of birds on a table with a clock."]], [["A broccoli plant growing in a field."], ["A group of plants in a field with leaves."]], [["Two teddy bears sitting next to a wall."], ["A bunch of white cauliflower on a blanket."]], [["A group of people standing in a room."], ["A doll in a kitchen with a doll."]], [["A person riding a horse jumping over an obstacle."], ["A group of men standing on top of a horse."]], [["Two people riding in a horse drawn carriage."], ["A woman standing next to a horse."]], [["A white sign in front of a brick building."], ["A slice of pizza sitting on top of a brick wall."]], [["A woman holding a tennis racket in front of a crowd."], ["A woman holding a carrot to a rope."]], [["A blender with food in it on a counter."], ["A computer mouse and a blender in front of it."]], [["A cat laying on top of a suitcase."], ["A pair of glasses sitting in a backpack."]], [["A donut hanging from a christmas tree."], ["A painting of a yellow bucket with a red tie in it."]], [["A picture of a kitchen with a table."], ["A kitchen with three bottles sitting on a counter."]], [["Two oranges hanging from a tree in a field."], ["A bunch of green plants and yellow flowers."]], [["A man standing next to a bike with a baby."], ["A doll posed on a table with a bike."]], [["A group of people flying a kite in a field."], ["A group of people standing in a park holding kites."]], [["A man riding a wave on a surfboard in the ocean."], ["A yellow and white cow standing in a field."]], [["A man standing in a boat on the beach."], ["A white pair of scissors sitting on a table."]], [["A young boy taking a picture of a cell phone."], ["A woman sitting at a desk with a computer keyboard."]], [["An airplane parked on the runway at an airport."], ["A fighter jet parked in front of a house."]], [["A person riding skis in the snow."], ["A man on a snowboard in the snow."]], [["A group of people riding horses on the beach."], ["A statue of a horse on the beach."]], [["A group of people sitting on benches in a park."], ["A man standing next to a helmet under a tree."]], [["A bowl of food with a fork on a table."], ["A painting of a man and a wooden fork in a fruit."]], [["A man riding a skateboard on a ramp with fire."], ["A girl swinging a baseball bat at a ball."]], [["A baseball player throwing a ball on a field."], ["A man riding a snowboard down a crowd of people."]], [["An elephant standing next to a tree in a field."], ["A group of people riding elephants."]], [["A black refrigerator in a room with a table."], ["Three pieces of luggage on a table in a mirror."]], [["Two street signs on a pole on a city street."], ["A bottle in a parking lot next to a parking meter."]], [["A woman sitting on a motorcycle with a side car."], ["A glass shelf with dishes and a table."]], [["A bunch of oranges in a glass bowl on a table."], ["A painting of an orange and a cup of tea."]], [["A garden with plants in front of a white building."], ["A bunch of plants in a wall."]], [["A man and a dog with a group of sheep."], ["A herd of animals standing in front of a crowd of people."]], [["A cat looking at a statue in front of a window."], ["A computer monitor with vegetables in front of it."]], [["A woman holding a baseball bat next to a table."], ["A group of people in a room with a fire hydrant."]], [["A group of zebras standing next to a fence."], ["A zebra with its head on top of a street."]], [["A polar bear standing next to a rock."], ["A toy elephant is playing with rocks."]], [["A birthday cake and a bag on a table."], ["A cartoon photo of a computer with a fork in it."]], [["A man riding a skateboard at a skate park."], ["A man standing on a beach in the sand."]], [["A building with a clock on the top of it."], ["A view of a bird flying over a building with a clock tower."]], [["A woman standing next to a brown horse."], ["A group of horses in a window."]], [["A person standing on top of a skateboard."], ["A person holding a bowl of food with a spoon."]], [["A black bear standing on top of a forest."], ["A stuffed animal flying over a tree."]], [["A man wearing a santa hat holding a dog in front of a christmas tree."], ["Three men wearing hats standing in front of christmas lights."]], [["A kitchen with a refrigerator and a microwave."], ["A woman standing at a restaurant with a microwave."]], [["A man riding skis on a rail in the snow."], ["A person flying through the air while riding a snowboard."]], [["A group of people riding bikes in front of a food truck."], ["A person riding a dirt bike down a ramp."]], [["A basket of fruit with a red ribbon in it."], ["A basket of fruits and vegetables on a table."]], [["A clock tower in the middle of a street."], ["A picture of cars and a clock tower."]], [["A group of three women standing in front of a sign."], ["A man and a woman holding a bunch of bananas."]], [["A brown dog sitting in a yard next to a black and white dog."], ["A dog standing on top of a chair holding a can."]], [["A pizza with meat and vegetables on top of a table."], ["A group of toy bears on a table."]], [["A group of people standing in a store with fruit."], ["A group of people standing on the back of a bus with a fruit."]], [["A young man standing in front of a television playing a video game."], ["A man standing on the floor in a building."]], [["A person riding a skateboard at a skate park."], ["A group of white bowls sitting on a sidewalk."]], [["A man and a woman eating a piece of pizza."], ["A woman looking at a cake with a grinds on it."]], [["A white toilet in a bathroom with a window."], ["A child sleeping with a pillow next to a window."]], [["A plate of chicken and potatoes and vegetables."], ["A bunch of onions in a glass basket."]], [["An airplane flying in the sky."], ["A tablet with a painted on it."]], [["A person laying on a bed in a living room."], ["Pictures of stuffed animals and clocks on a stairs."]], [["Two people playing a video game with a wii."], ["A doll laying next to a doll with a table."]], [["A group of street signs on a pole on a city street."], ["A bunch of palm trees in a city with palm trees."]], [["Two girls sitting at a table with a laptop computer."], ["A person taking a picture of a dog and a cell phone."]], [["A dog standing on top of a skateboard."], ["An elephant with its head in the middle of a crowd."]], [["A bike parked in front of a red building."], ["A group of stairs with stairs leading up to it."]], [["A plate with a piece of cake on a table."], ["A plate of eggs and toast and eggs and toast."]], [["A man riding a wave on a surfboard in the ocean."], ["A painting of a man on top of a colorful pattern."]], [["A black and white photo of a girl riding on a horse."], ["A young girl walking in the sand with a zebra."]], [["A street sign on the side of a car."], ["A toy car and a toy car in a box."]], [["A black and white photo of boats parked next to a dock."], ["A row of chairs and a sign on a sidewalk."]], [["A person holding a cell phone in their hand."], ["A person holding a baby in their hand."]], [["A young boy holding a tennis racket on a tennis court."], ["A group of young boys riding skateboards at a competition."]], [["A bedroom with a bed and a television on the wall."], ["A white chair in a living room with a table."]], [["A group of zebras eating from a trough."], ["Two zebras eating from a trough in a zoo."]], [["A living room with a couch and a table."], ["Two pieces of luggage sitting next to each other."]], [["A man riding a wave on a surfboard in the ocean."], ["A painting of an airplane flying in the sky."]], [["A group of parking meters on the side of a street."], ["A picture of a person on a ski lift."]], [["A man riding a skateboard down a street."], ["A man wearing goggles and a helmet on a skateboard."]], [["A person cutting a cake with a knife."], ["A woman cutting fruit on a table."]], [["A man sitting at a table with an umbrella."], ["A woman in a costume standing in a plate."]], [["A blue and yellow train is on the tracks next to the water."], ["A blue train is in the water."]], [["A traffic light on the side of a street."], ["A kite flying next to two cars in a street."]], [["Young boys in ties jumping in the air."], ["A young boy playing with a frisbee."]], [["A man playing a video game in a living room."], ["Two men standing on a couch with a knife."]], [["A woman in a scarf looking at her cell phone."], ["Three men wearing hair standing next to each other flying a kite."]], [["A cat sitting next to a brick wall."], ["A gray cat sitting in a brick oven."]], [["A small bathroom with a toilet and a table."], ["A pair of scissors sitting in a room with a table."]], [["A person riding a wave on a surfboard in the ocean."], ["A green bottle with a toothbrush in its mouth."]], [["A kitchen with a table and chairs in it."], ["A group of men and horses on display."]], [["A little girl sitting in a bowl on a table."], ["A young child playing with a birthday cake with a toy."]], [["A group of ducks swimming in a body of water."], ["A white boat in the water with grass."]], [["A man standing on the back of a truck."], ["A man walking with a train on top of a track."]], [["An orange motorcycle parked in front of a group of motorcycles."], ["A herd of motorcycles running down a street."]], [["A black and white cow standing next to a man."], ["A man standing next to a cow."]], [["A black and white photo of people on a beach with sail boats."], ["A painting of a baby on a table."]], [["A motorcycle parked on the side of a road."], ["A painting of a person taking a picture of a fence."]], [["Two people in a red boat in the water."], ["A little girl standing on a rug next to an airplane."]], [["A herd of sheep walking down a city street."], ["A little girl sitting in the middle of a crowd of people."]], [["A suitcase sitting on the ground in the dirt."], ["A glass table with a salad on top of it."]], [["A man riding a skateboard at a skate park."], ["Two young boys playing with frisbees in a parking lot."]], [["A man and a child on a snowboard down a snow covered slope."], ["A man holding a skateboard on a ramp."]], [["A cat and a dog looking out a window."], ["A toy animal playing with a cat on a table."]], [["A baseball player standing on the mound."], ["A baseball pitcher throwing a ball on a field."]], [["A black and white photo of a man riding a horse."], ["A woman riding a skateboard with a leash."]], [["A bedroom with a bed and a table."], ["A painting of a white dress under an umbrella."]], [["A small bed with bottles of water on it."], ["A bedroom with a bed and a table."]], [["A pizza is in an oven."], ["A hot dog in a microwave."]], [["A yellow bird sitting on a tree branch."], ["A tree with food hanging from it on a table."]], [["A group of stuffed animals standing in beds."], ["A shopping cart with a dog in it."]], [["A man standing in front of a refrigerator."], ["A little girl blow drying her hair in a room."]], [["Two elephants standing next to a fence in a zoo."], ["A man standing on top of a boat."]], [["A kitchen sink with dishes in it."], ["A plate with spoons and cups of coffee on a table."]], [["Three hot dogs with toppings on top of a table."], ["Two hot dogs with ketchup and mustard on top of it."]], [["A group of birds sitting on top of a wooden roof."], ["A row of people sitting on an seats on an airplane."]], [["A bus driving down a street in the rain."], ["A picture of a bus and a cell phone on the tracks."]], [["Two men playing a game of soccer on a field."], ["A picture of a man with a camera."]], [["An airplane flying over a car in the sky."], ["A toy is sitting on a bed with a toy."]], [["A black cat sitting in the grass."], ["A cat sitting on the ground next to a pair of shoes."]], [["A bathroom with a toilet and a bath tub."], ["A person holding a tennis racket on a bed."]], [["A laptop computer sitting on top of a wooden table."], ["An open oven with the back of it."]], [["A group of people standing around a bench with frisbees."], ["A group of people wearing helmets on a bench."]], [["A group of bread sitting on a plate next to a keyboard."], ["A desk with a keyboard and a bottle of wine."]], [["A cat standing on a bathroom floor next to a toilet."], ["A toy is sitting on a checkered floor in a bathroom."]], [["A person riding a wave on a surfboard in the ocean."], ["A stuffed animal laying on top of a bed."]], [["A man holding a cell phone in front of a crowd."], ["A man sitting on top of a animal."]], [["A man standing under a sign in the grass."], ["A little girl holding a large sign in a park."]], [["A man doing a trick on a skateboard at a skate park."], ["A painting of an umbrella on top of a tennis court."]], [["A woman walking a small white dog down a sidewalk."], ["A toy is sitting on a bed with a shoe."]], [["A man riding a horse on a field with mountains in the background."], ["A painting of a man riding a horse in a field."]], [["A man riding a skateboard down a rail."], ["A black and white photo of a baseball game."]], [["Four pictures of a bowl of food on a table."], ["A person holding a plate of food on a stove."]], [["A sandwich on a plate on a table."], ["A white bowl with flowers on top of it."]], [["Two hot dogs in a paper plate on a table."], ["A box with a sandwich and grapes in it."]], [["A black horse standing in a field."], ["A painting of an elephant and a bear."]], [["A group of people on a boat in the water."], ["A painting of two boats and a van on the ocean."]], [["A bathroom with a sink and a mirror."], ["A bathroom with three stalls and a toilet."]], [["An orange fire hydrant on the side of a street."], ["A display of a sign on top of a street."]], [["A toilet with the seat up in a bathroom."], ["A broken parking meter sitting on top of a street."]], [["A group of people standing next to a group of signs."], ["A sign on the beach with a sign on it."]], [["A cat laying on top of a laptop computer."], ["A picture of a cat with a toy in it."]], [["A man holding a tennis racket on a tennis court."], ["A man walking on a bed with his feet."]], [["A cat sitting in front of a television."], ["A picture of two cats on a computer monitor."]], [["An airplane flying in the sky with a flag."], ["A bird sitting on top of a pole with an american flag."]], [["A group of stuffed teddy bears sitting on a table."], ["A monkey holding a monkey in front of a computer."]], [["A bathroom with a toilet and a sink and a tub."], ["A machine with a table on top of it."]], [["A street sign in front of a group of bikes."], ["A cupcake and a remote control on a plate."]], [["A man riding a snowboard down a snow covered slope."], ["A group of three items on top of a table."]], [["A large clock in the middle of a building."], ["A group of people riding skis in a skate park."]], [["A boat is sitting in the water on a lake."], ["A painting of a person with a green umbrella in the water."]], [["An orange train is on the tracks in a forest."], ["A painting of a semi truck driving down a road."]], [["A man doing a trick on a skateboard on a city street."], ["Two girls sitting on a skateboard in a park."]]], "scores": {"meteor": [[0.7853703279064436, 0.2839506172839506], [0.47908863920099876, 0.40879120879120884], [0.7585268884703913, 0.12658227848101264], [0.4094799210006583, 0.15243902439024393], [0.5555555555555556, 0.2715328467153285], [0.372, 0.43725490196078437], [0.40990755276469565, 0.17094017094017094], [0.5863023175371843, 0.16025641025641027], [0.6944444444444444, 0.22962962962962963], [0.3468406593406593, 0.10989010989010987], [0.46875, 0.125], [0.7060399917542773, 0.3468406593406593], [0.3468406593406593, 0.3506944444444444], [0.7519964507542148, 0.18072289156626503], [0.7687074829931974, 0.08547008547008547], [0.5782312925170067, 0.4505050505050505], [0.9995, 0.14563106796116504], [0.8017676767676769, 0.14851485148514848], [0.616925669350309, 0.13888888888888887], [0.5645569620253165, 0.3680555555555556], [0.3506944444444444, 0.412087912087912], [0.5373493975903614, 0.16853932584269662], [0.9054545454545455, 0.5162738496071829], [0.4320647177790035, 0.1834862385321101], [0.6861724281549355, 0.35046728971962615], [0.6310013717421126, 0.2839506172839506], [0.8918539325842695, 0.2533783783783784], [0.33929649758454106, 0.38448275862068976], [0.5318681318681319, 0.31562500000000004], [0.22471910112359547, 0.3546348314606741], [0.5160550458715595, 0.12195121951219512], [0.15151515151515152, 0.14423076923076922], [0.520408163265306, 0.2634593356242841], [0.6880733944954129, 0.20495129870129872], [0.6792413935271077, 0.10000000000000002], [0.5876795162509448, 0.18518518518518517], [0.7521527129370266, 0.30491803278688523], [0.9041027559546079, 0.19841269841269843], [0.6691919191919192, 0.48076923076923084], [0.537876167416119, 0.15151515151515152], [0.25, 0.20000000000000004], [0.5269186712485682, 0.1530612244897959], [0.6578144078144077, 0.19607843137254904], [0.8436213991769549, 0.5569306930693068], [0.5783794999481273, 0.29224537037037035], [0.32206632653061223, 0.23379629629629628], [0.5913134484563056, 0.38027108433734946], [0.5724489795918367, 0.18691588785046728], [0.5160550458715595, 0.18750000000000003], [0.7789062500000001, 0.25], [0.5111111111111111, 0.3116531165311653], [0.5162738496071829, 0.13636363636363635], [0.618131868131868, 0.40760869565217384], [0.6988249845392702, 0.20202020202020204], [0.3647058823529412, 0.4000000000000001], [0.7390260631001373, 0.24390243902439024], [0.8017676767676769, 0.37500000000000006], [0.8737244897959183, 0.2388369678089304], [0.8819444444444444, 0.16304347826086954], [0.40879120879120884, 0.18292682926829268], [0.6657910689028086, 0.5060506050605059], [0.66167290886392, 0.39118246687054015], [0.8629377676996723, 0.5439024390243904], [0.41682242990654206, 0.09174311926605505], [0.5964109781843773, 0.05681818181818182], [0.46875, 0.11904761904761905], [0.40879120879120884, 0.3546348314606741], [0.3116531165311653, 0.18292682926829268], [0.40879120879120884, 0.2808302808302808], [0.5813754073057795, 0.38412698412698415], [0.46875, 0.2808302808302808], [0.8993827160493828, 0.446], [0.66167290886392, 0.1234567901234568], [0.4179775280898876, 0.34403669724770647], [0.5975308641975308, 0.1234567901234568], [0.9139118457300276, 0.3757440476190476], [0.782267115600449, 0.6954520089285714], [0.46875, 0.46875], [0.3506944444444444, 0.17045454545454547], [0.560374149659864, 0.5913134484563056], [0.6410256410256411, 0.12820512820512822], [0.37763136750763293, 0.09174311926605505], [0.1648351648351648, 0.28714107365792757], [0.4101694915254237, 0.29040404040404044], [0.625, 0.1234567901234568], [0.4440665154950869, 0.10869565217391303], [0.7585268884703913, 0.25555555555555554], [0.5625, 0.18292682926829268], [0.8103975535168196, 0.21367521367521372], [0.5373493975903614, 0.3194444444444444], [0.8228395061728395, 0.16666666666666666], [0.7687074829931974, 0.125], [0.39453125, 0.17006802721088438], [0.23232323232323232, 0.2293577981651376], [0.5902439024390245, 0.2929133858267717], [0.6226379440665155, 0.206043956043956], [0.7602601480152501, 0.1234567901234568], [0.4955555555555556, 0.16666666666666666], [0.7349537037037036, 0.28956422018348627], [0.8017676767676769, 0.34403669724770647], [0.6979762661580843, 0.31000000000000005], [0.5975308641975308, 0.13888888888888887], [0.9993141289437586, 0.6290648127382821], [0.7145928899082569, 0.3757575757575758], [0.5952065677966102, 0.12605042016806722], [0.6724489795918367, 0.4224058769513315], [0.7687074829931974, 0.12195121951219512], [0.8211575489862951, 0.40917431192660547], [0.5506172839506173, 0.412087912087912], [0.1875, 0.3194444444444444], [0.650318287037037, 0.19801980198019806], [0.7282110091743119, 0.3896604938271605], [0.5943152454780362, 0.32206632653061223], [0.38110236220472443, 0.20380434782608692], [0.1234567901234568, 0.0617283950617284], [0.7668240850059032, 0.29760000000000003], [0.1851851851851852, 0.1234567901234568], [0.6962184873949581, 0.16025641025641027], [0.6310013717421126, 0.33075299085151305], [0.5076628352490421, 0.17094017094017094], [0.5111111111111111, 0.24313725490196078], [0.7913056930693071, 0.43725490196078437], [0.5574156746031746, 0.16806722689075632], [0.8918539325842695, 0.6578144078144077], [0.5563218390804598, 0.5681818181818182], [0.30303030303030304, 0.10869565217391303], [0.6792413935271077, 0.37500000000000006], [0.5506172839506173, 0.45731707317073167], [0.7059558517284465, 0.16666666666666666], [0.15151515151515152, 0.23445463812436282], [0.618131868131868, 0.35046728971962615], [0.6898846495119787, 0.1694915254237288], [0.5452674897119341, 0.14018691588785046], [0.6532519549876025, 0.3546348314606741], [0.7309228039041704, 0.5011235955056179], [0.7789062500000001, 0.25555555555555554], [0.38027108433734946, 0.38265306122448983], [0.4024496937882765, 0.46668667466986796], [0.5698720166032515, 0.290625], [0.5773420479302832, 0.125], [0.7789062500000001, 0.14851485148514848], [0.5164292279411764, 0.20495129870129872], [0.41360294117647056, 0.3381818181818182], [0.8101794934841405, 0.1875], [0.372, 0.13888888888888887], [0.5294873855053832, 0.17045454545454547], [0.32327586206896547, 0.4726890756302521], [0.7023437500000002, 0.21842355175688513], [0.5011235955056179, 0.24038461538461542], [0.8200597312095569, 0.14851485148514848], [0.6476468138275718, 0.11029411764705882], [0.5306603773584906, 0.24338624338624337], [0.3896604938271605, 0.4054545454545455], [0.8918539325842695, 0.5616605616605616], [0.6880733944954129, 0.5022321428571428], [0.3, 0.15120967741935487], [0.4440366972477064, 0.3188131313131313], [0.31525423728813556, 0.3151260504201681], [0.4810495626822157, 0.15384615384615385], [0.27777777777777773, 0.40760869565217384], [0.6918367346938775, 0.3968750000000001], [0.38265306122448983, 0.32206632653061223], [0.5160550458715595, 0.290625], [0.46875, 0.33938172043010756], [0.47920792079207924, 0.13888888888888887], [0.21978021978021975, 0.11235955056179774], [0.8103975535168196, 0.4054545454545455], [0.6222271517302573, 0.10989010989010987], [0.9995, 0.309436274509804], [0.2583333333333333, 0.21471088435374147], [0.40879120879120884, 0.2222222222222222], [0.9993141289437586, 0.211864406779661], [0.8287608596250572, 0.38490853658536583], [0.7500000000000001, 0.125], [0.2504960317460318, 0.3962101636520241], [0.5782312925170067, 0.14851485148514848], [0.37500000000000006, 0.10000000000000002], [0.5616605616605616, 0.18518518518518517], [0.39480452674897115, 0.28434684684684686], [0.46875, 0.1111111111111111], [0.3546348314606741, 0.1851851851851852], [0.5575, 0.3506944444444444], [0.6724489795918367, 0.537876167416119], [0.4213483146067415, 0.15151515151515152], [0.5399659863945577, 0.27777777777777773], [0.7948022959183674, 0.32051282051282054], [0.18018018018018017, 0.3506944444444444], [0.3444444444444445, 0.25], [0.8301839254220206, 0.1875], [0.5739795918367346, 0.14851485148514848], [0.4641544117647058, 0.2272727272727273], [0.4179775280898876, 0.20122484689413825], [0.5616605616605616, 0.48478260869565226], [0.5769944341372912, 0.12195121951219512], [0.6859756097560975, 0.234375], [0.6954520089285714, 0.125], [0.5377777777777778, 0.25813692480359146], [0.8421440865502825, 0.14018691588785046], [0.7361111111111112, 0.3194444444444444], [0.6600900423728814, 0.22030651340996166], [0.5060506050605059, 0.26976495726495725], [0.38490853658536583, 0.18292682926829268], [0.6578144078144077, 0.3506944444444444], [0.45074722802506817, 0.2388369678089304], [0.7014492753623188, 0.17857142857142858], [0.4523364485981308, 0.4179775280898876], [0.4737654320987654, 0.6114130434782608], [0.738954922628392, 0.49010989010989015], [0.32763532763532766, 0.234375], [0.6320224719101123, 0.618131868131868], [0.4213483146067415, 0.4766949152542372], [0.6792413935271077, 0.1834862385321101], [0.5318681318681319, 0.21067415730337075], [0.47920792079207924, 0.1834862385321101], [0.43684710351377026, 0.1293103448275862], [0.6558823529411766, 0.41296296296296303], [0.4227272727272727, 0.11235955056179774], [0.32206632653061223, 0.3234880450070324], [0.47959183673469385, 0.16666666666666666], [0.5060506050605059, 0.15873015873015875], [0.4295051353874883, 0.45510204081632655], [0.3381818181818182, 0.18382352941176472], [0.368595041322314, 0.16666666666666666], [0.598404255319149, 0.37307380373073795], [0.3177966101694915, 0.21842355175688513], [0.618872549019608, 0.44158415841584164], [0.8861997310842195, 0.09900990099009903], [0.66167290886392, 0.21978021978021975], [0.8466372282608694, 0.2735294117647059], [0.3331163194444444, 0.3381818181818182], [0.3872, 0.12096774193548389], [0.5160550458715595, 0.4440366972477064], [0.41360294117647056, 0.1694915254237288], [0.7853703279064436, 0.66167290886392], [0.9041027559546079, 0.446], [0.8152173913043477, 0.24811218985976266], [0.46046046046046046, 0.34128440366972473], [0.5612244897959183, 0.44158415841584164], [0.78677398989899, 0.48888888888888893], [0.4440366972477064, 0.2388369678089304], [0.12820512820512822, 0.25302530253025296], [0.5506172839506173, 0.25166191832858503], [0.5506172839506173, 0.14018691588785046], [0.19132653061224492, 0.31562500000000004], [0.618131868131868, 0.5472527472527473], [0.49975895870159076, 0.2547945205479452], [0.40917431192660547, 0.17746913580246912], [0.3876262626262626, 0.4265202702702703], [0.5377777777777778, 0.16666666666666666], [0.1736111111111111, 0.21978021978021975], [0.7636335784313727, 0.3188131313131313], [0.5698720166032515, 0.4293103448275863], [0.2735294117647059, 0.12048192771084339], [0.3468406593406593, 0.05617977528089887], [0.41333333333333333, 0.4955555555555556], [0.611317254174397, 0.3896604938271605], [0.6400966183574879, 0.18072289156626503], [0.6724489795918367, 0.3647058823529412], [0.3896604938271605, 0.2222222222222222], [0.35046728971962615, 0.18181818181818182], [0.7059558517284465, 0.29224537037037035], [0.36831683168316837, 0.20000000000000004], [0.9280792420327304, 0.3188131313131313], [0.4472257653061224, 0.23232323232323232], [0.41802832244008714, 0.3963568898633834], [0.5563218390804598, 0.12195121951219512], [0.6465763875643715, 0.5257009345794392], [0.7711943069306932, 0.21067415730337075], [0.6087662337662337, 0.2469135802469136], [0.864795918367347, 0.2388369678089304], [0.31250000000000006, 0.1669973544973545], [0.7270233196159123, 0.38490853658536583], [0.9993141289437586, 0.1834862385321101], [0.4518072289156627, 0.18072289156626503], [0.7017173423423423, 0.18181818181818182], [0.8880208333333333, 0.45731707317073167], [0.3811965811965813, 0.3335084033613446], [0.2839506172839506, 0.11235955056179774], [0.5975308641975308, 0.32206632653061223], [0.6376262626262627, 0.21842355175688513], [0.618131868131868, 0.1851851851851852], [0.2118288590604027, 0.12820512820512822], [0.6284569902727446, 0.3116531165311653], [0.6360544217687074, 0.3506944444444444], [0.4043478260869566, 0.1648351648351648], [0.7622047244094489, 0.21657250470809788], [0.4732510288065843, 0.125], [0.8072916666666667, 0.28956422018348627], [0.5769944341372912, 0.2607709750566893], [0.7270233196159123, 0.18750000000000003], [0.6310013717421126, 0.45731707317073167], [0.703125, 0.125], [0.6465763875643715, 0.40917431192660547], [0.9163223140495868, 0.25813692480359146], [0.46464646464646464, 0.2525], [0.5361402671755726, 0.2545362903225807], [0.9996243425995492, 0.2886710239651416], [0.6346938775510204, 0.37500000000000006], [0.6332138590203108, 0.2839506172839506], [0.44592696629213474, 0.13888888888888887], [0.7687074829931974, 0.21505376344086022], [0.6724489795918367, 0.6284097797534854], [0.29224537037037035, 0.2469135802469136], [0.625, 0.31562500000000004], [0.5888888888888889, 0.15873015873015875], [0.625, 0.3177966101694915], [0.654320987654321, 0.3795918367346939], [0.8722527472527472, 0.12195121951219512], [0.7080965909090909, 0.12711864406779658], [0.854119425547997, 0.38490853658536583], [0.5300453514739228, 0.09900990099009903], [0.634712600636585, 0.19810508182601205], [0.8918539325842695, 0.31794871794871804], [0.7773446457234581, 0.18292682926829268], [0.3547523427041499, 0.12195121951219512], [0.7098765432098765, 0.13333333333333333], [0.8993827160493828, 0.2808302808302808], [0.8654513888888888, 0.654320987654321], [0.4737654320987654, 0.48478260869565226], [0.45731707317073167, 0.18181818181818182], [0.5681818181818182, 0.2949766355140187], [0.618131868131868, 0.11904761904761905], [0.8211575489862951, 0.2027027027027027], [0.5667811679127096, 0.18750000000000003], [0.7212094907407407, 0.25252525252525254], [0.6792413935271077, 0.8017676767676769], [0.5076628352490421, 0.3155006858710563], [0.7934426229508196, 0.3126050420168068], [0.6859756097560975, 0.1744186046511628], [0.6657910689028086, 0.45510204081632655], [0.5208333333333333, 0.40917431192660547], [0.6849868660335421, 0.1851851851851852], [0.6443520642201835, 0.13761467889908252], [0.9990234375, 0.38027108433734946], [0.4472257653061224, 0.12903225806451613], [0.9054545454545455, 0.1530612244897959], [0.12658227848101264, 0.12195121951219512], [0.4505050505050505, 0.15748031496062992], [0.6215431415929203, 0.20618556701030927], [0.7948022959183674, 0.31250000000000006], [0.4955555555555556, 0.27777777777777773], [0.8211575489862951, 0.4481481481481482], [0.4361263736263736, 0.16666666666666666], [0.5452674897119341, 0.5113636363636364], [0.4049744897959184, 0.1851851851851852], [0.38490853658536583, 0.5199864498644986], [0.8950617283950617, 0.3064320388349515], [0.8950617283950617, 0.10000000000000002], [0.32538659793814434, 0.35907859078590787], [0.654320987654321, 0.16304347826086954], [0.3639097744360902, 0.3271604938271605], [0.5424733996162567, 0.2028218694885362], [0.1851851851851852, 0.38027108433734946], [0.6320203400121432, 0.6251876876876877], [0.7521527129370266, 0.29224537037037035], [0.8030303030303031, 0.3506944444444444], [0.755560651226783, 0.28714107365792757], [0.41360294117647056, 0.2513513513513513], [0.4958545918367347, 0.44999999999999996], [0.3153153153153153, 0.5318681318681319], [0.854119425547997, 0.40917431192660547], [0.5452674897119341, 0.1648351648351648], [0.600907029478458, 0.15], [0.5205314009661836, 0.31794871794871804], [0.8099489795918368, 0.17523364485981308], [0.7773446457234581, 0.16853932584269662], [0.6988249845392702, 0.1694915254237288], [0.45510204081632655, 0.29040404040404044], [0.6988249845392702, 0.37128712871287134], [0.6114130434782608, 0.16853932584269662], [0.3896604938271605, 0.12195121951219512], [0.7361111111111112, 0.1875], [0.5269186712485682, 0.33513513513513515], [0.4776739356178608, 0.29224537037037035], [0.20833333333333331, 0.2949766355140187], [0.4990583804143125, 0.2839506172839506], [0.537876167416119, 0.4766949152542372], [0.9530428249436514, 0.1851851851851852], [0.7390260631001373, 0.15151515151515152], [0.4536585365853659, 0.18292682926829268], [0.5377777777777778, 0.1388888888888889], [0.6126582278481013, 0.5575], [0.6944444444444445, 0.4213483146067415], [0.40917431192660547, 0.10989010989010987], [0.46668667466986796, 0.19607843137254904], [0.3758169934640523, 0.18518518518518517], [0.7212094907407407, 0.1834862385321101], [0.446, 0.08771929824561403], [0.625, 0.3116531165311653], [0.7681094415788293, 0.12048192771084339], [0.8833333333333334, 0.16853932584269662], [0.6428433641975309, 0.21978021978021975], [0.738954922628392, 0.35866477272727276], [0.40879120879120884, 0.2450980392156863], [0.7711943069306932, 0.12820512820512822], [0.5199864498644986, 0.5113636363636364], [0.46296296296296297, 0.12195121951219512], [0.8918539325842695, 0.11363636363636365], [0.29523809523809524, 0.1750380517503805], [0.4955555555555556, 0.5681818181818182], [0.738954922628392, 0.474468085106383], [0.703125, 0.20161290322580647], [0.6388888888888888, 0.30487804878048785], [0.8880208333333333, 0.29040404040404044], [0.7545454545454545, 0.4440366972477064], [0.5841316118284048, 0.20202020202020204], [0.806697108066971, 0.4323630136986301], [0.5010893246187365, 0.20202020202020204], [0.616925669350309, 0.7687074829931974], [0.6988249845392702, 0.20408163265306123], [0.5635887028581092, 0.38793103448275856], [0.8551587301587302, 0.16806722689075632], [0.5813754073057795, 0.3206896551724139], [0.37500000000000006, 0.30491803278688523], [0.5991586538461539, 0.15873015873015875], [0.8819444444444444, 0.1851851851851852], [0.485126253891387, 0.2652310924369748], [0.39480452674897115, 0.45731707317073167], [0.3599374021909233, 0.1875], [0.5563218390804598, 0.2634593356242841], [0.46890927624872564, 0.23662551440329216], [0.6411049268192124, 0.28956422018348627], [0.3757440476190476, 0.25302530253025296], [0.618131868131868, 0.19607843137254904], [0.8918539325842695, 0.20380434782608692], [0.6181795634920636, 0.11811023622047245], [0.618131868131868, 0.2808302808302808], [0.9996243425995492, 0.2272727272727273], [0.44285714285714284, 0.15], [0.7212094907407407, 0.09174311926605505], [0.8236151603498543, 0.24390243902439024], [0.8017676767676769, 0.6861724281549355], [0.44708508403361347, 0.3468406593406593], [0.24658203125000006, 0.37796610169491524], [0.66167290886392, 0.41333333333333333], [0.7687074829931974, 0.05555555555555555], [0.6818181818181819, 0.2839506172839506], [0.8687160326086956, 0.3506944444444444], [0.42720073103868417, 0.4766949152542372], [0.5739795918367346, 0.32538659793814434], [0.6988249845392702, 0.3155006858710563], [0.4745565878378378, 0.3140845070422535], [0.5162738496071829, 0.15], [0.4213483146067415, 0.12658227848101264], [0.40879120879120884, 0.4955555555555556], [0.5439024390243904, 0.21296296296296297], [0.5575, 0.5575], [0.4955555555555556, 0.25302530253025296], [0.8152173913043477, 0.16666666666666666], [0.41333333333333333, 0.11235955056179774], [0.446, 0.19801980198019806], [0.7789062500000001, 0.41682242990654206], [0.654320987654321, 0.4043478260869566], [0.35830999066293184, 0.3546348314606741], [0.7485875706214691, 0.32608695652173914], [0.4282069970845481, 0.11235955056179774], [0.4240362811791383, 0.136986301369863], [0.6944444444444445, 0.25302530253025296], [0.8819444444444444, 0.33938172043010756], [0.3757575757575758, 0.1694915254237288], [0.6226379440665155, 0.18750000000000003], [0.39574468085106385, 0.25], [0.3444444444444445, 0.4429133858267717], [0.42613636363636365, 0.4543245869776481], [0.2652310924369748, 0.08620689655172413], [0.7773446457234581, 0.1111111111111111], [0.6944444444444445, 0.2949766355140187], [0.5717948717948719, 0.12820512820512822], [0.864795918367347, 0.38490853658536583], [0.1530612244897959, 0.14018691588785046], [0.7773446457234581, 0.2808302808302808], [0.618131868131868, 0.28714107365792757], [0.5269186712485682, 0.27173913043478265], [0.582287961055982, 0.4054545454545455], [0.6506642512077294, 0.27173913043478265], [0.5876795162509448, 0.4360360360360361], [0.3468406593406593, 0.3546348314606741], [0.3506944444444444, 0.1834862385321101], [0.6392045454545455, 0.4000000000000001], [0.7052154195011338, 0.16666666666666666], [0.8993827160493828, 0.2388369678089304], [0.8950617283950617, 0.5452674897119341], [0.5305305305305306, 0.1694915254237288], [0.4634661835748792, 0.16304347826086954], [0.8101794934841405, 0.1851851851851852], [0.5667811679127096, 0.2607709750566893], [0.6792413935271077, 0.3758169934640523], [0.5495818399044207, 0.23232323232323232], [0.8993827160493828, 0.2362204724409449], [0.6329534662867996, 0.3331163194444444], [0.8918539325842695, 0.1234567901234568], [0.38490853658536583, 0.31562500000000004], [0.5215419501133786, 0.3506944444444444], [0.49010989010989015, 0.13888888888888887], [0.7861781076066792, 0.1530612244897959], [0.616925669350309, 0.2272727272727273], [0.6320224719101123, 0.3546348314606741], [0.49975895870159076, 0.13761467889908252], [0.4056437389770724, 0.15748031496062992], [0.3381818181818182, 0.12195121951219512], [0.654320987654321, 0.3468406593406593], [0.446, 0.37878787878787884], [0.7132444814660558, 0.43069584736251404], [0.6411049268192124, 0.36764705882352944], [0.6050290486564996, 0.2320772058823529], [0.4265202702702703, 0.1388888888888889], [0.20000000000000004, 0.15151515151515152], [0.28956422018348627, 0.206043956043956], [0.4732510288065843, 0.19363496932515337], [0.30487804878048785, 0.27479091995221033], [0.6233062330623306, 0.10000000000000002], [0.8300000000000002, 0.37878787878787884]]}}