{"seed": 42, "num_examples": 512, "batch_size": 1, "captions": [[["An elephant in the back of a truck."], ["A bed with a group of pillows on it."], ["A bed with a group of towels on it."]], [["A person doing a trick on a skateboard."], ["A person sitting in a chair with their feet on a skateboard."], ["A person doing a trick on a skateboard."]], [["A man standing on a tennis court holding a racket."], ["A man jumping in the air with a board."], ["A man standing on a tennis court holding a racket."]], [["A man standing in a box with a pizza in it."], ["A picture of a man in a bathroom with a toilet."], ["A picture of a man in a bathroom with a toilet."]], [["A pair of shoes and a pair of shoes on a table."], ["A group of gloves and gloves on a table."], ["A group of gloves and black gloves on a table."]], [["A table with glasses of wine and plates of bread."], ["A vase with yellow flowers next to a glass of wine."], ["A table with a bottle of wine and a glass."]], [["A living room with a table and a couch."], ["A dining room with orange couch and chairs."], ["A living room with a couch and a table."]], [["A man sitting at a table with a laptop computer."], ["A painting of people sitting at tables eating trains and trains."], ["A man sitting at a table with a laptop computer."]], [["A desk with two computer monitors and a keyboard."], ["A view of a bus with a television on it."], ["A desk with two computer monitors and a keyboard."]], [["Two elephants and a baby elephant standing in a zoo."], ["A thumbs up picture of a person on a beach."], ["A thumbs up picture of a person on a beach."]], [["A bathroom with a toilet with a table."], ["Two cupcakes with frosting on top of a bed."], ["Two cupcakes with a seat on a table."]], [["An airplane sitting on top of an airport runway."], ["A painting of a sandwhich and a remote and a bench."], ["A person with a airplane and a airplane in the background."]], [["A group of people riding a bike down a street."], ["A man on a bike with a man on it."], ["Two men riding a bike down a street."]], [["Two giraffes and a baby giraffe standing next to each other."], ["A man working on a machine in a room."], ["A man working on a giraffe in a cage."]], [["A woman sitting on a toilet on the sidewalk."], ["A man riding a snow covered road in the snow."], ["A man riding a snow covered road in the snow."]], [["A large clock on the wall of a building."], ["A group of jets with slices of bread in an airport."], ["A large clock on the wall of a building."]], [["A man laying on the beach next to a surfboard."], ["A brush in it sitting on a table."], ["A man sitting on a beach with a surfboard."]], [["A cat laying on the hood of a car."], ["A painting of a train with a dog in its mouth."], ["A dog laying on the hood of a car."]], [["A bride and groom standing next to a wedding cake."], ["A person with their feet on a chocolate cake."], ["A person with their feet on a chocolate cake."]], [["A large dog sleeping on a bed."], ["The bottom of a transportation with the bottom of it."], ["A dog sleeping on a bed with a table."]], [["A baby laying in a bed with a blanket."], ["A man in a bowl with fish and a cell phone."], ["A baby sitting on a bed holding a cell phone."]], [["A train is sitting on the tracks in a train yard."], ["A group of skateboards are lined up in a field."], ["A train is sitting on the tracks in a train yard."]], [["A stack of pancakes sitting on a plate on a table."], ["A stack of pancakes sitting on top of a plate."], ["A stack of pancakes sitting on a plate on a table."]], [["A pair of scissors sitting on top of a piece of paper."], ["A rope with the back of a pair of scissors."], ["A pair of scissors sitting on top of a table."]], [["A book shelf with a bunch of books."], ["Two trays of donuts on paper plates in a room."], ["A book shelf with a bunch of books."]], [["Two birds sitting on top of a tree branch."], ["Two cats are sitting in front of purple flowers."], ["Two cats are sitting in front of purple flowers."]], [["A woman sitting at a table eating food."], ["A group of bowls of scissors and bowls on a table."], ["A group of bowls of scissors and bowls on a table."]], [["A man standing in the grass with a frisbee."], ["A dog playing with a ball in a field."], ["A man standing next to a brown and white frisbee."]], [["A parking meter sitting on the side of a street."], ["A knife in the middle of a mirror of a label."], ["A parking meter on the side of a street."]], [["A banana sitting on top of a desk."], ["Group of forks with water on top of a table."], ["A phone sitting on top of a desk with a banana."]], [["A group of people in costumes walking down a street."], ["A group of people in the sand with plants."], ["A group of people in costumes walking in a street."]], [["A white bouquet of white flowers on a table."], ["Three rows of flowers sitting on the seats."], ["A table with a vase with flowers in it."]], [["A woman standing in a kitchen with a pot of food."], ["A soldier standing in front of a cake."], ["A woman standing in a kitchen with a pot of food."]], [["A clock tower in the middle of a city street."], ["A clock tower in the middle of a shopping mall."], ["A clock tower in the middle of a city."]], [["Two tennis players shaking hands on a tennis court."], ["A person canopies in a white dress sitting next to a fence."], ["Two tennis players shaking hands on a tennis court."]], [["A living room with a couch and a table."], ["Baskets and pillows in a building with buildings in it."], ["A living room with a couch and a table."]], [["A man sitting on a bench in front of a church."], ["A camera with an old truck in front of it."], ["A black and white photo of a church with a clock tower."]], [["A man riding on the back of an elephant."], ["A small baby elephant playing with a stick on a rope."], ["A man riding on the back of an elephant."]], [["A stop sign with writing on it."], ["A stop sign with graffiti on the side of a street."], ["A stop sign with writing on it."]], [["A white bathroom with a bath tub and a toilet."], ["The view of an airplane with luggage on the floor."], ["A white bathroom with a bath tub and a sink."]], [["A group of people standing in front of an airplane."], ["A silver prop man in a dress on a table."], ["A large airplane sitting on top of an airport runway."]], [["A green bus driving down a street."], ["A painting of a double decker bus on a street."], ["A painting of a double decker bus on a street."]], [["Two black and white cats laying next to each other."], ["A woman holding a black and white cat on a couch."], ["Two cats laying next to each other on a table."]], [["A pizza sitting on top of a white plate on a table."], ["A stuffed animal deep in a deep dish dish in a table."], ["A stuffed animal deep in a deep dish dish in a table."]], [["A man riding a wave on a surfboard with a dog."], ["An electric device sitting on top of a paper."], ["A person riding a wave on a surfboard in the ocean."]], [["A plate with a sandwich and french fries."], ["A goat with sauce in a bowl on a table."], ["A plate with a sandwich and french fries."]], [["A red and white bus parked on the street."], ["A red and silver bus on top of a fence."], ["A red and white bus parked in front of a building."]], [["A train is sitting on the tracks in a field."], ["A group of trains with painted on their backs next to train cars."], ["A row of train cars sitting on the tracks."]], [["A black and white photo of a group of people."], ["A picture of analog toothbrushes in front of wall."], ["A black and white photo of a group of children."]], [["A man standing on a tennis court holding a racket."], ["A man standing on the ground next to a car."], ["A man standing on the ground next to a tennis racket."]], [["A black and white stove top oven in a kitchen."], ["A group of clothes hanging on a shelf next to a microwave."], ["A group of clothes hanging on a microwave."]], [["An intersection with a traffic light and a building."], ["A toy train and a toy train on a boat."], ["A traffic light over a street with a building."]], [["A banana sitting on a plate next to a table."], ["Three eggs and a frying in a pan on a plate."], ["Three eggs and a frying in a pan on a plate."]], [["A man in a white uniform holding a knife."], ["An iron cup with an odd look on a table."], ["A man in a white jacket holding a tie."]], [["A man standing on skis on top of a snow covered slope."], ["A painting of men standing on top of a city."], ["A man standing on skis on top of a snow covered slope."]], [["A kitchen with a table and chairs in it."], ["A person taking a picture of themselves in the mirror."], ["A kitchen with a table and a refrigerator."]], [["A man flying through the air on a snowboard."], ["A group of three people standing on a table."], ["A man flying through the air while riding a snowboard."]], [["A pizza on a plate on a table."], ["A group of piled on top of each other."], ["A pizza sitting on top of a plate on a table."]], [["A cat playing with its reflection in a mirror."], ["A cake with three ties on top of it."], ["A cat playing with its reflection in a mirror."]], [["A vase with red flowers in front of a fireplace."], ["A computer monitor and a mouse on a couch."], ["A vase with red flowers in front of a fireplace."]], [["A group of women standing around a table with a cake."], ["A group of doll sitting on a table with food."], ["A group of women standing around a table with a cake."]], [["A woman standing next to an elderly man."], ["A man and a woman standing next to a woman."], ["A woman standing next to a man in a tie."]], [["A clock on a pole on a city street."], ["A group of stairs leading stairs with a clock on it."], ["A clock on the side of a building."]], [["A bathroom with two sinks and a wall."], ["A large bath tub in a large room with a window."], ["A bathroom with a tub and a window."]], [["A man with a dog in a backpack."], ["A dog sitting on the stairs in a room."], ["A man and a dog sitting on stairs."]], [["Three teddy bears sitting next to each other."], ["A pile of broccoli and fish on a table."], ["A group of teddy bears sitting on a bed."]], [["A young man riding a skateboard at a skate park."], ["A person cutting a bike."], ["A man doing a trick on a skateboard."]], [["A stuffed teddy bear wearing a mask on a bed."], ["A child wearing a helmet on a table with a teddy bear."], ["A stuffed teddy bear wearing goggles on a bed."]], [["A group of people riding skis on a ski lift."], ["A group of people playing baseball in the snow."], ["A group of people riding skis on a ski lift."]], [["A black bird sitting on the sidewalk next to a man."], ["A pigeon sitting on the sidewalk next to a restaurant window."], ["A black bird sitting on a chair next to a woman."]], [["A dining room with a table and chairs."], ["A girl sitting at tables in a restaurant."], ["A dining room with a table and chairs."]], [["A young boy swinging a baseball bat at a ball."], ["A rainbow in the shape of a baseball player next to a ball."], ["A baseball player swinging a bat at a ball."]], [["A city street at night with traffic lights."], ["A bathroom with a tub and a green traffic light."], ["A city street at night with a traffic light."]], [["A woman standing on skis in the snow."], ["A group of people standing in the water with skis."], ["A group of people standing in the snow with skis."]], [["A wooden bed with pillows on top of it."], ["A statue of a man sitting on a train with a chair."], ["A bedroom with a bed with pillows on it."]], [["A man doing a trick on a skateboard at a skate park."], ["A person jumping in the air with corn."], ["A man doing a trick on a skateboard at a skate park."]], [["A man riding a wave on a surfboard in the ocean."], ["A fighter jet sitting on top of a table."], ["A man riding a wave on a surfboard in the ocean."]], [["A group of horses grazing in a field."], ["A man doing a trick on a skateboard in the air."], ["A group of horses grazing in a field."]], [["A swimming pool with a table and a table."], ["Two statues of elephants with trees in front of a water."], ["A swimming pool with a table in front of it."]], [["A group of people standing on a bus at a bus stop."], ["A tennis player standing on top of a table."], ["A group of people standing on an airplane."]], [["A black cat sitting in front of a door."], ["A person sitting on the seats with a cell phone."], ["A black cat is sitting on the stairs."]], [["A woman standing on a tennis court with a ball."], ["A statue of toy within a bathroom with a sink."], ["A woman standing on a tennis court with a ball."]], [["A man standing on a tennis court with a racket."], ["A painting of a soccer ball on a table."], ["A man standing on a tennis court with a ball."]], [["A large bed with red pillows on top of it."], ["A bedroom with a bed with a lamp."], ["A large bed with two pillows on top of it."]], [["An airplane flying over a tree in the sky."], ["A picture of a bunch of plants with flowers."], ["An airplane flying over a tree in the sky."]], [["A construction truck and orange cones on a street."], ["A bridge with a double decker bus and a man."], ["A truck and a truck on a city street."]], [["A hot dog sitting next to a bottle of soda."], ["Three rolls of machine with machine on top of tin foil."], ["A hot dog and a bottle of soda on tin foil."]], [["A red stop sign on the side of a street."], ["A stop sign on the side of a snow covered slope."], ["A stop sign on the side of a sidewalk."]], [["A white polar bear laying on top of a rock."], ["Three tourists looking at the top of an elephant on a plate."], ["Three polar bears sitting on top of a bed."]], [["A bunch of baskets of carrots and vegetables on a table."], ["A display of a bunch of leaves on a table."], ["A display of carrots and other vegetables on a table."]], [["A group of white teddy bears sitting on a table."], ["A white table with sprinkles on it."], ["A group of white teddy bears sitting on a table."]], [["A train is on the tracks under a bridge."], ["A painting of a train on a tracks."], ["A train is on the tracks under a bridge."]], [["A white plate of food on a table."], ["A person with a banana still on its head."], ["A person with a banana still on its head."]], [["A city street with a sign on the side of it."], ["A bedroom with a bed and a blanket on the floor."], ["A street with a sign on the side of a building."]], [["A seagull flying over a beach next to the ocean."], ["A piece of chicken with chicken on a plate."], ["A bird flying over a beach next to the ocean."]], [["A kitten laying on top of a laptop computer."], ["A sleeping cat sleeping on a laptop computer."], ["A cat sleeping on a table next to a laptop."]], [["A group of people standing in front of a bus."], ["A group of people taking pictures of trains at night."], ["A group of people standing in front of a bus."]], [["A bike sitting on the side of a train."], ["Three doors and a set of three doors."], ["A train with a bike on the side of it."]], [["A man holding a yellow kite in a kitchen."], ["A group of action figures on display in a store."], ["A man holding a sign in a kitchen."]], [["A black dog sitting in front of a mirror."], ["A group of cups of coffee and donuts in a window."], ["A black dog standing in front of a mirror."]], [["A person flying a kite in a field next to the ocean."], ["A toy elephant is sitting on top of a series of grass."], ["A toy is sitting on top of a mattress."]], [["A person holding a cell phone in their hand."], ["A person holding a small device and pens."], ["A person holding a small device and pens."]], [["A row of bikes parked next to each other."], ["A baby is sitting in a room with a bunch of bikes."], ["A baby is sitting in a room with a bunch of bikes."]], [["Two elephants standing next to each other in a zoo."], ["A cat with flowers eating from a chair."], ["A cat with its head on a chair."]], [["A man holding a vase of flowers on a wall."], ["A group of drinks on a wall."], ["A group of drinks on a wall."]], [["A horse standing next to a fence in a field."], ["A horse eating hay from the back of a fence eating hay."], ["A brown horse standing next to a fence."]], [["A red double decker bus with people on it."], ["A toy fire truck is sitting next to a fire hydrant."], ["A red double decker bus pulling a turn on a street."]], [["A motorcycle parked next to a tent in a field."], ["A picture of a person taking a picture of a amusement park."], ["A motorcycle parked in the grass next to a tent."]], [["A black stove top oven sitting in a kitchen."], ["A group of appliances sitting on a display."], ["A black stove top oven sitting in a kitchen."]], [["A blender sitting on top of a table."], ["Three pictures of drinks on an airplane with drinks."], ["A counter with cups and a table."]], [["A group of people flying kites in a field."], ["A person playing a video game on a wii."], ["A group of people flying kites in the air."]], [["A group of people sitting at a table eating food."], ["A person holding an electric toothbrush in a bowl on a table."], ["A group of people sitting around a table eating food."]], [["Two cars parked in a parking lot with a surfboard on top of it."], ["A woman sitting on a small cart with a snowboard."], ["A woman sitting in a small car with a surfboard."]], [["A man standing next to a fire hydrant with water."], ["A shoe is sitting on the side of a blue coffee cup."], ["A fire hydrant with water on the side of a street."]], [["A group of people flying kites in the air."], ["A man in a chair with a tie in front of it."], ["A man flying a bunch of kites in the air."]], [["A herd of cows grazing in a field with a mountain in the background."], ["A painting of a garden with a castle."], ["A herd of cows grazing in a field."]], [["A bus parked on the side of a street."], ["An ice cream truck with ice cream on top of it."], ["A food truck parked on the side of a street."]], [["A man riding a wave on a surfboard in the ocean."], ["Three pictures of a bowl of water with a skateboard."], ["Three pictures of a bowl of water with a skateboard."]], [["A parking meter on the side of a street."], ["The view of the wing of a bag of a bag."], ["A parking meter on the side of a street."]], [["A woman eating a sandwich and a drink."], ["A person standing on a bed with a bowl."], ["A woman eating a sandwich and a cup of coffee."]], [["A horse grazing in the grass next to a house."], ["A dog playing with a frisbee in a yard."], ["A dog and a horse in the grass in a yard."]], [["A man standing on a snowboard on a snow covered slope."], ["A person with their feet on top of a pole."], ["A man standing on a snowboard on a snow covered slope."]], [["A person riding a motorcycle on a race track."], ["A black and white photo of graffiti on a couch."], ["A person riding a motorcycle on a race track."]], [["A double decker bus driving down a street."], ["An airplane flying over a field of trees."], ["An airplane flying over a field of trees."]], [["A man sitting on a motorcycle."], ["A picture of a picture of men on display."], ["A man sitting on a motorcycle."]], [["A baseball player swinging a bat at a ball."], ["A group of books and a animal at boxes of cereal."], ["A group of books and a animal at boxes of cereal."]], [["A man and a woman laying on a bed."], ["Three pictures of two ducks in the same direction."], ["A woman laying on a bed in a room."]], [["A group of pictures of food on a table."], ["A group of pictures of hot dogs playing on the water."], ["A group of pictures of food on a table."]], [["Two people playing tennis on a tennis court."], ["A man carrying a skateboard in a helmet."], ["Two people playing tennis on a tennis court."]], [["A red double decker bus on a city street."], ["A group of computers in front of a large building."], ["A double decker bus on a city street."]], [["A man taking a picture of himself in a mirror."], ["An adorable doll sitting next to an adorable elephant."], ["A man taking a picture of himself in a mirror."]], [["A group of people playing with a cow on the beach."], ["A painting of a stuffed animal on a bed."], ["A group of people standing on a beach with a cow."]], [["A man in a costume standing on a trolley."], ["A man riding a skateboard next to a train."], ["A man riding a skateboard next to a train."]], [["A woman holding a nintendo wii game controller."], ["A person wearing a hat making vegetables on a table."], ["A person wearing a hat making vegetables on a table."]], [["A group of construction workers standing next to a fire hydrant."], ["A man wearing a yellow shirt on a motorcycle."], ["Two construction workers standing next to a fire hydrant."]], [["A white toilet with three skateboards on top of it."], ["A bathroom with a toilet and a toilet and a sink."], ["A white toilet sitting in a bathroom with a table."]], [["Two giraffes and a baby giraffe standing next to a building."], ["A giraffe eating food with its head."], ["Two giraffes and a baby giraffe standing next to a building."]], [["A pizza and a cup of coffee on a table."], ["A group of food on top of a drink."], ["A group of food on top of a drink."]], [["A parking meter sitting on the side of a street."], ["A group of motorcycles are in the sky over the water."], ["A parking meter sitting on the side of a street."]], [["A man doing a trick on a skateboard over an orange cone."], ["A man is standing on hay in a field."], ["A man is standing on hay in a field."]], [["A group of people standing in a field flying kites."], ["Three men wearing goggles sitting in front of a snow covered ski slope."], ["A group of people standing in a field flying kites."]], [["A man brushing his teeth in front of a mirror."], ["A painted face with face and a cup on a bed."], ["A man brushing his teeth in front of a mirror."]], [["A person standing next to a pole on a street."], ["A person making dough on a conveyor belt."], ["A person making dough on a conveyor belt."]], [["A group of chairs sitting around a table in a room."], ["A green bowl in a sink next to a teddy bear."], ["A living room with chairs and a table."]], [["Two young men playing a video game with a wii."], ["Two men playing a video game with a wii."], ["Two men playing a video game with a wii."]], [["A group of people standing around a table with food."], ["Two men helping two men with hot dogs on a table."], ["Two men helping two men with hot dogs on a table."]], [["A zebra standing next to a baby zebra."], ["A statue of a horse on a table."], ["A statue of a zebra on a table."]], [["A woman jumping in the air on a tennis court."], ["A picture of a woman playing tennis with a racket."], ["A woman standing on a tennis court holding a ball."]], [["A cat sitting on top of a chair."], ["An animal hanging from the back of the seats of an airplane."], ["A cat standing on top of a wooden chair."]], [["A blue bike parked on the side of a street."], ["A toy plane is sitting on a bed on a street."], ["A blue bike parked on the side of a street."]], [["A group of people sitting at a table."], ["Two girls sitting at a table."], ["A group of people sitting at a table."]], [["A young boy holding a baseball bat."], ["A doll wearing a blue jacket standing in a field."], ["A dressed in a costume holding a baseball bat."]], [["A young boy riding a skateboard in a park."], ["A doll sitting in front of a pool."], ["A young boy riding a skateboard in a park."]], [["A herd of giraffes running in a field."], ["A group of giraffes running in a field."], ["A herd of giraffes running in a field."]], [["Two men in suits and ties standing on a street."], ["A man and a girl running through chairs in a room."], ["A man and a girl running through chairs in a room."]], [["A street sign with a person on it."], ["A picture of a camera and a mirror with a picture of it."], ["A street sign with a picture of a person on it."]], [["A man holding a tennis ball on a tennis court."], ["A person jumping in the air to catch a frisbee."], ["A man holding a tennis ball on a tennis court."]], [["A group of boats sitting in front of a fence."], ["A group of boats sitting in a harbor."], ["A group of boats sitting in a harbor."]], [["A man wearing a red hat talking on a cell phone."], ["A doll sitting in front of a table with hair."], ["A doll with glasses sitting next to a pink hat."]], [["A person playing with a frisbee in a field."], ["A man with a hat on top of a pole."], ["A man with long hair with a red frisbee in a field."]], [["A teddy bear sitting on top of a red jacket."], ["A group of monkey riding bread under a window."], ["Two stuffed animals sitting on top of a red jacket."]], [["A man cutting a cake at a table."], ["A man standing on a bunch of fire hydrants."], ["A man standing on a bunch of fire hydrants."]], [["A group of people walking in the rain with umbrellas."], ["A painting of a water skiing on a city."], ["A group of people walking in the rain with umbrellas."]], [["Three people standing on skis in the snow."], ["A man and a woman playing tennis on a court."], ["A man and a woman playing tennis on a court."]], [["A pile of luggage with a person standing next to it."], ["A man standing next to a wooden bench with a teddy bear."], ["A person standing next to a pile of luggage."]], [["A white truck driving down a street with street signs."], ["A white couch with a bunch of fruit in front of a coffee shop."], ["A white truck parked in front of a street sign."]], [["A man walking on the tracks next to a train."], ["A man sitting on a couch in a room with a guitar."], ["A man sitting on a couch in a room with a guitar."]], [["A woman riding a wave on a surfboard in the ocean."], ["An image of a teeth in a cage."], ["A view of a person riding a wave in the water."]], [["A banana split is sitting on top of a table."], ["A pair of white females hanging from a purse."], ["A banana split is sitting in a plastic container."]], [["A hotel room with a sink and a table."], ["A person standing in front of a small machine."], ["A person laying in bed in a room with a sink."]], [["A wooden bench next to a truck in a street."], ["A toy car with a tennis racket on a bench."], ["A wooden bench with a truck parked next to a trailer."]], [["A desk with two computer monitors and a laptop."], ["A hospital bed with a cell phone and a laptop."], ["A desk with two computer monitors and a laptop."]], [["A man riding a horse on a dirt road."], ["A pair of scissors laying on top of a table."], ["A pair of scissors laying on top of a table."]], [["A person riding a dirt bike on a dirt road."], ["A man riding a motorcycle in the dirt."], ["A black and white photo of a person riding a dirt bike."]], [["A man flying through the air while riding skis."], ["A photographer sitting on top of a table with a remote."], ["A man flying through the air while riding skis."]], [["A pizza sitting on top of a cutting board."], ["An uncooked pizza sitting on top of a stove."], ["A pizza sitting on top of a stove."]], [["A man and a girl looking in a small refrigerator."], ["A woman painting a table with candles on it."], ["A person standing in front of a small refrigerator."]], [["A city street at night with cars and traffic lights."], ["A city at night with people in it."], ["A city street at night with cars and people."]], [["A group of people playing a game of frisbee."], ["A young boy running with a frisbee on a field."], ["A young boy running with a frisbee on a field."]], [["An open refrigerator with food in a table."], ["An open refrigerator with drinks and food in it."], ["An open refrigerator with food in it."]], [["A kitchen with a stove and a refrigerator."], ["A view of a cat in a room with a table."], ["A kitchen with a stove and a refrigerator."]], [["Two cats sitting in front of a window."], ["Two shirts on top of a white surface."], ["A cat sitting in a window at a street."]], [["A statue of a clock on top of a street."], ["A man standing in top of a clock."], ["A man standing on top of a clock."]], [["A television in a bathroom with two sinks."], ["A car with a television in the seat of it."], ["A television in a bathroom with sinks and a mirror."]], [["A dog laying on the floor in a room with a desk."], ["Two students sitting at desk with their computers."], ["Two students sitting at desk with their desk."]], [["A group of people standing in a field."], ["A picture of a group of people in a field."], ["A group of people standing in a field."]], [["A cat sitting on the floor next to a bottle of water."], ["A animal is on the window of a building."], ["A cat sitting next to a bottle of water."]], [["A group of people flying kites on the beach."], ["A green light with a green liquid on a brick wall."], ["A person flying a kite on the beach."]], [["A woman sitting in a chair holding an umbrella."], ["A group of animals with umbrellas in the water."], ["A woman sitting in a chair holding an umbrella."]], [["Two giraffes standing in a field of grass."], ["A black and white chair with a coffee table with a train."], ["A black and white chair with a coffee table with a train."]], [["A chair with a laptop computer sitting on a desk."], ["A doll sitting on a seat in a room with laptops."], ["A desk with a laptop computer sitting on top of it."]], [["A bedroom with a bed and a fireplace."], ["A toy train is sitting on a table with a train."], ["A bedroom with a bed and a fireplace."]], [["A small bird sitting on top of a tree branch."], ["A group of spoons and scissors in the water."], ["Two birds sitting on top of a tree branch."]], [["A bus with a picture on the side of a street."], ["A tow hydrant next to a car on a track."], ["A tow truck and a bus on a street."]], [["A zebra standing in a field next to a tree."], ["A swing at a park with a kite flying in the air."], ["A zebra standing next to a tree."]], [["A person sitting at a table with two plates of pizza and salad."], ["A man holding a serve with a cake on a plate."], ["A person sitting at a table with a slice of pizza and salad."]], [["A man sleeping in a bed with a cat."], ["A animal with its head sitting on top of a blender."], ["A person standing on top of a blender."]], [["A man riding a wave on a surfboard in the ocean."], ["Two animals are sitting in the sand."], ["Two animals are sitting in the sand."]], [["A group of zebras walking in the dirt."], ["A row of zebras standing next to a table."], ["A group of zebras standing on the floor."]], [["A group of jets flying in formation in the sky."], ["A painting of a purple and white plate with a table."], ["A group of jets flying in formation in the sky."]], [["A room with a laptop and a dresser on a bed."], ["A black cat sitting on a chair."], ["A room with a laptop and a dresser."]], [["A person holding a group of cupcakes on a table."], ["Two cupcakes in a box on a table."], ["A person taking a picture of cupcakes on a table."]], [["A group of children feeding a giraffe at a zoo."], ["A dog sleeping next to a computer keyboard."], ["A group of children feeding a giraffe at a zoo."]], [["A group of people standing around a field with animals."], ["A large wooden ship with a bird on top of it."], ["A group of people standing around with animals in a street."]], [["A little girl eating a banana."], ["A toy is sitting on top of a wooden banana."], ["A little girl eating a banana."]], [["A bride and groom standing in a wedding."], ["A man and a woman sitting on a couch."], ["A man and a woman standing on a couch."]], [["A desk with a computer monitor and a keyboard."], ["A group of model cars and a counter."], ["A desk with a computer sitting on top of it."]], [["A man and a woman standing in front of fruit."], ["A person making a ball with a bunch of balls."], ["A man and a woman standing in front of fruit."]], [["An airplane flying in the sky."], ["A model airplane sitting on top of a table."], ["An airplane flying in the sky."]], [["A herd of zebras grazing in a field."], ["A group of zebras eating grass in a field of yellow flowers."], ["A group of zebras grazing in the grass."]], [["A small black dog wearing a red tie."], ["A person holding a statue of a man with a man on it."], ["A small dog wearing a red tie sitting on steps."]], [["A baby standing next to a box of apples."], ["A person holding a cat laying next to a box of apples."], ["A person holding a baby in a pile of apples."]], [["Two elephants standing next to each other in the dirt."], ["Two elephants standing on the sand."], ["Two elephants standing next to each other in a field."]], [["A picture of a group of people on a bathroom floor."], ["A baby sitting on a table next to a coffee cup."], ["A baby sitting on a table next to a coffee cup."]], [["A train is on the tracks in a field."], ["A painting of trolley car driving down a road."], ["A painting of trolley car driving down a road."]], [["A man and a child sitting on a park bench."], ["Two toy figures holding scissors and helmets on a table."], ["A man and a woman sitting on a park bench."]], [["A train is sitting on the tracks."], ["A cake with a train on top of it."], ["A cake with a train on top of it."]], [["A tree with apples on top of it."], ["A person with a yellow flower on a bed."], ["A tree with red apples on top of it."]], [["A man standing on a tennis court holding a ball."], ["Two men sitting on a table with a bird on it."], ["A man standing on a tennis court with a racket."]], [["Two people sitting in front of an airplane on a beach."], ["A person on a skateboard with a dog."], ["A man and a dog next to a small plane."]], [["A statue of a cow standing in front of a street."], ["A group of elephants with elephants in the middle of cars."], ["A group of elephants walking in the street with cars."]], [["A kitchen with a stove and a pot on the floor."], ["A woman looking at a bus on a bus."], ["A kitchen with a table and a window."]], [["A piece of cakes and other pastries on a table in a bakery."], ["A table with a cake and a bottle of wine."], ["A cake and a table in a bakery."]], [["A dog hanging its head out the side view mirror of a car."], ["A painting of a woman on a table with a cell phone."], ["A painting of a woman on a table with a cell phone."]], [["A toy is sitting on a desk with a computer."], ["A woman at a counter with a sign."], ["A young girl standing in front of a computer."]], [["A pizza sitting next to a can of soda on a table."], ["An elephant walking in a pan on a table."], ["A pizza sitting next to a can of soda."]], [["A desk with a laptop computer sitting on top of it."], ["A group of plates of food enjoying a glass of wine on a table enjoying a glass."], ["A desk with a laptop computer sitting on top of it."]], [["A crowd of people walking on a sidewalk."], ["Two skiers skiing in a race at a race."], ["A group of people walking on a street."]], [["A woman sitting at a table with two slices of pizza."], ["A woman cutting a slice of pizza with a knife."], ["A woman sitting at a table with a plate of pizza."]], [["A truck driving down a road with a pile of hay."], ["Two trash cans in a parking lot with a fence."], ["A truck driving down a road with hay."]], [["A group of street signs on a pole."], ["A group of street signs on a wall."], ["A group of street signs on a pole next to a brick building."]], [["A group of surfboards sitting on top of a beach."], ["A painting of a bench with a train on it."], ["A group of surfboards sitting on top of a beach."]], [["A man standing on a tennis court with a ball."], ["A table with their head on top of a bread with their head."], ["A table with their head on top of a bread with their head."]], [["A bathroom with a sink and a toilet."], ["Two bags of food on top of a table."], ["Two bags of food sitting on top of a table."]], [["A group of chefs preparing food in a kitchen."], ["A large group of people in a restaurant window at a fast food."], ["A group of people preparing food in a kitchen."]], [["A group of people standing around a table with a cake."], ["A group of young men cutting a cake."], ["A group of people standing around a table with a cake."]], [["A man and a woman riding a pink bike down a street."], ["A group of double decker buses driving down a street."], ["A man crossing a street with double decker buses."]], [["A plate of food and a glass of wine on a table."], ["A person on a plate of food on a table."], ["A plate of food on a table with a glass of wine."]], [["A white cat laying on top of a chair."], ["A piece of paper with a group of fish on it."], ["A white cat laying on top of a chair."]], [["A group of people standing in front of a bakery."], ["A man blow drying a hair in a store."], ["A man blow drying a hair in a store."]], [["A group of people with umbrellas."], ["A man wearing a red shirt and a red shirt."], ["A man wearing a red shirt and a red shirt."]], [["Two boats and a tractor sitting on a beach."], ["A bunch of boats sitting on a table."], ["Two boats and a tractor on the beach."]], [["A refrigerator with magnets on it in a kitchen."], ["A toilet with an umbrella on top of it."], ["A refrigerator with a picture on the side of it."]], [["Two cups and a table with a table."], ["A cup of tea on a plate on a table."], ["Two cups of coffee sitting on a table."]], [["Two planes flying next to each other in the sky."], ["A doll sitting on a blanket next to a curtain."], ["An airplane flying in the sky with a table."]], [["A group of cars stopped at a red traffic light."], ["A car driving down a highway with a clock."], ["A group of cars on a city street at a traffic light."]], [["A person flying a kite in front of a lake."], ["A helicopter sitting on top of a blanket."], ["A person flying a kite in the water."]], [["A bathroom with a sink and a toilet and a shower."], ["A man in a training position with his legs on the bathroom."], ["A man in a training position with his feet on the bathroom."]], [["Two people sitting in front of a large umbrella."], ["A man and a woman in a tent."], ["Two people sitting in front of a tent with an umbrella."]], [["A fighter jet parked on display at a show."], ["Four fighter jets sitting next to the water with boats."], ["A small plane sitting on display at an airport."]], [["A teddy bear sitting next to a table with a tennis racket."], ["Two ducks with hair in front of a television."], ["A teddy bear sitting on top of a table with a tennis racket."]], [["A group of people sitting at a table eating food."], ["A group of women standing in a window at a bakery with cupcakes."], ["A group of women standing in a window at a bakery with cupcakes."]], [["A bunch of clocks on a wall in a room."], ["A man standing in a church with a clock on the wall."], ["A wall with a bunch of clocks on it."]], [["A lunch box with a sandwich and fruit in it."], ["A plate of bananas and strawberries on a table."], ["A plate of bananas and strawberries on a table."]], [["A cow and a calf standing in a field."], ["A stack of plates on the back of a car."], ["A cow and a calf standing in a field."]], [["A wooden bench sitting in the grass next to the ocean."], ["A bunch of eggs and sauce on a table."], ["A bench sitting on the side of a beach."]], [["A tall tower with a clock on the top of it."], ["A black and white photo of an outdoor cafe."], ["A tall tower with a clock on the top of it."]], [["A black cat sitting in the seat of a car."], ["An airplane with seats on the side of it."], ["A cat sitting in the seat of a car."]], [["A group of cars stopped at a traffic light."], ["A group of fighter jets playing a game with a train."], ["A group of cars are on a traffic light."]], [["A group of people sitting at a table."], ["A person with an keyboard and headphones on a table."], ["A person with an keyboard and headphones on a table."]], [["A man wearing a skirt and a tie."], ["A woman sitting with a dog and a laptop."], ["A person in a skirt and tie holding a purse."]], [["A woman riding a bike down a city street with cars."], ["A room with blue seats and a table with luggage."], ["A room with blue seats and a table with luggage."]], [["A group of zebras standing on the side of a dirt road."], ["Three zebras standing next to a palm tree."], ["A group of zebras standing in a field."]], [["A man walking on a sidewalk next to a fire hydrant."], ["A group of small vases sitting on a bed."], ["A person walking down a sidewalk in front of a fire hydrant."]], [["A statue of a clock with two birds on top of it."], ["A bottle of testing out front of a computer monitor."], ["A statue of a clock with a bird on top of it."]], [["An airplane flying in the sky."], ["A fighter jet sitting on top of a blue ponies."], ["An airplane flying in the sky."]], [["A kitchen with a sink and a counter."], ["A bathroom with a sink and a counter."], ["A bathroom with a sink and a counter."]], [["A teddy bear and a stuffed animal sitting on a bench."], ["Three action shot of carrots on a bench in a window."], ["A teddy bear and a stuffed animal on a bench."]], [["A man and a woman holding a piece of cake."], ["Two art of two women holding food and a table."], ["Two art of two women holding food and a table."]], [["A man riding a motorcycle down a street."], ["A group of people dressed in costume running in a building."], ["A man riding a motorcycle down a street."]], [["A plate with a sandwich and a bird on a table."], ["A toy cow is sitting in front of a plate of spaghetti."], ["A plate with a sandwich and a bird on a table."]], [["A yellow and pink bus parked in a field."], ["A woman in a pink shirt and a clock on a table."], ["A yellow and pink bus parked in a parking lot."]], [["Two people sitting at a table with two pizzas."], ["A man and a woman sitting at a table with pizza."], ["A man and a woman sitting at a table with pizza."]], [["A group of cows laying in the hay in a barn."], ["A group of goats sitting on top of a exit."], ["A group of cows in a barn."]], [["A young boy sitting at a table with a plate of food."], ["A man painting of chocolate on the floor."], ["A young boy sitting at a table with a plate of food."]], [["Two people playing a video game on a wii."], ["A man playing a video game on a television."], ["Two people playing a video game on a wii."]], [["A group of people riding horses in a field."], ["A woman wearing a red costume riding on horses in a library."], ["Two men in red uniforms riding on horses."]], [["Two shots of two people standing on a table."], ["A group of people standing on skateboards."], ["A group of people standing on skateboards."]], [["Two giraffes standing in a field with a tent."], ["A dog on a leash and a horse on a leash."], ["A dog on a leash pulling a horse on a leash."]], [["A baseball player holding a bat on a field."], ["A piece of paper with sauce on top of it."], ["A group of food with sauce and greens on it."]], [["A teddy bear sitting on the side of a tree."], ["An elephant laying on top of a table."], ["A teddy bear sitting on the side of a tree."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A black and white photo of a bird."], ["A black and white photo of a plane on a street."]], [["A bathroom with a sink and a mirror."], ["An orange bathroom with a sink and neatly in it."], ["A picture of a bathroom with a sink and tomatoes."]], [["A baseball player holding a bat on a field."], ["A group of toy figures playing in a room."], ["A baseball player holding a bat on a field."]], [["A bunch of vegetables on a cutting board with a knife."], ["Two macaroni and cheese on a chair in a bathroom sink."], ["A bunch of vegetables on a cutting board with a knife."]], [["A group of people skiing down a snow covered mountain."], ["A large painting of people skiing down a snow covered slope."], ["A group of people skiing down a snow covered mountain."]], [["A toilet in a bathroom with a green wall."], ["A pair of shoes sitting in front of a door."], ["A toilet in a bathroom with a green wall."]], [["A clock tower in the middle of a street."], ["A hot dog is sitting in front of a hot dog bun."], ["A clock tower in the middle of a street."]], [["A clock on a pole in the middle of a field."], ["A mirror and a reflection of a reflection of a reflection."], ["A clock in the middle of a field."]], [["A white toilet in a bathroom with a table."], ["A group of bags of cell phones in a bag."], ["A white toilet sitting in a bathroom with a table."]], [["Two computer monitors and a keyboard on a desk."], ["Two laptops with people on top of them with laptops."], ["Two computer monitors and a keyboard on a desk."]], [["A person holding a sandwich on a plate."], ["A cup of soup with ice cream in it."], ["A person holding a sandwich on a plate."]], [["A man riding a skateboard on a ramp."], ["A group of toy figures running in front of a table."], ["A group of toy figures running in front of a table."]], [["A person holding a piece of food in front of a building."], ["A woman in front of an apartment with stairs."], ["A person holding a piece of food in front of a building."]], [["A woman taking a picture of a dog in a car window."], ["A group of toy bears on display."], ["A person taking a picture of a car mirror of a car."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A knife in the middle of a table."], ["A black and white photo of a beach with a surfboard."]], [["A pair of scissors sitting on top of a wooden box."], ["A toy is on top of a wooden board."], ["A toy is on top of a wooden board."]], [["A desk with three computers and a keyboard on it."], ["A desk with a keyboard and a computer on it."], ["A desk with a computer and a keyboard on it."]], [["A man sitting in a hospital room holding a plate of food."], ["A woman sitting on a toilet holding a bowl."], ["A man sitting on a toilet holding a pizza."]], [["A cat sitting next to a laptop computer."], ["A view of a camera in front of a cell phone and a laptop."], ["A view of a reflection of a laptop computer on a table."]], [["A man hitting a tennis ball with a racket."], ["A monkey sitting on a stage with overcast skies."], ["A man hitting a tennis ball with a racket."]], [["A blue sign on the side of a city street."], ["A painting of a double decker on a beach."], ["A large sign on the side of a street."]], [["A yellow and red train is on the tracks."], ["Two orange trucks parked on the floor in a city."], ["Two orange trucks parked on the floor in a city."]], [["A train is on a bridge over a city."], ["A bridge with a train on top of a city."], ["A bridge with a train on top of a city."]], [["A group of cows standing in front of a church."], ["Animals eating hay in front of a church with a church."], ["A group of cows standing in front of a church."]], [["Two seagulls standing on rocks next to the water."], ["A group of birds swimming in the water."], ["Two seagulls standing on rocks next to the water."]], [["A man riding on the back of an elephant."], ["A group of horses are on a circus."], ["An elephant standing next to a man on a field."]], [["A desk with a laptop and a computer on it."], ["A tray on an airplane with cell phones on it."], ["A desk with a laptop and a computer on it."]], [["A train is on the tracks next to a dirt road."], ["A reflection of a flower in the window of a street."], ["A train is on the tracks next to a dirt road."]], [["A black cat sitting on top of a television."], ["Group of military vehicles with their mouth open."], ["A cat sitting on top of a television."]], [["A computer keyboard and a mouse on a desk."], ["A bunch of food with cheese and cheese on a counter."], ["A computer keyboard and a mouse on a desk."]], [["Three people standing in front of a display of donuts."], ["A group of people with hats of sandwiches with umbrellas."], ["Three women standing in front of a bakery."]], [["A yellow truck parked in a parking lot."], ["A group of trains are on display in a building."], ["A yellow truck parked in a parking lot."]], [["A group of people standing in the snow."], ["A group of trains are on the tracks in a train."], ["A group of people standing on top of a mountain."]], [["A group of people riding skis down a snow covered slope."], ["A man working on a machine on a ramp."], ["A man working on a machine on a ramp."]], [["A baseball player holding a bat on a field."], ["A group of animals on animals playing games."], ["A group of animals on animals playing games."]], [["A woman standing on a tennis court holding a racket."], ["A person standing on a court with a ball in his hand."], ["A woman standing on a tennis court with a ball."]], [["A man standing on the beach holding a surfboard."], ["A small orange clock sitting on top of a table."], ["A man standing on the beach holding a surfboard."]], [["A man swinging a tennis racket on a court."], ["A young boy holding a kite on a table."], ["A man holding a tennis racket on a court."]], [["A group of people skiing down a snow covered slope."], ["A picture of a tablet with mountains in the background."], ["A picture of people riding skis on a snow covered slope."]], [["A man and a woman standing in the snow."], ["A woman pushing a box next to a parking meter."], ["A man and a woman standing next to a parking meter."]], [["A white plate of broccoli and meat on a table."], ["Broccoli and carrots on a table next to a factory."], ["A white plate of broccoli and meat on a table."]], [["A person holding a sandwich and a cup of coffee."], ["A person playing with a toy with a table."], ["A person holding food with meat on top of it."]], [["A tray with a sandwich and a salad on a table."], ["A person making an orange guitar in a black blender."], ["A tray with a plate of food and drinks."]], [["A cat laying on top of a laptop computer."], ["A cat with its back on its back turned on a laptop."], ["A cat laying on top of a laptop computer."]], [["A red fire hydrant in the middle of leaves."], ["A young boy holding a baseball bat with a dog."], ["A red fire hydrant in the middle of a forest."]], [["A kitchen with a stove and a refrigerator."], ["Two containers of cheese in a shelf."], ["A kitchen with a stove and a refrigerator."]], [["A group of people walking on a city street with a double decker bus."], ["A group of people on display at a museum."], ["A group of people walking in a city street."]], [["A group of horses and a baby horse eating hay."], ["A gold object sitting on top of a table."], ["A group of horses and a baby horse eating hay."]], [["A bird standing in the water in a body of water."], ["An adorable animal eating food on top of a table."], ["A bird standing in the water in a field."]], [["A baseball player throwing a ball on a field."], ["A man with a dog on the back of a base."], ["A baseball player throwing a ball on a field."]], [["A man sitting at a table with a cup of coffee."], ["A person with glasses sitting at a table."], ["A man sitting at a table with a cup of coffee."]], [["A bus driving down a city street with a building."], ["An electric train is on the middle of a city."], ["A bus driving down a city street with a building."]], [["A woman standing in a kitchen preparing food."], ["A bride and groom sitting at a wedding."], ["A woman standing in a kitchen preparing food."]], [["A man doing a trick in the air on a skateboard."], ["A group of people holding umbrellas over a field."], ["A man doing a trick on a skateboard in the air."]], [["A pizza sitting on top of a table in a restaurant."], ["Two men sitting in front of boxes of donuts."], ["A pizza sitting on top of a table."]], [["A row of toilets in a bathroom."], ["A group of cups on a table next to a vase."], ["A row of sinks in a bathroom with a window."]], [["A plate of food with broccoli and a table."], ["A bowl of yellow birds in a bowl on a table."], ["A bowl of food with broccoli and a table."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A black and white photo of a red and white wall."], ["A black and white photo of a plane sitting on a street."]], [["A man walking a bike down a street."], ["A man sitting on a bench next to a pizza box."], ["A man walking a bike down a street."]], [["A plate of rice and vegetables on a table."], ["A group of three bowls with bananas hanging from a table."], ["A plate of rice and vegetables on a table."]], [["A small plane sitting on top of an airport runway."], ["A view of the top of a group of cones."], ["A small plane sitting on top of an airport runway."]], [["A wooden bench sitting in the middle of a park."], ["A white bench with a box of food on it."], ["A white bench with a box of food on it."]], [["A wooden table with plates of food on it."], ["A red truck with a cake in front of a table."], ["A red truck with a cake in front of a table."]], [["A group of people standing on a beach."], ["A purse with the top of it on a table."], ["A purse with the top of it on a table."]], [["A cat is standing on the wall in a room."], ["An old picture of a cat walking in a room."], ["A cat walking in a wall in a room."]], [["A man and a woman standing next to each other."], ["A black and white photo of three doll on a bed."], ["A man and a woman standing next to each other."]], [["A dog wearing a helmet sitting next to a motorcycle."], ["Three horses playing in the air with each other."], ["Three horses playing in the air with each other."]], [["A group of young people flying kites."], ["A person on a raft with a microphone."], ["A person on a raft with a microphone."]], [["A woman taking a picture of a cell phone."], ["A picture of a woman sitting in a keyboard."], ["A woman taking a picture of a cell phone."]], [["Two street signs on a wooden pole."], ["A green and white sign on a pole."], ["A green and white street sign on a pole."]], [["A person riding a skateboard at a skate park."], ["A painting of a man on a skateboard."], ["A man riding a skateboard at a skate park."]], [["A group of people with luggage at an airport."], ["A police officer and a bus with a train with a blue train."], ["A group of people walking in an airport with luggage."]], [["A woman in a black dress standing in front of a refrigerator."], ["An apron standing on a bunch of bowls in a window."], ["A woman in an apron standing on a pile of bowls."]], [["A group of street signs in front of a tall building."], ["A restaurant with a sign on the front of it."], ["A restaurant with a sign on the front of it."]], [["A man riding a wave on a surfboard in the ocean."], ["A person with a mask on their head on a surfboard."], ["A man riding a wave on a surfboard in the ocean."]], [["A man in a white shirt and tie."], ["A man playing with a video game with a wii controller."], ["A man playing with a video game with a wii controller."]], [["A blue suitcase sitting next to a pair of shoes."], ["A group of toys and a teddy bear on the floor."], ["A blue suitcase sitting next to a wooden table."]], [["A person holding a piece of chocolate cake with a drink."], ["A young child with toy animals on a cup."], ["A young child with toy animals on a cup."]], [["A plate of food on a table with a glass of wine."], ["A group of bananas and corn on a counter."], ["A plate of food on a table."]], [["A plate of food with meat and a salad."], ["Two mushrooms on a plate of food on a table."], ["A plate of food and a salad on a table."]], [["A group of trucks parked in a parking lot."], ["Two pictures of trucks and umbrellas in a building."], ["A group of trucks parked in an airport."]], [["A herd of elephants walking in a field."], ["A group of statues of scissors flying in the sand."], ["A group of statues of scissors flying in the sand."]], [["A broccoli plant growing in a field."], ["A broccoli plant with candles on the back of it."], ["A broccoli plant growing in the middle of a field."]], [["Two teddy bears sitting next to a wall."], ["A group of hot dogs cooking in the mud."], ["A group of hot dogs cooking in the mud."]], [["A group of people standing in a room."], ["A picture of someone with a seat in a room."], ["A group of people standing in a room."]], [["A person riding a horse jumping over an obstacle."], ["Two pictures of a cow jumping over the obstacle."], ["Two pictures of a cow jumping over the obstacle."]], [["Two people riding in a horse drawn carriage."], ["A glass and a bench with a fire hydrant and a bottle."], ["Two people riding a horse drawn carriage with a field."]], [["A white sign in front of a brick building."], ["A birthday cake hanging from the back of a bench."], ["A white sign in front of a brick building."]], [["A woman holding a tennis racket in front of a crowd."], ["Two women playing tennis on a tennis court."], ["Two women playing tennis on a tennis court."]], [["A blender with food in it on a counter."], ["A person holding a green coffee cup with a table."], ["A blender sitting on top of a counter."]], [["A cat laying on top of a suitcase."], ["A painting of a luggage on the side of a plane."], ["A cat laying on top of a piece of luggage."]], [["A donut hanging from a christmas tree."], ["A green plant with a green decoration with a bottle."], ["A donut hanging from a christmas tree."]], [["A picture of a kitchen with a table."], ["A store with items on the wall."], ["A kitchen with a refrigerator and a table."]], [["Two oranges hanging from a tree in a field."], ["A group of oranges and green apples on a wall."], ["An orange tree with two oranges hanging from it."]], [["A man standing next to a bike with a baby."], ["Three toy men dressed in green uniforms on bikes."], ["Two men standing next to a bike on a street."]], [["A group of people flying a kite in a field."], ["A colorful train with the head is sitting on a field."], ["A girl holding a colorful kite on a field."]], [["A man riding a wave on a surfboard in the ocean."], ["A monkey hanging on the ground in the rain."], ["A monkey hanging on the ground in the rain."]], [["A man standing in a boat on the beach."], ["A woman in a white dress on a bed with a knife."], ["A woman in a white dress on a bed with a knife."]], [["A young boy taking a picture of a cell phone."], ["A group of people sitting in chairs with a sign."], ["A young child taking a picture of a cell phone."]], [["An airplane parked on the runway at an airport."], ["A large airplane parked at a bus station with a motorcycle."], ["A large airplane parked at an airport."]], [["A person riding skis in the snow."], ["A man doing a trick on a snowboard."], ["A man riding skis down a snow covered slope."]], [["A group of people riding horses on the beach."], ["A device sitting on top of a table."], ["A tablet sitting on top of a table."]], [["A group of people sitting on benches in a park."], ["A group of helmet on a heavily under a light under a chandelier."], ["A group of people sitting on a bench."]], [["A bowl of food with a fork on a table."], ["A green plate with carrots and a fork on a bed."], ["A wooden tray of food with a fork and food."]], [["A man riding a skateboard on a ramp with fire."], ["A painting of a girl on a fire hydrant with a hose."], ["A man riding a skateboard in a building with a fire."]], [["A baseball player throwing a ball on a field."], ["A painting of a tennis player hitting a tennis ball."], ["A painting of a tennis player hitting a tennis ball."]], [["An elephant standing next to a tree in a field."], ["A group of elephants playing tennis on a court."], ["An elephant is standing next to a pole."]], [["A black refrigerator in a room with a table."], ["A bed with green shirts on top of a window."], ["A black refrigerator in a room with a table."]], [["Two street signs on a pole on a city street."], ["A bottle of beer in front of a skateboard in the snow."], ["Two signs on a pole on a city street."]], [["A woman sitting on a motorcycle with a side car."], ["The toy car is sitting on top of a table."], ["A toy car with the top of it on a table."]], [["A bunch of oranges in a glass bowl on a table."], ["Two orange elephant playing with a bird on a table."], ["A bunch of oranges in a glass bowl."]], [["A garden with plants in front of a white building."], ["A cake with flowers and flowers on top of it."], ["A cake with two blue flowers on top of a table."]], [["A man and a dog with a group of sheep."], ["A group of animals and their animals on green green green benches."], ["A group of animals and their animals on green green green benches."]], [["A cat looking at a statue in front of a window."], ["Two animals with faces on them with a suitcase."], ["A cat looking out of a window."]], [["A woman holding a baseball bat next to a table."], ["A doll with hair sitting next to a black bench."], ["A woman holding a baseball bat next to a man."]], [["A group of zebras standing next to a fence."], ["A dead elephant is on the side of a fence."], ["A group of zebras standing next to a fence."]], [["A polar bear standing next to a rock."], ["A cat jumping on top of a pillow."], ["A polar bear standing on top of a rock."]], [["A birthday cake and a bag on a table."], ["A birthday cake with red cell phones on it."], ["A birthday cake sitting on top of a table with a bag."]], [["A man riding a skateboard at a skate park."], ["A group of people on a ramp on a skateboard."], ["A man riding a skateboard at a skate park."]], [["A building with a clock on the top of it."], ["An airplane flying over a field of trees."], ["A building with a clock on the top of it."]], [["A woman standing next to a brown horse."], ["A person pouring bananas from a pile of corn."], ["A person pouring bananas from a pile of corn."]], [["A person standing on top of a skateboard."], ["A pair of scissors with their face on top of a table."], ["A person standing on top of a skateboard."]], [["A black bear standing on top of a forest."], ["A group of white flowers in the air."], ["A black bear standing on top of a tree."]], [["A man wearing a santa hat holding a dog in front of a christmas tree."], ["A picture of a picture of a man with a frisbee."], ["A man sitting next to a small dog in a santa hat."]], [["A kitchen with a refrigerator and a microwave."], ["A row of sinks in a restaurant with a train."], ["A kitchen with a microwave and a stove."]], [["A man riding skis on a rail in the snow."], ["A display of stuffed animals on top of a model train."], ["A person riding skis on a rail in the snow."]], [["A group of people riding bikes in front of a food truck."], ["Three men standing next to each other with luggage."], ["A group of people riding bikes in front of a food truck."]], [["A basket of fruit with a red ribbon in it."], ["Two birds in a wooden bowl with apples and oranges."], ["A basket of fruit sitting on a table."]], [["A clock tower in the middle of a street."], ["A piece of bread with meat on top of it."], ["A clock tower in the middle of a street."]], [["A group of three women standing in front of a sign."], ["A baby eating a piece of bomber on a table."], ["A group of women standing in front of a sign."]], [["A brown dog sitting in a yard next to a black and white dog."], ["A small goat with a pot on top of a table."], ["A brown dog sitting next to a black and white dog."]], [["A pizza with meat and vegetables on top of a table."], ["A teddy bear sitting on top of a basket with scissors."], ["A pizza with meat and vegetables on top of a table."]], [["A group of people standing in a store with fruit."], ["A painting of two women playing in a store."], ["A painting of two women playing in a store."]], [["A young man standing in front of a television playing a video game."], ["A person sitting on a couch holding a video game controller."], ["A young boy playing a video game on a wii."]], [["A person riding a skateboard at a skate park."], ["A group of airplanes are sitting on the runway at an airport."], ["A person riding a skateboard in a skate park."]], [["A man and a woman eating a piece of pizza."], ["A group of people dressed in costumes eating bananas."], ["Two people sitting next to each other eating food."]], [["A white toilet in a bathroom with a window."], ["A bathroom with a sink and two pillows next to a pillow."], ["A white toilet in a bathroom with a window."]], [["A plate of chicken and potatoes and vegetables."], ["A bowl of hot dogs in it on a table."], ["A plate of food with chicken and potatoes."]], [["An airplane flying in the sky."], ["An old model airplane sitting on a table."], ["An airplane flying in the sky."]], [["A person laying on a bed in a living room."], ["Pictures of cupcakes and cupcakes in a room."], ["A woman laying on a bed in a room."]], [["Two people playing a video game with a wii."], ["A young man swinging a baseball bat with a suburban street."], ["Two people playing a video game with a wii."]], [["A group of street signs on a pole on a city street."], ["A picture of a bus driving down a city street."], ["A picture of a bus driving down a city street."]], [["Two girls sitting at a table with a laptop computer."], ["A person holding a bunch of remote controls."], ["A group of people holding remote controls on a table."]], [["A dog standing on top of a skateboard."], ["A group of stairs jumping in the air next to a table."], ["A small dog on a leash standing on a skateboard."]], [["A bike parked in front of a red building."], ["A group of fruits and vegetables in a room."], ["A bike parked in front of a house."]], [["A plate with a piece of cake on a table."], ["Two cats playing with orange slices on a plate."], ["Two cats playing with orange slices on a plate."]], [["A man riding a wave on a surfboard in the ocean."], ["Two stuffed animals laying on top of a bed."], ["Two stuffed animals laying on top of a bed."]], [["A black and white photo of a girl riding on a horse."], ["A group of chairs with yellow cats on top of it."], ["Two people riding on the back of a horse."]], [["A street sign on the side of a car."], ["A white running down a road in a room."], ["A white running down a road in a room."]], [["A black and white photo of boats parked next to a dock."], ["A crane sitting next to a truck in a building."], ["A black and white photo of boats parked at a dock."]], [["A person holding a cell phone in their hand."], ["A person holding the top of their cell phone."], ["A person holding a cell phone in their hand."]], [["A young boy holding a tennis racket on a tennis court."], ["A young boy swinging a baseball bat at a ball."], ["A young boy swinging a tennis racket at a ball."]], [["A bedroom with a bed and a television on the wall."], ["A motorcycle with the seat up next to a table."], ["A bedroom with a bed and a television."]], [["A group of zebras eating from a trough."], ["Two zebras hanging on a white blanket on a wall."], ["A group of zebras eating from a trough."]], [["A living room with a couch and a table."], ["An indoor room with red couches and a table."], ["A living room with a couch and a television."]], [["A man riding a wave on a surfboard in the ocean."], ["Two girls sitting on boats in the water."], ["A man riding a wave on a surfboard in the ocean."]], [["A group of parking meters on the side of a street."], ["A yellow building with a microwave and a pole."], ["A group of parking meters on the side of a street."]], [["A man riding a skateboard down a street."], ["A person with yellow helmet riding skateboards next to purple benches."], ["A man wearing a helmet riding a skateboard down a street."]], [["A person cutting a cake with a knife."], ["A person cutting a pair of scissors on a table."], ["A woman cutting a cake on a table."]], [["A man sitting at a table with an umbrella."], ["A doll house with toys in the background."], ["A doll house with toys in the background."]], [["A blue and yellow train is on the tracks next to the water."], ["A blue man on a table."], ["A blue man on a table."]], [["A traffic light on the side of a street."], ["A pole with a traffic light on a city street."], ["A traffic light on a pole on a street."]], [["Young boys in ties jumping in the air."], ["A baby playing with a man in a white shirt."], ["A young boy and a tie jumping in the air."]], [["A man playing a video game in a living room."], ["A picture of two computer monitors with a table."], ["A man standing in a room with a table."]], [["A woman in a scarf looking at her cell phone."], ["A view of someone sitting on a bed."], ["A woman wearing a scarf looking at her cell phone."]], [["A cat sitting next to a brick wall."], ["Four plastic mugs with dogs in them on a counter."], ["Four plastic mugs with dogs in them on a counter."]], [["A small bathroom with a toilet and a table."], ["A button and a toothbrush and a button on it."], ["A button and a toothbrush and a button on it."]], [["A person riding a wave on a surfboard in the ocean."], ["A painting of two white birds flying in the sky."], ["A person riding a wave on a surfboard in the ocean."]], [["A kitchen with a table and chairs in it."], ["Two boxes of food on their horses on the checkered floor."], ["Two boxes of food on their horses on the checkered floor."]], [["A little girl sitting in a bowl on a table."], ["A doll brushing it s teeth on a table with a cup of coffee."], ["A doll brushing it s teeth on a table with a cup of coffee."]], [["A group of ducks swimming in a body of water."], ["A body of water on the side of a road."], ["A group of ducks swimming in a body of water."]], [["A man standing on the back of a truck."], ["A man riding a skateboard on a rail on a train."], ["A man walking on a freeway with a train."]], [["An orange motorcycle parked in front of a group of motorcycles."], ["A man on a motorcycle holding a sign."], ["A man on a motorcycle in front of a group of people."]], [["A black and white cow standing next to a man."], ["A man pouring a hair on a cow."], ["A man standing next to a black and white cow."]], [["A black and white photo of people on a beach with sail boats."], ["A group of glass vases sitting on a black and white table."], ["A black and white photo of people on a beach with sail boats."]], [["A motorcycle parked on the side of a road."], ["A motorcycle is sitting in the middle of a fence."], ["A motorcycle parked on the side of a road."]], [["Two people in a red boat in the water."], ["A dog laying on a bed with a bunch of vegetables."], ["A dog laying on a bed with a bunch of vegetables."]], [["A herd of sheep walking down a city street."], ["A display of stuffed animals in a glass window."], ["A display of stuffed animals in a glass window."]], [["A suitcase sitting on the ground in the dirt."], ["A person pulling a suitcase with a blue suitcase."], ["A suitcase sitting on the ground in the dirt."]], [["A man riding a skateboard at a skate park."], ["A person riding a skateboard in a train station."], ["A man riding a skateboard in a skate park."]], [["A man and a child on a snowboard down a snow covered slope."], ["A person standing in the sand with a bird."], ["A man and a person riding a snowboard down a snow covered slope."]], [["A cat and a dog looking out a window."], ["Two pictures of cat playing with a cat on a table."], ["A dog and a dog looking at a window."]], [["A baseball player standing on the mound."], ["A group of racquets sitting on top of a green and white wall."], ["A baseball player standing on the mound."]], [["A black and white photo of a man riding a horse."], ["A man standing on top of three beds."], ["A man standing on top of three beds."]], [["A bedroom with a bed and a table."], ["A little girl jumping in the air next to a bed."], ["A bedroom with a wooden bed with a table."]], [["A small bed with bottles of water on it."], ["A cake and a double decker bus on a table."], ["A cake and a double decker bus on a table."]], [["A pizza is in an oven."], ["A piece of food on a plate."], ["A piece of food on a plate."]], [["A yellow bird sitting on a tree branch."], ["A monkey with an orange umbrella hanging from a wire."], ["A yellow and red bird sitting on a tree branch."]], [["A group of stuffed animals standing in beds."], ["A person on a rack on a boat."], ["A woman standing in two beds with a teddy bear."]], [["A man standing in front of a refrigerator."], ["A pink stuffed animal sitting on a cup of a counter."], ["A pink person in a kitchen in front of a refrigerator."]], [["Two elephants standing next to a fence in a zoo."], ["A group of yellow statues on display with power lines."], ["A group of elephants standing in a fence."]], [["A kitchen sink with dishes in it."], ["Three eggs in a sink with ketchup on it."], ["A sink with forks and toothpaste on it."]], [["Three hot dogs with toppings on top of a table."], ["A large hot dog and a bun on a table."], ["Two hot dogs with toppings on top of a table."]], [["A group of birds sitting on top of a wooden roof."], ["A tennis ball with a racket on top of it."], ["A bird standing on top of a roof."]], [["A bus driving down a street in the rain."], ["A cat sitting on the floor next to a bus."], ["A bus driving in the rain on a street."]], [["Two men playing a game of soccer on a field."], ["A man and a woman with a soccer ball."], ["A young man kicking a soccer ball on a field."]], [["An airplane flying over a car in the sky."], ["A helicopter sitting in the grass next to a helicopter."], ["An airplane flying in the sky over a field."]], [["A black cat sitting in the grass."], ["The toy is on the ground in the grass."], ["The toy is on the ground in the grass."]], [["A bathroom with a toilet and a bath tub."], ["A bathroom with a toilet and a table."], ["A bathroom with a toilet and a bath tub."]], [["A laptop computer sitting on top of a wooden table."], ["A painting of a woman and a computer with a keyboard."], ["A painting of a woman and a computer with a keyboard."]], [["A group of people standing around a bench with frisbees."], ["A group of action on a bench."], ["A group of people standing around a bench."]], [["A group of bread sitting on a plate next to a keyboard."], ["A knife and a keys on a blanket."], ["A knife and a keys on a blanket."]], [["A cat standing on a bathroom floor next to a toilet."], ["A toy is walking on a checkered table."], ["A toy mouse is on a black and white checkered table."]], [["A person riding a wave on a surfboard in the ocean."], ["A piece of squats on top of a table with snow."], ["A person riding a wave on a surfboard in the ocean."]], [["A man holding a cell phone in front of a crowd."], ["A bunch of balls sitting on top of a motorbike."], ["A man taking a picture of a cell phone."]], [["A man standing under a sign in the grass."], ["Two children holding signs with flags on them."], ["A man standing under a sign in the grass."]], [["A man doing a trick on a skateboard at a skate park."], ["A painting of hair playing with an guitar and train."], ["A man doing a trick on a skateboard at a skate park."]], [["A woman walking a small white dog down a sidewalk."], ["A toy dog sitting in a chair with a pair of scissors."], ["A woman walking a white dog down a sidewalk."]], [["A man riding a horse on a field with mountains in the background."], ["A painting of a giraffe on top of a table."], ["A painting of a giraffe on top of a table."]], [["A man riding a skateboard down a rail."], ["A picture of a man riding a snowboard."], ["A man riding a skateboard down a rail."]], [["Four pictures of a bowl of food on a table."], ["A bowl of corn on a table."], ["A colorful plate of food on a table."]], [["A sandwich on a plate on a table."], ["A group of animals standing on top of a table."], ["A group of animals standing on top of a table."]], [["Two hot dogs in a paper plate on a table."], ["A plate with a fish and a banana peel next to a phone."], ["A plate with a fish and a banana peel next to a phone."]], [["A black horse standing in a field."], ["A tail of an elephant hanging on a bed."], ["A small black horse standing in a field."]], [["A group of people on a boat in the water."], ["A bride and groom cutting a boat in the water."], ["A bride and groom cutting a boat in the water."]], [["A bathroom with a sink and a mirror."], ["A bathroom with pink roses and a microwave."], ["A bathroom with a sink and a mirror."]], [["An orange fire hydrant on the side of a street."], ["A cake with a face on a horse on a street."], ["A cake with a face on a horse on a street."]], [["A toilet with the seat up in a bathroom."], ["A cup of coffee with ice cream on top of it."], ["A toilet with a seat on top of it."]], [["A group of people standing next to a group of signs."], ["A black and white photo of a woman and a boat."], ["A black and white photo of a woman and a boat."]], [["A cat laying on top of a laptop computer."], ["A cat sticking its head out of a window of a laptop."], ["A cat with its head out of a window of a laptop."]], [["A man holding a tennis racket on a tennis court."], ["A man jumping in the air with his feet."], ["A man holding a tennis racket on a tennis court."]], [["A cat sitting in front of a television."], ["A animal with hair laying on top of a bed."], ["A cat standing in front of a television."]], [["An airplane flying in the sky with a flag."], ["A painting of a man and a computer on a table."], ["A plane flying next to a flag in the sky."]], [["A group of stuffed teddy bears sitting on a table."], ["A counter with a bunch of cupcakes and desserts."], ["A group of stuffed teddy bears sitting on a table."]], [["A bathroom with a toilet and a sink and a tub."], ["A pink doll laying on the floor in a bathroom."], ["A white woman in a white dress on the bathroom."]], [["A street sign in front of a group of bikes."], ["A street sign with a yellow light on it."], ["A street sign with a yellow light on it."]], [["A man riding a snowboard down a snow covered slope."], ["A man flying through the air while riding a snowboard."], ["A man doing a trick on a snowboard in the snow."]], [["A large clock in the middle of a building."], ["Two dogs skiing with eggs in the same direction of two ben."], ["A large clock in the middle of a building."]], [["A boat is sitting in the water on a lake."], ["A rainbow in the side of a boat in a lake."], ["A boat is sitting on the side of a dock."]], [["An orange train is on the tracks in a forest."], ["A mountain with a book and a sandwich on a table."], ["An orange train is on the tracks."]], [["A man doing a trick on a skateboard on a city street."], ["A person blow drying its head on a yellow chair."], ["A person blow drying its head on a yellow chair."]]], "scores": {"meteor": [[0.7853703279064436, 0.16666666666666666, 0.16666666666666666], [0.47908863920099876, 0.4000000000000001, 0.47908863920099876], [0.7585268884703913, 0.3188131313131313, 0.7585268884703913], [0.4094799210006583, 0.28774193548387095, 0.28774193548387095], [0.5555555555555556, 0.27555555555555555, 0.2735294117647059], [0.372, 0.3993055555555555, 0.5111111111111111], [0.40990755276469565, 0.3795918367346939, 0.3896604938271605], [0.5863023175371843, 0.2652310924369748, 0.5863023175371843], [0.6944444444444444, 0.34128440366972473, 0.6944444444444444], [0.3468406593406593, 0.10989010989010987, 0.10989010989010987], [0.46875, 0.1234567901234568, 0.1875], [0.7060399917542773, 0.16304347826086954, 0.19801980198019806], [0.3468406593406593, 0.43314500941619577, 0.6320224719101123], [0.7519964507542148, 0.3155006858710563, 0.3896604938271605], [0.7687074829931974, 0.21978021978021975, 0.21978021978021975], [0.5782312925170067, 0.09900990099009903, 0.5782312925170067], [0.9995, 0.4213483146067415, 0.6360544217687074], [0.8017676767676769, 0.14851485148514848, 0.6988249845392702], [0.616925669350309, 0.13888888888888887, 0.13888888888888887], [0.5645569620253165, 0.12195121951219512, 0.45925925925925926], [0.3506944444444444, 0.19801980198019806, 0.2808302808302808], [0.5373493975903614, 0.1648351648351648, 0.5373493975903614], [0.9054545454545455, 0.7789062500000001, 0.9054545454545455], [0.4320647177790035, 0.3235653235653235, 0.5251825500842539], [0.6861724281549355, 0.15, 0.6861724281549355], [0.6310013717421126, 0.16666666666666666, 0.16666666666666666], [0.8918539325842695, 0.11718749999999999, 0.11718749999999999], [0.33929649758454106, 0.19841269841269843, 0.7937500000000002], [0.5318681318681319, 0.2652310924369748, 0.5681818181818182], [0.22471910112359547, 0.2808302808302808, 0.40760869565217384], [0.5160550458715595, 0.4481481481481482, 0.4429133858267717], [0.15151515151515152, 0.10204081632653061, 0.3757575757575758], [0.520408163265306, 0.20408163265306123, 0.520408163265306], [0.6880733944954129, 0.6724489795918367, 0.78677398989899], [0.6792413935271077, 0.04901960784313726, 0.6792413935271077], [0.5876795162509448, 0.18292682926829268, 0.5876795162509448], [0.7521527129370266, 0.3177966101694915, 0.33513513513513515], [0.9041027559546079, 0.18248175182481755, 0.9041027559546079], [0.6691919191919192, 0.5555555555555555, 0.6691919191919192], [0.537876167416119, 0.18292682926829268, 0.537876167416119], [0.25, 0.12195121951219512, 0.5616605616605616], [0.5269186712485682, 0.372, 0.372], [0.6578144078144077, 0.27777777777777773, 0.647130647130647], [0.8436213991769549, 0.309436274509804, 0.309436274509804], [0.5783794999481273, 0.12820512820512822, 0.5813754073057795], [0.32206632653061223, 0.25555555555555554, 0.32206632653061223], [0.5913134484563056, 0.5160550458715595, 0.9086363636363638], [0.5724489795918367, 0.3321428571428571, 0.3757575757575758], [0.5160550458715595, 0.1234567901234568, 0.5160550458715595], [0.7789062500000001, 0.31562500000000004, 0.5831325301204818], [0.5111111111111111, 0.309436274509804, 0.125], [0.5162738496071829, 0.25555555555555554, 0.5208333333333333], [0.618131868131868, 0.5373493975903614, 0.5373493975903614], [0.6988249845392702, 0.06097560975609756, 0.6988249845392702], [0.3647058823529412, 0.372, 0.3647058823529412], [0.7390260631001373, 0.2485236220472441, 0.6388888888888888], [0.8017676767676769, 0.15151515151515152, 0.9995], [0.8737244897959183, 0.1234567901234568, 0.8101794934841405], [0.8819444444444444, 0.1111111111111111, 0.8819444444444444], [0.40879120879120884, 0.13888888888888887, 0.40879120879120884], [0.6657910689028086, 0.6724489795918367, 0.6657910689028086], [0.66167290886392, 0.5625, 0.5625], [0.8629377676996723, 0.31250000000000006, 0.45510204081632655], [0.41682242990654206, 0.12048192771084339, 0.20444444444444443], [0.5964109781843773, 0.4955555555555556, 0.4179775280898876], [0.46875, 0.25813692480359146, 0.48996913580246915], [0.40879120879120884, 0.12987012987012989, 0.7933673469387754], [0.3116531165311653, 0.30423280423280424, 0.45925925925925926], [0.40879120879120884, 0.3506944444444444, 0.40879120879120884], [0.5813754073057795, 0.5060506050605059, 0.565083176127594], [0.46875, 0.4213483146067415, 0.46875], [0.8993827160493828, 0.3357712765957447, 0.7052154195011338], [0.66167290886392, 0.12195121951219512, 0.625], [0.4179775280898876, 0.35118110236220473, 0.46369203849518814], [0.5975308641975308, 0.30423280423280424, 0.4505050505050505], [0.9139118457300276, 0.19132653061224492, 0.9139118457300276], [0.782267115600449, 0.2222222222222222, 0.782267115600449], [0.46875, 0.25302530253025296, 0.46875], [0.3506944444444444, 0.27777777777777773, 0.46855921855921845], [0.560374149659864, 0.17094017094017094, 0.5796973961998594], [0.6410256410256411, 0.37796610169491524, 0.5076628352490421], [0.37763136750763293, 0.15748031496062992, 0.37763136750763293], [0.1648351648351648, 0.20833333333333331, 0.1648351648351648], [0.4101694915254237, 0.34766355140186916, 0.4990583804143125], [0.625, 0.0617283950617284, 0.625], [0.4440665154950869, 0.28956422018348627, 0.3444444444444445], [0.7585268884703913, 0.10948905109489049, 0.5569306930693068], [0.5625, 0.4518072289156627, 0.46296296296296297], [0.8103975535168196, 0.28434684684684686, 0.6472033257747543], [0.5373493975903614, 0.4536585365853659, 0.7181571815718157], [0.8228395061728395, 0.2634593356242841, 0.8228395061728395], [0.7687074829931974, 0.3194444444444444, 0.7687074829931974], [0.39453125, 0.25813692480359146, 0.25813692480359146], [0.23232323232323232, 0.13636363636363635, 0.30789825970548856], [0.5902439024390245, 0.1234567901234568, 0.6859756097560975], [0.6226379440665155, 0.3546348314606741, 0.49010989010989015], [0.7602601480152501, 0.618131868131868, 0.7602601480152501], [0.4955555555555556, 0.11235955056179774, 0.3468406593406593], [0.7349537037037036, 0.23445463812436282, 0.5503634475597092], [0.8017676767676769, 0.19801980198019806, 0.6792413935271077], [0.6979762661580843, 0.16129032258064518, 0.20629084967320263], [0.5975308641975308, 0.605, 0.605], [0.9993141289437586, 0.33938172043010756, 0.33938172043010756], [0.7145928899082569, 0.05617977528089887, 0.17523364485981308], [0.5952065677966102, 0.2410901467505241, 0.2410901467505241], [0.6724489795918367, 0.3125, 0.49387755102040815], [0.7687074829931974, 0.12048192771084339, 0.6777108433734939], [0.8211575489862951, 0.1358695652173913, 0.6981085116973618], [0.5506172839506173, 0.16853932584269662, 0.5506172839506173], [0.1875, 0.09259259259259259, 0.2545362903225807], [0.650318287037037, 0.25813692480359146, 0.4732510288065843], [0.7282110091743119, 0.11904761904761905, 0.616925669350309], [0.5943152454780362, 0.15, 0.25555555555555554], [0.38110236220472443, 0.18018018018018017, 0.46464646464646464], [0.1234567901234568, 0.15503875968992248, 0.18292682926829268], [0.7668240850059032, 0.23554104477611937, 0.605], [0.1851851851851852, 0.12048192771084339, 0.18292682926829268], [0.6962184873949581, 0.12711864406779658, 0.12711864406779658], [0.6310013717421126, 0.17123287671232876, 0.6310013717421126], [0.5076628352490421, 0.26976495726495725, 0.5698720166032515], [0.5111111111111111, 0.16666666666666666, 0.36831683168316837], [0.7913056930693071, 0.25555555555555554, 0.7913056930693071], [0.5574156746031746, 0.20122484689413825, 0.5574156746031746], [0.8918539325842695, 0.0625, 0.0625], [0.5563218390804598, 0.43069584736251404, 0.5563218390804598], [0.30303030303030304, 0.14851485148514848, 0.14851485148514848], [0.6792413935271077, 0.29761904761904767, 0.48443619872191296], [0.5506172839506173, 0.4518072289156627, 0.5506172839506173], [0.7059558517284465, 0.11235955056179774, 0.7059558517284465], [0.15151515151515152, 0.4440366972477064, 0.1530612244897959], [0.618131868131868, 0.0, 0.618131868131868], [0.6898846495119787, 0.17094017094017094, 0.4043478260869566], [0.5452674897119341, 0.29224537037037035, 0.29224537037037035], [0.6532519549876025, 0.15, 0.15], [0.7309228039041704, 0.15151515151515152, 0.41666666666666663], [0.7789062500000001, 0.14851485148514848, 0.34128440366972473], [0.38027108433734946, 0.17045454545454547, 0.38027108433734946], [0.4024496937882765, 0.3384038800705468, 0.3384038800705468], [0.5698720166032515, 0.16806722689075632, 0.5698720166032515], [0.5773420479302832, 0.3506944444444444, 0.3506944444444444], [0.7789062500000001, 0.14563106796116504, 0.7789062500000001], [0.5164292279411764, 0.16806722689075632, 0.5164292279411764], [0.41360294117647056, 0.33283582089552244, 0.33283582089552244], [0.8101794934841405, 0.12048192771084339, 0.46499999999999997], [0.372, 0.4505050505050505, 0.4505050505050505], [0.5294873855053832, 0.07812500000000001, 0.07812500000000001], [0.32327586206896547, 0.17241379310344826, 0.3206896551724139], [0.7023437500000002, 0.3468406593406593, 0.4263888888888889], [0.5011235955056179, 0.05952380952380953, 0.41333333333333333], [0.8200597312095569, 0.42216721672167207, 0.8200597312095569], [0.6476468138275718, 0.25828460038986356, 0.6476468138275718], [0.5306603773584906, 0.28956422018348627, 0.5208333333333333], [0.3896604938271605, 0.1875, 0.3896604938271605], [0.8918539325842695, 0.755560651226783, 0.8918539325842695], [0.6880733944954129, 0.12048192771084339, 0.12048192771084339], [0.3, 0.21582733812949637, 0.34843750000000007], [0.4440366972477064, 0.28956422018348627, 0.4440366972477064], [0.31525423728813556, 0.17241379310344826, 0.17241379310344826], [0.4810495626822157, 0.20122484689413825, 0.09174311926605505], [0.27777777777777773, 0.3468406593406593, 0.45848267622461175], [0.6918367346938775, 0.20202020202020204, 0.498], [0.38265306122448983, 0.2839506172839506, 0.2839506172839506], [0.5160550458715595, 0.2028218694885362, 0.5160550458715595], [0.46875, 0.17201834862385323, 0.17201834862385323], [0.47920792079207924, 0.23023023023023023, 0.36351165980795613], [0.21978021978021975, 0.19230769230769232, 0.25], [0.8103975535168196, 0.19230769230769232, 0.19230769230769232], [0.6222271517302573, 0.16853932584269662, 0.5555555555555555], [0.9995, 0.15151515151515152, 0.5948372615039282], [0.2583333333333333, 0.17746913580246912, 0.290625], [0.40879120879120884, 0.1648351648351648, 0.7309228039041704], [0.9993141289437586, 0.49010989010989015, 0.9993141289437586], [0.8287608596250572, 0.5902439024390245, 0.5902439024390245], [0.7500000000000001, 0.39453125, 0.9163223140495868], [0.2504960317460318, 0.19965277777777776, 0.2504960317460318], [0.5782312925170067, 0.3757575757575758, 0.25510204081632654], [0.37500000000000006, 0.25813692480359146, 0.37878787878787884], [0.5616605616605616, 0.4523364485981308, 0.5679012345679012], [0.39480452674897115, 0.5318681318681319, 0.5318681318681319], [0.46875, 0.46296296296296297, 0.4746835443037974], [0.3546348314606741, 0.19965277777777776, 0.3546348314606741], [0.5575, 0.5438202247191011, 0.45925925925925926], [0.6724489795918367, 0.49387755102040815, 0.600907029478458], [0.4213483146067415, 0.1648351648351648, 0.27472527472527475], [0.5399659863945577, 0.09868421052631579, 0.09868421052631579], [0.7948022959183674, 0.6724489795918367, 0.7948022959183674], [0.18018018018018017, 0.23662551440329216, 0.18518518518518517], [0.3444444444444445, 0.18181818181818182, 0.5215419501133786], [0.8301839254220206, 0.3896604938271605, 0.8301839254220206], [0.5739795918367346, 0.15625, 0.15625], [0.4641544117647058, 0.3112327656123276, 0.568544708029197], [0.4179775280898876, 0.4043478260869566, 0.4179775280898876], [0.5616605616605616, 0.1234567901234568, 0.4955555555555556], [0.5769944341372912, 0.13761467889908252, 0.1851851851851852], [0.6859756097560975, 0.21296296296296297, 0.7454289732770746], [0.6954520089285714, 0.12048192771084339, 0.5666909620991254], [0.5377777777777778, 0.24752475247524755, 0.16853932584269662], [0.8421440865502825, 0.09433962264150944, 0.09433962264150944], [0.7361111111111112, 0.4481481481481482, 0.7361111111111112], [0.6600900423728814, 0.16304347826086954, 0.6600900423728814], [0.5060506050605059, 0.38659793814432986, 0.4849137931034482], [0.38490853658536583, 0.125, 0.5199864498644986], [0.6578144078144077, 0.28714107365792757, 0.6578144078144077], [0.45074722802506817, 0.18181818181818182, 0.6428433641975309], [0.7014492753623188, 0.3468406593406593, 0.7014492753623188], [0.4523364485981308, 0.41333333333333333, 0.41333333333333333], [0.4737654320987654, 0.1875, 0.6233062330623306], [0.738954922628392, 0.31562500000000004, 0.738954922628392], [0.32763532763532766, 0.0617283950617284, 0.32763532763532766], [0.6320224719101123, 0.7230634189159536, 0.9990234375], [0.4213483146067415, 0.3074380165289256, 0.5616605616605616], [0.6792413935271077, 0.47450980392156866, 0.28956422018348627], [0.5318681318681319, 0.32763532763532766, 0.5318681318681319], [0.47920792079207924, 0.14851485148514848, 0.14851485148514848], [0.43684710351377026, 0.12820512820512822, 0.12820512820512822], [0.6558823529411766, 0.21657250470809788, 0.6091911764705883], [0.4227272727272727, 0.2222222222222222, 0.2222222222222222], [0.32206632653061223, 0.3155006858710563, 0.3188131313131313], [0.47959183673469385, 0.21618150684931506, 0.5474137931034483], [0.5060506050605059, 0.12, 0.2485236220472441], [0.4295051353874883, 0.15625000000000003, 0.15], [0.3381818181818182, 0.13888888888888887, 0.34766355140186916], [0.368595041322314, 0.31525423728813556, 0.2720905172413793], [0.598404255319149, 0.26956521739130435, 0.26956521739130435], [0.3177966101694915, 0.2525, 0.15873015873015875], [0.618872549019608, 0.42564102564102574, 0.5948372615039282], [0.8861997310842195, 0.23554104477611942, 0.8861997310842195], [0.66167290886392, 0.1111111111111111, 0.66167290886392], [0.8466372282608694, 0.5439024390243904, 0.6861413043478259], [0.3331163194444444, 0.20122484689413825, 0.32206632653061223], [0.3872, 0.3872, 0.3931623931623932], [0.5160550458715595, 0.1834862385321101, 0.5160550458715595], [0.41360294117647056, 0.12396694214876033, 0.12396694214876033], [0.7853703279064436, 0.18939393939393942, 0.18750000000000003], [0.9041027559546079, 0.3640776699029127, 0.8017676767676769], [0.8152173913043477, 0.5011235955056179, 0.8152173913043477], [0.46046046046046046, 0.46890927624872564, 0.23662551440329216], [0.5612244897959183, 0.5902439024390245, 0.5076058201058201], [0.78677398989899, 0.19801980198019806, 0.78677398989899], [0.4440366972477064, 0.20833333333333331, 0.20833333333333331], [0.12820512820512822, 0.15, 0.15], [0.5506172839506173, 0.2720905172413793, 0.6388888888888888], [0.5506172839506173, 0.19841269841269843, 0.6036745406824147], [0.19132653061224492, 0.29444444444444445, 0.38265306122448983], [0.618131868131868, 0.10344827586206895, 0.3506944444444444], [0.49975895870159076, 0.2191840277777778, 0.3757440476190476], [0.40917431192660547, 0.1530612244897959, 0.46875], [0.3876262626262626, 0.18018018018018017, 0.18018018018018017], [0.5377777777777778, 0.21067415730337075, 0.6114130434782608], [0.1736111111111111, 0.412087912087912, 0.3155006858710563], [0.7636335784313727, 0.16666666666666666, 0.7562196601941749], [0.5698720166032515, 0.5022321428571428, 0.5022321428571428], [0.2735294117647059, 0.26956521739130435, 0.3303703703703704], [0.3468406593406593, 0.25813692480359146, 0.25813692480359146], [0.41333333333333333, 0.1648351648351648, 0.41333333333333333], [0.611317254174397, 0.10101010101010102, 0.3444444444444445], [0.6400966183574879, 0.0617283950617284, 0.6400966183574879], [0.6724489795918367, 0.1111111111111111, 0.5162738496071829], [0.3896604938271605, 0.34307065217391297, 0.41333333333333333], [0.35046728971962615, 0.46890927624872564, 0.46890927624872564], [0.7059558517284465, 0.29150326797385623, 0.446], [0.36831683168316837, 0.10000000000000002, 0.10000000000000002], [0.9280792420327304, 0.28714107365792757, 0.66167290886392], [0.4472257653061224, 0.21842355175688513, 0.3457364341085272], [0.41802832244008714, 0.1834862385321101, 0.5686936936936937], [0.5563218390804598, 0.18292682926829268, 0.5563218390804598], [0.6465763875643715, 0.5257009345794392, 0.5257009345794392], [0.7711943069306932, 0.16304347826086954, 0.6955380577427821], [0.6087662337662337, 0.2054794520547945, 0.2054794520547945], [0.864795918367347, 0.14851485148514848, 0.864795918367347], [0.31250000000000006, 0.18382352941176472, 0.31250000000000006], [0.7270233196159123, 0.2630208333333333, 0.7181571815718157], [0.9993141289437586, 0.541304347826087, 0.541304347826087], [0.4518072289156627, 0.18292682926829268, 0.3234880450070324], [0.7017173423423423, 0.11235955056179774, 0.7017173423423423], [0.8880208333333333, 0.7766439909297052, 0.8880208333333333], [0.3811965811965813, 0.3757440476190476, 0.7361111111111112], [0.2839506172839506, 0.12658227848101264, 0.12658227848101264], [0.5975308641975308, 0.17045454545454547, 0.17045454545454547], [0.6376262626262627, 0.10000000000000002, 0.10000000000000002], [0.618131868131868, 0.125, 0.618131868131868], [0.2118288590604027, 0.2207167832167832, 0.21618150684931506], [0.6284569902727446, 0.4839939024390244, 0.6073170731707318], [0.6360544217687074, 0.1234567901234568, 0.6360544217687074], [0.4043478260869566, 0.16304347826086954, 0.4043478260869566], [0.7622047244094489, 0.5859375000000001, 0.7622047244094489], [0.4732510288065843, 0.18292682926829268, 0.4732510288065843], [0.8072916666666667, 0.40180180180180186, 0.8072916666666667], [0.5769944341372912, 0.13636363636363635, 0.32206632653061223], [0.7270233196159123, 0.2808302808302808, 0.6859756097560975], [0.6310013717421126, 0.2293577981651376, 0.6310013717421126], [0.703125, 0.1234567901234568, 0.703125], [0.6465763875643715, 0.23232323232323232, 0.23232323232323232], [0.9163223140495868, 0.32051282051282054, 0.9163223140495868], [0.46464646464646464, 0.08064516129032259, 0.3305340223944875], [0.5361402671755726, 0.2525, 0.5859375000000001], [0.9996243425995492, 0.5452674897119341, 0.5452674897119341], [0.6346938775510204, 0.5724489795918367, 0.5724489795918367], [0.6332138590203108, 0.3188131313131313, 0.43069584736251404], [0.44592696629213474, 0.33223684210526316, 0.28434684684684686], [0.7687074829931974, 0.16666666666666666, 0.7687074829931974], [0.6724489795918367, 0.29523809523809524, 0.6792413935271077], [0.29224537037037035, 0.10989010989010987, 0.10989010989010987], [0.625, 0.3296703296703296, 0.3296703296703296], [0.5888888888888889, 0.5460778061224489, 0.5888888888888889], [0.625, 0.18691588785046728, 0.625], [0.654320987654321, 0.20408163265306123, 0.5111111111111111], [0.8722527472527472, 0.19363496932515337, 0.8722527472527472], [0.7080965909090909, 0.16806722689075632, 0.7080965909090909], [0.854119425547997, 0.0625, 0.8737244897959183], [0.5300453514739228, 0.2869318181818182, 0.5300453514739228], [0.634712600636585, 0.13761467889908252, 0.45510204081632655], [0.8918539325842695, 0.4440366972477064, 0.8918539325842695], [0.7773446457234581, 0.5373493975903614, 0.4536585365853659], [0.3547523427041499, 0.15151515151515152, 0.15151515151515152], [0.7098765432098765, 0.07042253521126761, 0.07042253521126761], [0.8993827160493828, 0.5010893246187365, 0.7937500000000002], [0.8654513888888888, 0.4440366972477064, 0.8654513888888888], [0.4737654320987654, 0.2222222222222222, 0.4737654320987654], [0.45731707317073167, 0.34128440366972473, 0.6849868660335421], [0.5681818181818182, 0.10000000000000002, 0.2869318181818182], [0.618131868131868, 0.3468406593406593, 0.618131868131868], [0.8211575489862951, 0.29224537037037035, 0.28956422018348627], [0.5667811679127096, 0.13761467889908252, 0.22222222222222224], [0.7212094907407407, 0.19607843137254904, 0.7212094907407407], [0.6792413935271077, 0.10000000000000002, 0.7789062500000001], [0.5076628352490421, 0.11363636363636365, 0.5076628352490421], [0.7934426229508196, 0.3811965811965813, 0.5424733996162567], [0.6859756097560975, 0.1851851851851852, 0.6859756097560975], [0.6657910689028086, 0.17201834862385323, 0.45925925925925926], [0.5208333333333333, 0.3381818181818182, 0.5208333333333333], [0.6849868660335421, 0.3411111111111111, 0.6849868660335421], [0.6443520642201835, 0.412087912087912, 0.6443520642201835], [0.9990234375, 0.125, 0.9990234375], [0.4472257653061224, 0.1111111111111111, 0.4634661835748792], [0.9054545454545455, 0.13888888888888887, 0.5931718481785236], [0.12658227848101264, 0.2869318181818182, 0.15], [0.4505050505050505, 0.2869318181818182, 0.3188131313131313], [0.6215431415929203, 0.520408163265306, 0.7017173423423423], [0.7948022959183674, 0.34307065217391297, 0.7948022959183674], [0.4955555555555556, 0.10869565217391303, 0.4955555555555556], [0.8211575489862951, 0.13761467889908252, 0.8211575489862951], [0.4361263736263736, 0.15, 0.15], [0.5452674897119341, 0.31250000000000006, 0.31250000000000006], [0.4049744897959184, 0.3116531165311653, 0.3116531165311653], [0.38490853658536583, 0.5902439024390245, 0.2469135802469136], [0.8950617283950617, 0.2652310924369748, 0.8950617283950617], [0.8950617283950617, 0.05050505050505051, 0.05050505050505051], [0.32538659793814434, 0.1875, 0.1875], [0.654320987654321, 0.3896604938271605, 0.654320987654321], [0.3639097744360902, 0.28714107365792757, 0.41666666666666663], [0.5424733996162567, 0.38265306122448983, 0.5424733996162567], [0.1851851851851852, 0.11764705882352941, 0.5439024390243904], [0.6320203400121432, 0.290625, 0.23437499999999997], [0.7521527129370266, 0.36134651600753287, 0.36134651600753287], [0.8030303030303031, 0.48478260869565226, 0.8030303030303031], [0.755560651226783, 0.2869318181818182, 0.2869318181818182], [0.41360294117647056, 0.27777777777777773, 0.5377777777777778], [0.4958545918367347, 0.15873015873015875, 0.15873015873015875], [0.3153153153153153, 0.29224537037037035, 0.5808080808080809], [0.854119425547997, 0.31562500000000004, 0.40917431192660547], [0.5452674897119341, 0.29224537037037035, 0.2949766355140187], [0.600907029478458, 0.12711864406779658, 0.12711864406779658], [0.5205314009661836, 0.4033485540334855, 0.4990583804143125], [0.8099489795918368, 0.05050505050505051, 0.05050505050505051], [0.7773446457234581, 0.49010989010989015, 0.7773446457234581], [0.6988249845392702, 0.25813692480359146, 0.25813692480359146], [0.45510204081632655, 0.10752688172043011, 0.537876167416119], [0.6988249845392702, 0.25555555555555554, 0.6988249845392702], [0.6114130434782608, 0.39453125, 0.39453125], [0.3896604938271605, 0.12195121951219512, 0.46499999999999997], [0.7361111111111112, 0.38027108433734946, 0.6233062330623306], [0.5269186712485682, 0.3116531165311653, 0.5269186712485682], [0.4776739356178608, 0.10309278350515463, 0.34766355140186916], [0.20833333333333331, 0.350076103500761, 0.29224537037037035], [0.4990583804143125, 0.12820512820512822, 0.7585268884703913], [0.537876167416119, 0.24658203125000006, 0.5952380952380953], [0.9530428249436514, 0.3896604938271605, 0.3896604938271605], [0.7390260631001373, 0.309436274509804, 0.309436274509804], [0.4536585365853659, 0.18292682926829268, 0.37763136750763293], [0.5377777777777778, 0.38027108433734946, 0.5645569620253165], [0.6126582278481013, 0.16853932584269662, 0.46296296296296297], [0.6944444444444445, 0.1875, 0.1875], [0.40917431192660547, 0.2818080357142857, 0.41682242990654206], [0.46668667466986796, 0.37307380373073795, 0.372], [0.3758169934640523, 0.26956521739130435, 0.3208519875186542], [0.7212094907407407, 0.2293577981651376, 0.2293577981651376], [0.446, 0.3896604938271605, 0.32206632653061223], [0.625, 0.12195121951219512, 0.625], [0.7681094415788293, 0.2446705426356589, 0.6651234567901234], [0.8833333333333334, 0.2808302808302808, 0.23427960927960922], [0.6428433641975309, 0.1968503937007874, 0.6284569902727446], [0.738954922628392, 0.11811023622047245, 0.13636363636363635], [0.40879120879120884, 0.19810508182601205, 0.19810508182601205], [0.7711943069306932, 0.10101010101010102, 0.4597938144329897], [0.5199864498644986, 0.12711864406779658, 0.5199864498644986], [0.46296296296296297, 0.22865853658536583, 0.46296296296296297], [0.8918539325842695, 0.11235955056179774, 0.625], [0.29523809523809524, 0.2028218694885362, 0.32925170068027215], [0.4955555555555556, 0.40917431192660547, 0.4955555555555556], [0.738954922628392, 0.11235955056179774, 0.738954922628392], [0.703125, 0.13888888888888887, 0.13888888888888887], [0.6388888888888888, 0.3647058823529412, 0.6388888888888888], [0.8880208333333333, 0.125, 0.9993141289437586], [0.7545454545454545, 0.3381818181818182, 0.3153153153153153], [0.5841316118284048, 0.20000000000000004, 0.6861724281549355], [0.806697108066971, 0.5260869565217392, 0.9575062901873077], [0.5010893246187365, 0.0, 0.5010893246187365], [0.616925669350309, 0.22865853658536583, 0.8918539325842695], [0.6988249845392702, 0.12711864406779658, 0.6988249845392702], [0.5635887028581092, 0.2735294117647059, 0.551470588235294], [0.8551587301587302, 0.16806722689075632, 0.6447688564476887], [0.5813754073057795, 0.4067226890756303, 0.5813754073057795], [0.37500000000000006, 0.18939393939393942, 0.18939393939393942], [0.5991586538461539, 0.3993055555555555, 0.49975895870159076], [0.8819444444444444, 0.16129032258064518, 0.7471655328798186], [0.485126253891387, 0.12820512820512822, 0.3155006858710563], [0.39480452674897115, 0.530952380952381, 0.39480452674897115], [0.3599374021909233, 0.38490853658536583, 0.38265306122448983], [0.5563218390804598, 0.1530612244897959, 0.5563218390804598], [0.46890927624872564, 0.28714107365792757, 0.3444444444444445], [0.6411049268192124, 0.25302530253025296, 0.6411049268192124], [0.3757440476190476, 0.18750000000000003, 0.18750000000000003], [0.618131868131868, 0.1530612244897959, 0.446], [0.8918539325842695, 0.16129032258064518, 0.6974657995066158], [0.6181795634920636, 0.20202020202020204, 0.49387755102040815], [0.618131868131868, 0.3271604938271605, 0.3271604938271605], [0.9996243425995492, 0.15151515151515152, 0.15151515151515152], [0.44285714285714284, 0.4518072289156627, 0.46296296296296297], [0.7212094907407407, 0.09259259259259259, 0.09259259259259259], [0.8236151603498543, 0.12195121951219512, 0.8335382345709367], [0.8017676767676769, 0.3757575757575758, 0.8017676767676769], [0.44708508403361347, 0.36134651600753287, 0.5952065677966102], [0.24658203125000006, 0.206043956043956, 0.2607709750566893], [0.66167290886392, 0.1648351648351648, 0.66167290886392], [0.7687074829931974, 0.5377777777777778, 0.7687074829931974], [0.6818181818181819, 0.2607709750566893, 0.6818181818181819], [0.8687160326086956, 0.13888888888888887, 0.8687160326086956], [0.42720073103868417, 0.27173913043478265, 0.4634661835748792], [0.5739795918367346, 0.5625, 0.600907029478458], [0.6988249845392702, 0.125, 0.125], [0.4745565878378378, 0.32763532763532766, 0.32763532763532766], [0.5162738496071829, 0.25555555555555554, 0.31794871794871804], [0.4213483146067415, 0.06097560975609756, 0.412087912087912], [0.40879120879120884, 0.2839506172839506, 0.8880208333333333], [0.5439024390243904, 0.17241379310344826, 0.618131868131868], [0.5575, 0.17201834862385323, 0.17201834862385323], [0.4955555555555556, 0.2808302808302808, 0.2808302808302808], [0.8152173913043477, 0.2808302808302808, 0.8152173913043477], [0.41333333333333333, 0.06024096385542169, 0.06024096385542169], [0.446, 0.15789473684210528, 0.15789473684210528], [0.7789062500000001, 0.372, 0.7789062500000001], [0.654320987654321, 0.21739130434782605, 0.29224537037037035], [0.35830999066293184, 0.22471910112359547, 0.45848267622461175], [0.7485875706214691, 0.1293103448275862, 0.5698720166032515], [0.4282069970845481, 0.14492753623188406, 0.4282069970845481], [0.4240362811791383, 0.46668667466986796, 0.4240362811791383], [0.6944444444444445, 0.19801980198019806, 0.19801980198019806], [0.8819444444444444, 0.20833333333333331, 0.20833333333333331], [0.3757575757575758, 0.12820512820512822, 0.3757575757575758], [0.6226379440665155, 0.41296296296296303, 0.6792413935271077], [0.39574468085106385, 0.3188131313131313, 0.39574468085106385], [0.3444444444444445, 0.37812500000000004, 0.41296296296296303], [0.42613636363636365, 0.24278846153846156, 0.42613636363636365], [0.2652310924369748, 0.5076628352490421, 0.5076628352490421], [0.7773446457234581, 0.20380434782608692, 0.4737654320987654], [0.6944444444444445, 0.17624521072796934, 0.17624521072796934], [0.5717948717948719, 0.17045454545454547, 0.17045454545454547], [0.864795918367347, 0.12195121951219512, 0.8437033349925335], [0.1530612244897959, 0.125, 0.1834862385321101], [0.7773446457234581, 0.27777777777777773, 0.6400966183574879], [0.618131868131868, 0.06097560975609756, 0.3546348314606741], [0.5269186712485682, 0.3674768518518518, 0.2751817237798546], [0.582287961055982, 0.34403669724770647, 0.46890927624872564], [0.6506642512077294, 0.412087912087912, 0.44592696629213474], [0.5876795162509448, 0.1834862385321101, 0.6944444444444445], [0.3468406593406593, 0.41333333333333333, 0.40879120879120884], [0.3506944444444444, 0.20122484689413825, 0.3506944444444444], [0.6392045454545455, 0.2974186307519641, 0.2974186307519641], [0.7052154195011338, 0.6320224719101123, 0.7052154195011338], [0.8993827160493828, 0.40760869565217384, 0.40760869565217384], [0.8950617283950617, 0.45660377358490567, 0.600907029478458], [0.5305305305305306, 0.234375, 0.234375], [0.4634661835748792, 0.2607709750566893, 0.25302530253025296], [0.8101794934841405, 0.18072289156626503, 0.8101794934841405], [0.5667811679127096, 0.23445463812436282, 0.650318287037037], [0.6792413935271077, 0.05102040816326531, 0.6792413935271077], [0.5495818399044207, 0.09174311926605505, 0.5495818399044207], [0.8993827160493828, 0.19607843137254904, 0.8017676767676769], [0.6329534662867996, 0.15748031496062992, 0.15748031496062992], [0.8918539325842695, 0.4179775280898876, 0.8918539325842695], [0.38490853658536583, 0.12658227848101264, 0.32206632653061223], [0.5215419501133786, 0.1648351648351648, 0.1648351648351648], [0.49010989010989015, 0.1595744680851064, 0.1595744680851064], [0.7861781076066792, 0.18930041152263377, 0.7773446457234581], [0.616925669350309, 0.5625, 0.5625], [0.6320224719101123, 0.4179775280898876, 0.6320224719101123], [0.49975895870159076, 0.2272727272727273, 0.2272727272727273], [0.4056437389770724, 0.2027027027027027, 0.4383680555555556], [0.3381818181818182, 0.13636363636363635, 0.13636363636363635], [0.654320987654321, 0.33938172043010756, 0.3457364341085272], [0.446, 0.17746913580246912, 0.446], [0.7132444814660558, 0.25555555555555554, 0.600907029478458], [0.6411049268192124, 0.05434782608695651, 0.446], [0.6050290486564996, 0.15151515151515152, 0.6050290486564996], [0.4265202702702703, 0.18750000000000003, 0.18750000000000003], [0.20000000000000004, 0.6226379440665155, 0.6226379440665155], [0.28956422018348627, 0.25555555555555554, 0.14851485148514848], [0.4732510288065843, 0.09090909090909091, 0.4732510288065843], [0.30487804878048785, 0.5373493975903614, 0.3468406593406593], [0.6233062330623306, 0.09900990099009903, 0.5205314009661836], [0.8300000000000002, 0.28956422018348627, 0.28956422018348627]]}}