{"seed": 42, "num_examples": 256, "batch_size": 1, "captions": [[["An elephant in the back of a truck."], ["An elephant and a cat in the snow next to a truck."]], [["A person doing a trick on a skateboard."], ["A man doing a trick on a skateboard."]], [["A man standing on a tennis court holding a racket."], ["A man standing on a tennis court holding a racket and a ball."]], [["A man standing in a box with a pizza in it."], ["A woman standing next to a box with a pizza in a table."]], [["A pair of shoes and a pair of shoes on a table."], ["A box with a pair of items in it."]], [["A table with glasses of wine and bread on it."], ["A table with glasses of wine and plates of wine."]], [["A living room with a couch and a table."], ["A living room with a couch and a television."]], [["A man sitting at a table with a laptop computer."], ["A man sitting at a table with a laptop."]], [["A desk with two computer monitors and a keyboard."], ["A computer monitor and a keyboard on a desk."]], [["Two elephants and a baby elephant standing next to trees."], ["An elephant and a baby elephant standing in the snow."]], [["A bathroom with a toilet with a table."], ["A bathroom with a toilet and a shower curtain."]], [["A large airplane sitting on top of an airport runway."], ["An airplane taking off from an airport runway with a large airplane."]], [["A group of people riding a bike down a street."], ["Three men riding motorcycles at a gas station."]], [["Two giraffes and a baby giraffe standing next to a building."], ["A zoo with a giraffe and a car and people."]], [["A woman sitting on a toilet on the sidewalk."], ["A woman sitting on a toilet on the side of a road."]], [["A large clock on the side of a wall."], ["A large clock on the side of a building."]], [["A man sitting on the beach next to a surfboard."], ["A man laying on a surfboard on the beach."]], [["An orange cat laying on the hood of a car."], ["An orange cat laying on the back of a truck."]], [["A bride and groom standing next to a wedding cake."], ["A person standing on the floor next to a cake."]], [["A large dog sleeping on a bed."], ["A man and a woman laying on a bed playing a video game."]], [["A baby laying in a bed with a blanket."], ["A baby laying in a bed with a wine glass."]], [["A train is sitting on the tracks in a train yard."], ["A train is sitting on the tracks in a train yard."]], [["A stack of pancakes sitting on a plate on a table."], ["A stack of pancakes sitting on a plate on a table."]], [["A pair of scissors sitting on top of a table."], ["A pair of scissors sitting on top of a piece of paper."]], [["A book shelf with a bunch of books."], ["A remote control sitting on top of a book shelf with books."]], [["Two birds sitting on top of a tree branch."], ["Two birds sitting on top of a tree branch."]], [["A woman sitting at a table eating food."], ["A woman sitting at a table with a cell phone."]], [["A man standing in the grass with a frisbee."], ["A man standing in front of a dog in the water."]], [["A parking meter on the side of a street."], ["A parking meter sitting on the side of a street."]], [["A banana sitting on top of a desk."], ["A banana sitting on a desk next to a phone."]], [["A group of people in costumes walking down a street."], ["A group of people dressed in costumes with a frisbee."]], [["A table with glasses and a vase with flowers."], ["A vase with flowers in it with candles in it."]], [["A woman standing in a kitchen with a pot of food."], ["A woman cooking food in a pot on a stove."]], [["A clock tower in the middle of a street."], ["A clock tower in the top of a building."]], [["Two tennis players shaking hands on a tennis court."], ["Two tennis players shaking hands on a tennis court."]], [["A living room with a couch and a table."], ["A living room with a teddy bear on a table and a television."]], [["A man sitting on a bench in front of a church."], ["A man doing a trick on a motorcycle in the air."]], [["A man riding on the back of an elephant."], ["A man riding on the back of an elephant."]], [["A stop sign with writing on it."], ["A woman in a bikini sitting in front of a stop sign."]], [["A white bathroom with a bath tub and a toilet."], ["A bathroom with a toilet and a shower."]], [["A large airplane sitting on top of an airport runway."], ["An airplane sitting on top of a table with people."]], [["A blue bus parked on the side of a street."], ["A bus with forks on the side of a street."]], [["Two black and white cats laying next to each other."], ["A black and white cat sitting in a room."]], [["A pizza sitting on top of a white plate on a table."], ["A pizza sitting on top of a table."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard with a dog."]], [["A plate with a sandwich and french fries."], ["A plate with a sandwich and french fries and a salad."]], [["A red and white bus parked in front of a building."], ["A bus parked in front of a building."]], [["A train is sitting on the tracks."], ["An umbrella sitting on the tracks in a field."]], [["A black and white photo of a group of people."], ["A black and white photo of a group of people with a horse."]], [["A man standing on a tennis court holding a racket."], ["A man standing on a tennis court holding a racket."]], [["A black and white stove top oven in a kitchen."], ["A kitchen with a stove top oven and a table."]], [["A traffic light in the middle of a city street."], ["A traffic light on the side of a street."]], [["A banana sitting on a plate next to a table."], ["A banana sitting on top of a toilet."]], [["A man in a white uniform holding a large pair of scissors."], ["A picture of a man holding a dog and tie."]], [["A man standing on skis on top of a snow covered slope."], ["A person on skis on a snow covered slope."]], [["A kitchen with a table and a refrigerator."], ["A room with plates and a television in it and a bed."]], [["A man flying through the air on a snowboard."], ["A man flying through the air while riding a snowboard."]], [["A pizza sitting on a plate next to a drink."], ["A pizza and a can of soda on a table."]], [["A cat playing with its reflection in a mirror."], ["A small kitten is in a round mirror."]], [["A vase with red flowers in it in front of a oven."], ["A vase with flowers in front of a television."]], [["A group of women standing around a table with a cake."], ["A group of women sitting around a table with a cake."]], [["A woman standing next to an elderly man."], ["An elderly man brushing woman s teeth in a mirror."]], [["A clock on a pole on a building."], ["A clock on the side of a building on a street."]], [["A bathroom with two sinks and a toilet."], ["A bathroom with a phone hanging on the wall."]], [["A man with a dog sitting in a backpack."], ["A woman walking down a set of stairs with luggage."]], [["A group of teddy bears sitting next to each other."], ["A group of teddy bears sitting next to each other."]], [["A young man riding a skateboard on a skate park."], ["A person laying on a wall with a pair of skis."]], [["A stuffed teddy bear wearing a mask sitting on a bed."], ["A teddy bear with a bow tie sitting on a bed."]], [["A group of people riding skis on a ski lift."], ["A group of people riding skis on a ski lift."]], [["A black bird sitting on a chair next to a woman."], ["A woman sitting next to a black bird on a sidewalk."]], [["A dining room with a table and chairs."], ["A dog sitting in a living room with a table."]], [["A young boy swinging a baseball bat at a ball."], ["A young boy swinging a baseball bat at a ball."]], [["A city street at night with a traffic light."], ["A city street at night with a traffic light."]], [["A woman standing on skis in the snow."], ["A woman on skis on a snow covered slope."]], [["A bedroom with a bed with pillows on it."], ["A bed with pillows on top of it."]], [["A man doing a trick on a skateboard at a skate park."], ["A man doing a trick on a skateboard in the air."]], [["A man riding a wave on a surfboard."], ["A man riding a wave on a surfboard in the water."]], [["A group of horses grazing in a field."], ["A group of horses in a field with a blanket."]], [["A large swimming pool with a table and a table."], ["A swimming pool with a person in it."]], [["A group of people standing on an airplane."], ["A group of people standing at an airport."]], [["A black cat sitting in front of a door."], ["A black cat standing in front of a door."]], [["A woman standing on a tennis court with a ball."], ["A man standing on a tennis court holding a ball."]], [["A man standing on a tennis court with a racket."], ["A man standing on a tennis court with a ball."]], [["A large bed with red pillows on top of it."], ["A bed with two lamps on top of it."]], [["An airplane flying over a tree in the sky."], ["A large airplane flying in the sky over trees."]], [["A construction truck and orange cones on a street."], ["A group of orange cones and a truck in front of a building."]], [["A hot dog and a bottle of soda on tin foil."], ["A hot dog sitting next to a bottle of soda."]], [["A red stop sign on the side of a street."], ["A stop sign and a street sign on a pole."]], [["A polar bear laying on top of rocks."], ["A polar bear is laying on top of white rolls."]], [["A bunch of carrots and vegetables in baskets."], ["A bunch of carrots and vegetables on display in baskets."]], [["A group of white teddy bears sitting next to each other."], ["Two white teddy bears sitting next to each other."]], [["A train is on the tracks under a bridge."], ["A train is on the tracks under a bridge."]], [["A white plate of food on a table."], ["A plate of food with meat and vegetables on it."]], [["A city street with a sign on the side of it."], ["A city street with a sign on the side of it."]], [["A seagull flying over a beach next to the ocean."], ["A bird flying over the beach next to the ocean."]], [["A kitten laying on top of a laptop computer."], ["A small white kitten laying on top of a laptop."]], [["A group of people standing in front of a bus."], ["A group of people standing in a parking lot with buses."]], [["A bike sitting on the side of a train."], ["A bike on the side of a yellow train."]], [["A man holding a sign in a kitchen."], ["A man holding a yellow clock in a kitchen."]], [["A black dog sitting in front of a mirror."], ["A black dog sitting in a bathroom with a mirror."]], [["A person flying a kite next to the ocean."], ["A person flying a kite next to the ocean."]], [["A person holding a cell phone in their hand."], ["A person holding a cell phone next to a bottle of wine."]], [["A row of bikes parked next to each other."], ["A group of bikes parked next to each other."]], [["Two elephants standing next to each other in a zoo."], ["An elephant standing next to two plates in a zoo."]], [["A man holding a vase of flowers on a wall."], ["A woman standing in a hotel room with a yellow table with flowers."]], [["A brown horse standing next to a barbed wire fence."], ["A brown horse standing in a field of grass."]], [["A red double decker bus with people on it."], ["A red double decker bus driving down a street."]], [["A motorcycle parked next to a tent in a field."], ["A motorcycle parked on top of a bed with an umbrella."]], [["A black stove top oven sitting in a kitchen."], ["A kitchen with an oven with a clock on the counter."]], [["A blender sitting on top of a counter."], ["A blender sitting on a table."]], [["A group of people flying kites in the air."], ["A group of people flying kites in the sky."]], [["A group of people sitting around a table eating food."], ["A group of people sitting around a table eating food."]], [["Two cars parked in a parking lot with surfboards on top of it."], ["A car with a surfboard parked in front of a car."]], [["A man standing next to a fire hydrant with water."], ["A man standing on top of a fire hydrant with smoke."]], [["A man flying a bunch of kites in the air."], ["A group of people holding kites in the street."]], [["A herd of cows grazing in a field."], ["A herd of cows grazing in a field."]], [["A bus parked on the side of a street."], ["A food truck parked next to a tree in front of a house."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A parking meter on the side of a street."], ["A parking meter on the side of a street."]], [["A woman eating a sandwich and a cup of coffee."], ["A woman brushing her teeth in front of a light."]], [["A horse grazing in the grass next to a house."], ["A horse standing in the yard of a house."]], [["A man standing on a snowboard on a snow covered slope."], ["A man standing on top of a mountain with a snowboard."]], [["A person riding a motorcycle on a track."], ["A person riding a motorcycle on a track."]], [["A double decker bus driving down a street."], ["A double decker bus parked on the side of a street."]], [["A man sitting on a motorcycle."], ["A man sitting on a motorcycle in a parking garage."]], [["A baseball player swinging a bat at a ball."], ["A baseball player swinging a bat at a ball."]], [["A man and a woman laying on a bed."], ["A man laying on top of a bed in a window."]], [["A group of pictures of food on a table."], ["A group of pictures of plates of food."]], [["Two people playing tennis on a tennis court."], ["A painting of two men playing tennis on a tennis court."]], [["A red double decker bus on a city street."], ["A red double decker bus driving down a city street."]], [["A man taking a picture of himself in a mirror."], ["A man taking a picture of himself in a mirror."]], [["A group of people playing with a cow on a beach."], ["A group of people walking on a beach with an elephant."]], [["A man in a costume standing on a trolley."], ["A person in a costume standing on a street."]], [["A woman holding a nintendo wii game controller."], ["Two women playing a video game with a wii."]], [["A group of construction workers standing next to a fire hydrant."], ["A group of construction workers standing next to a fire hydrant."]], [["A white toilet with two skateboards on top of it."], ["A white white white toilet with three lights on it."]], [["Two giraffes and a baby giraffe standing next to a building."], ["A group of giraffes standing in front of a building."]], [["A plate of food and a cup of coffee."], ["A plate of food and a cup of coffee on a table."]], [["A parking meter on the side of a street."], ["A row of motorcycles parked in front of a parking meter."]], [["A man doing a trick on a skateboard over an orange cone."], ["A man doing a trick on a skateboard over an orange cone."]], [["A group of people standing in a field flying kites."], ["A crowd of people flying kites in the sky."]], [["A man brushing his teeth in front of a mirror."], ["A woman taking a picture of herself in a mirror."]], [["A man standing on a street next to a pole."], ["A person holding a small dog holding a remote control."]], [["A living room with chairs and a table."], ["A room with chairs and a table with a phone."]], [["Two young men playing a video game with a wii."], ["Two men playing a video game with a wii."]], [["A group of people standing around a table with food."], ["A group of men standing around a table with food."]], [["A zebra standing next to a baby zebra."], ["A baby zebra standing on top of a field."]], [["A woman standing on a tennis court holding a ball."], ["A woman jumping in the air with a baseball bat."]], [["A cat sitting on a chair."], ["A cat standing on the back of the car."]], [["A blue bike parked on the side of a street."], ["A blue bike parked on the side of a street."]], [["A group of people sitting at a table."], ["A group of people sitting at a table in a room."]], [["A young boy holding a baseball bat."], ["A young boy holding a baseball bat and a helmet helmet."]], [["A young boy riding a skateboard in a park."], ["A young boy riding a skateboard on the street."]], [["A herd of giraffes running in a field."], ["A herd of giraffes running in a field."]], [["Two men in suits and ties standing on a street."], ["Two men in suits standing on the side of a street at night."]], [["A street sign with a person on it."], ["A sign with a clock with a picture on it."]], [["A man holding a tennis ball on a tennis court."], ["A man holding a tennis racket on a tennis court."]], [["A group of boats sitting in the water behind a fence."], ["A man looking at a fence with a plane in it."]], [["A man wearing a red hat talking on a cell phone."], ["A man talking on a cell phone in a restaurant."]], [["A person playing with a frisbee in a field."], ["A person in a field with a red frisbee."]], [["A teddy bear sitting on top of a red jacket."], ["A teddy bear sitting on a red pillow."]], [["A man cutting a cake in front of a table."], ["A man sitting in front of a birthday cake."]], [["A group of people walking in the rain with umbrellas."], ["Three people walking in the rain with umbrellas."]], [["Three people standing on skis in the snow."], ["Three people sitting on a ski lift."]], [["A person standing next to a pile of luggage."], ["A red fire hydrant sitting next to a red fire hydrant."]], [["A white truck driving down a street with street signs."], ["A street sign in the middle of a intersection with a traffic light."]], [["A man walking on the tracks next to a train."], ["A man walking next to a train on the tracks."]], [["A woman riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A banana split is sitting on top of a table."], ["A banana with whipped cream and a banana on it."]], [["A bedroom with a sink and a bed in it."], ["A camera and a mirror in a room."]], [["A wooden bench next to a truck on a street."], ["A white truck pulling a trailer with a bench."]], [["A desk with two computer monitors and a laptop."], ["A desk with a computer sitting on top of it."]], [["A man riding on the back of a brown horse."], ["A man riding an orange horse on a dirt road."]], [["A person riding a dirt bike on a dirt road."], ["A group of people riding a dirt bike on a dirt road."]], [["A man flying through the air while riding a snowboard."], ["A computer keyboard and a mouse on top of it."]], [["A pizza sitting on top of a kitchen counter."], ["A pizza sitting on top of a kitchen counter."]], [["A person with a backpack looking in a small refrigerator."], ["A woman looking in front of a refrigerator."]], [["A city street at night with cars and traffic lights."], ["A group of people standing in the street at night."]], [["A group of people playing a game of frisbee."], ["Two men playing a game of frisbee in a field."]], [["An open refrigerator with food in a table."], ["An open refrigerator with food in a kitchen."]], [["A kitchen with a stove and a refrigerator."], ["A kitchen with a stove and a refrigerator."]], [["Two cats sitting in front of a window."], ["Two cats sitting in a window sill with flowers."]], [["A statue of a clock on top of a street."], ["A statue of a man holding a clock with a ball."]], [["A television in a bathroom with two sinks."], ["A bathroom with a television in the mirror."]], [["A dog laying on the floor in a room."], ["A dog laying on the floor in front of books."]], [["A group of people standing in a field with a frisbee."], ["A group of people standing in the grass with frisbees."]], [["A black cat sitting next to a bottle of water."], ["Two bottles of water and a cat on a table."]], [["A group of people flying a kite on the beach."], ["A group of kites flying in the sky on the beach."]], [["A woman sitting in a chair holding an umbrella."], ["A woman sitting in a chair holding an umbrella."]], [["Two giraffes standing in the middle of a field."], ["Three pictures of a giraffe in a field."]], [["A desk with a laptop and a phone and a chair."], ["A chair with a phone and a laptop on it."]], [["A bedroom with a bed and a fireplace."], ["A bedroom with a bed and a fireplace."]], [["A small bird sitting on a tree branch."], ["A bird sitting on top of a tree branch."]], [["A bus with a picture on the side of a street."], ["A bus with a picture of a dog on the side of it."]], [["A zebra standing next to a tree in a field."], ["A zebra standing next to a tree in a field."]], [["A table with plates of pizza and a salad."], ["A person holding a slice of pizza and a bowl of salad."]], [["A man sleeping in a bed with a cat."], ["A young man sleeping in a bed with an alarm clock."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["Three zebras standing next to each other on a field."], ["Two zebras walking in the sand on a beach."]], [["A group of jets flying in formation in the sky."], ["A group of jets flying in formation in the sky."]], [["A bedroom with a laptop and a dresser."], ["A person standing next to a pair of shoes."]], [["A picture of a group of cupcakes on a table."], ["A person holding a group of cupcakes."]], [["A group of children feeding a giraffe at a zoo."], ["A young boy feeding a giraffe at a zoo."]], [["A group of people and animals in a field."], ["A group of people standing under a tree in a park."]], [["A little girl eating a banana."], ["A little girl holding a banana in her hand."]], [["A bride and groom shaking hands in a wedding."], ["A bride and groom cutting a wedding cake."]], [["A desk with a computer sitting on top of it."], ["A desk with a computer sitting on top of it."]], [["A man and a woman standing in front of a fruit stand."], ["A man and two girls standing in front of fruit stand."]], [["An airplane flying in the sky."], ["An airplane flying in a cloudy sky."]], [["A group of zebras grazing in a field."], ["A herd of zebras grazing in the grass."]], [["A small dog wearing a red bow tie sitting on steps."], ["A dog jumping in the air with a laptop."]], [["A young boy standing next to a box of apples."], ["A young boy holding a bunch of vegetables in a market."]], [["Two elephants standing next to each other in a field."], ["Two elephants standing next to each other in the dirt."]], [["A picture of people on a bathroom floor."], ["A bird flying in the air next to a urinal."]], [["A train is on the tracks in a field."], ["A train is sitting on the side of a building."]], [["A man and a woman sitting on a park bench."], ["A woman and a child sitting on a bench."]], [["A train is sitting on the tracks."], ["A train with a frisbee next to a sign."]], [["A tree with red apples on top of it."], ["A group of oranges hanging from a tree."]], [["A man standing on a tennis court holding a ball."], ["A man standing on a tennis court holding a ball."]], [["Two people sitting next to an airplane in the desert."], ["Three people standing in front of an airplane on the beach."]], [["A statue of a cow standing in front of a street."], ["A statue of a cow standing on a street."]], [["A kitchen with a stove and a table."], ["A camera sitting on top of a wooden room."]], [["A piece of cake and other pastries in a bakery."], ["A counter with a sandwich and a window."]], [["A dog in the side view mirror of a car."], ["A man taking a picture of a man in a rear view mirror of a motorcycle."]], [["A toy is sitting on a desk with a computer."], ["A statue of a man standing next to a computer keyboard."]], [["A pizza and a can of soda on a table."], ["A pizza sitting on top of a table with a can of soda."]], [["A desk with a laptop computer sitting on top of it."], ["A desk with a laptop computer sitting on top of it."]], [["A crowd of people standing on a sidewalk."], ["A group of people walking in front of a building with an umbrella."]], [["A woman sitting at a table with two slices of pizza."], ["A woman sitting at a table with two slices of pizza."]], [["A truck driving down a road with a pile of hay."], ["A truck driving down a street with a bunch of logs."]], [["A group of street signs on a pole."], ["Two street signs in a chair next to a chair."]], [["A group of surfboards sitting on top of a beach."], ["A group of chairs on the beach next to the ocean."]], [["A man jumping in the air on a tennis court."], ["A man standing on a tennis court with two tennis balls."]], [["A bathroom with a sink and a toilet in a mirror."], ["A bathroom with a sink and a toilet in a mirror."]], [["A group of chefs preparing food in a kitchen."], ["Two chefs preparing food in a kitchen."]], [["A group of people standing around a table with a cake."], ["A black and white photo of a group of people standing around a table with cupcakes."]], [["A woman riding a pink bike down a street."], ["A man riding a bike down a city street."]], [["A plate of food and a glass of wine on a table."], ["A plate of food and a glass of wine on a table."]], [["A white cat laying on an office chair."], ["A cat laying in the back of a car."]], [["A group of people standing in front of a bakery."], ["Two people standing in front of a counter with pastries and pastries."]], [["A group of people with umbrellas."], ["A group of red umbrellas in front of a building."]], [["Two boats and a tractor on a beach."], ["A painting of a tractor in front of a boat with boats."]], [["A refrigerator with a picture on the side of it."], ["A refrigerator with magnets on top of it."]], [["Two cups and a table with a table."], ["Three cups with nintendo wii game controllers in it."]], [["Two planes flying next to each other in the sky."], ["An airplane flying in the sky with a kite."]], [["A group of cars stopped at a traffic light."], ["A car parked on the side of a street."]], [["A person flying a kite in the water."], ["A person standing next to the water with orange frisbees."]], [["A bathroom with a sink and a tub."], ["A bathroom with a laptop and a bath tub and a shower curtain."]], [["Two people sitting in front of a blue umbrella."], ["Two women sitting in front of a large kite holding an umbrella and a large kite."]], [["A small plane parked on display at a show."], ["A fighter jet on display at a museum."]], [["A teddy bear sitting next to a table with a tennis racket."], ["Two women playing a video game on a wii."]], [["A group of people sitting at a table eating food."], ["A group of women sitting at a table with plates of food."]], [["A bunch of clocks on a wall in a room."], ["A bunch of clocks on a wall."]], [["A tray with a sandwich and fruit in it."], ["A plastic container with a phone and a sandwich and a phone."]], [["A cow and a calf standing in a field."], ["A cow and a calf standing in a field."]], [["A wooden bench sitting on the beach next to the ocean."], ["A wooden bench sitting on the beach next to the ocean."]]], "scores": {"meteor": [[0.7853703279064436, 0.4795698924731184], [0.47908863920099876, 0.32206632653061223], [0.7585268884703913, 0.6800326497296194], [0.4094799210006583, 0.32554847841472045], [0.5555555555555556, 0.27555555555555555], [0.46890927624872564, 0.45074722802506817], [0.3896604938271605, 0.48927263212977495], [0.5863023175371843, 0.5913134484563056], [0.6944444444444444, 0.4440665154950869], [0.5318681318681319, 0.2808302808302808], [0.46875, 0.4955555555555556], [0.8950617283950617, 0.36764705882352944], [0.3468406593406593, 0.28714107365792757], [0.5373493975903614, 0.18292682926829268], [0.7687074829931974, 0.8300000000000002], [0.3757575757575758, 0.43069584736251404], [0.8950617283950617, 0.5681818181818182], [0.6989795918367346, 0.5888888888888889], [0.616925669350309, 0.43314500941619577], [0.5645569620253165, 0.2818080357142857], [0.3506944444444444, 0.3468406593406593], [0.5373493975903614, 0.5373493975903614], [0.9054545454545455, 0.9054545454545455], [0.5251825500842539, 0.4320647177790035], [0.6861724281549355, 0.5495818399044207], [0.6310013717421126, 0.6310013717421126], [0.8918539325842695, 0.5625], [0.33929649758454106, 0.4485645933014354], [0.5681818181818182, 0.5318681318681319], [0.22471910112359547, 0.40879120879120884], [0.5160550458715595, 0.4429133858267717], [0.5681818181818182, 0.25555555555555554], [0.520408163265306, 0.4766949152542372], [0.6792413935271077, 0.6792413935271077], [0.6792413935271077, 0.6792413935271077], [0.5876795162509448, 0.5022321428571428], [0.7521527129370266, 0.4810495626822157], [0.9041027559546079, 0.9041027559546079], [0.6691919191919192, 0.27479091995221033], [0.537876167416119, 0.5796973961998594], [0.5616605616605616, 0.350076103500761], [0.4536585365853659, 0.4263888888888889], [0.6578144078144077, 0.25252525252525254], [0.8436213991769549, 0.443841872413301], [0.6545430672268908, 0.5783794999481273], [0.32206632653061223, 0.44158415841584164], [0.9086363636363638, 0.6465763875643715], [0.3835051546391753, 0.5162738496071829], [0.5160550458715595, 0.5666909620991254], [0.7789062500000001, 0.7789062500000001], [0.5111111111111111, 0.38490853658536583], [0.372, 0.4505050505050505], [0.618131868131868, 0.5575], [0.6782713085234094, 0.39118246687054015], [0.3647058823529412, 0.4505050505050505], [0.6388888888888888, 0.2883720930232559], [0.8017676767676769, 0.9995], [0.6233062330623306, 0.5439024390243904], [0.8819444444444444, 0.3546348314606741], [0.4000000000000001, 0.41333333333333333], [0.6657910689028086, 0.6250000000000001], [0.66167290886392, 0.21657250470809788], [0.8737244897959183, 0.6777108433734939], [0.39453125, 0.2504960317460318], [0.625, 0.21657250470809788], [0.45731707317073167, 0.45731707317073167], [0.5616605616605616, 0.21739130434782605], [0.30789825970548856, 0.30789825970548856], [0.40879120879120884, 0.40879120879120884], [0.565083176127594, 0.565083176127594], [0.46875, 0.3116531165311653], [0.8993827160493828, 0.8993827160493828], [0.625, 0.625], [0.4179775280898876, 0.654320987654321], [0.4505050505050505, 0.39453125], [0.9139118457300276, 0.8335382345709367], [0.6284569902727446, 0.782267115600449], [0.46875, 0.5902439024390245], [0.49010989010989015, 0.4179775280898876], [0.5796973961998594, 0.4849137931034482], [0.6410256410256411, 0.5747427175998604], [0.37763136750763293, 0.3279411764705883], [0.1648351648351648, 0.1648351648351648], [0.4101694915254237, 0.5033238366571701], [0.625, 0.7687074829931974], [0.4440665154950869, 0.4962243797195253], [0.5569306930693068, 0.7585268884703913], [0.5625, 0.5111111111111111], [0.5257009345794392, 0.582287961055982], [0.1875, 0.4536585365853659], [0.5260869565217392, 0.25813692480359146], [0.7687074829931974, 0.7687074829931974], [0.39453125, 0.38490853658536583], [0.23232323232323232, 0.23232323232323232], [0.5902439024390245, 0.5439024390243904], [0.6226379440665155, 0.6443520642201835], [0.7602601480152501, 0.47920792079207924], [0.4955555555555556, 0.4955555555555556], [0.5503634475597092, 0.6405895691609977], [0.8017676767676769, 0.5625], [0.4955555555555556, 0.4955555555555556], [0.5975308641975308, 0.44285714285714284], [0.9993141289437586, 0.8819444444444444], [0.7145928899082569, 0.5160550458715595], [0.5952065677966102, 0.2608471074380165], [0.446, 0.4505050505050505], [0.7687074829931974, 0.9799382716049383], [0.8211575489862951, 0.3255474452554745], [0.5506172839506173, 0.36831683168316837], [0.1875, 0.32763532763532766], [0.4732510288065843, 0.4732510288065843], [0.616925669350309, 0.616925669350309], [0.5694117647058823, 0.5137215528781793], [0.38110236220472443, 0.3876262626262626], [0.18292682926829268, 0.1234567901234568], [0.605, 0.605], [0.1851851851851852, 0.1764705882352941], [0.6962184873949581, 0.6962184873949581], [0.6310013717421126, 0.6310013717421126], [0.5698720166032515, 0.43314500941619577], [0.5111111111111111, 0.4505050505050505], [0.7913056930693071, 0.5667811679127096], [0.6, 0.6], [0.8918539325842695, 0.6114130434782608], [0.5563218390804598, 0.446], [0.30303030303030304, 0.30303030303030304], [0.6792413935271077, 0.5667811679127096], [0.5506172839506173, 0.29760000000000003], [0.7059558517284465, 0.6284097797534854], [0.15151515151515152, 0.15], [0.618131868131868, 0.618131868131868], [0.4634661835748792, 0.3126050420168068], [0.5452674897119341, 0.29224537037037035], [0.6532519549876025, 0.5679012345679012], [0.7309228039041704, 0.7309228039041704], [0.6918367346938775, 0.5111111111111111], [0.38027108433734946, 0.21978021978021975], [0.5202546296296297, 0.44375889890840053], [0.5747427175998604, 0.4726890756302521], [0.5773420479302832, 0.5773420479302832], [0.7789062500000001, 0.625], [0.5164292279411764, 0.211864406779661], [0.34128440366972473, 0.2735294117647059], [0.46499999999999997, 0.38490853658536583], [0.372, 0.4505050505050505], [0.5294873855053832, 0.6133120078740157], [0.32327586206896547, 0.6657318376068376], [0.4263888888888889, 0.5111111111111111], [0.5563218390804598, 0.16666666666666666], [0.8200597312095569, 0.8200597312095569], [0.6476468138275718, 0.7711943069306932], [0.5306603773584906, 0.4810495626822157], [0.3896604938271605, 0.45925925925925926], [0.8918539325842695, 0.8918539325842695], [0.6880733944954129, 0.6270926339285714], [0.3, 0.25], [0.4440366972477064, 0.4440366972477064], [0.2100840336134454, 0.2652310924369748], [0.4810495626822157, 0.625], [0.27777777777777773, 0.5506172839506173], [0.6918367346938775, 0.45510204081632655], [0.33075299085151305, 0.43069584736251404], [0.5160550458715595, 0.5257009345794392], [0.46875, 0.39952531645569617], [0.36351165980795613, 0.23232323232323232], [0.21978021978021975, 0.474468085106383], [0.8103975535168196, 0.582287961055982], [0.6222271517302573, 0.6222271517302573], [0.9995, 0.618131868131868], [0.256551724137931, 0.13986013986013984], [0.40879120879120884, 0.41333333333333333], [0.9993141289437586, 0.616925669350309], [0.7181571815718157, 0.6880733944954129], [0.7500000000000001, 0.6824665350010973], [0.2929133858267717, 0.1648351648351648], [0.25252525252525254, 0.25252525252525254], [0.37500000000000006, 0.41682242990654206], [0.5616605616605616, 0.3468406593406593], [0.39480452674897115, 0.49010989010989015], [0.46875, 0.46875], [0.3546348314606741, 0.3546348314606741], [0.5575, 0.7270233196159123], [0.6724489795918367, 0.5667811679127096], [0.4213483146067415, 0.25510204081632654], [0.36764705882352944, 0.412087912087912], [0.6284097797534854, 0.5625], [0.1834862385321101, 0.2293577981651376], [0.5724489795918367, 0.3331163194444444], [0.8301839254220206, 0.8301839254220206], [0.4505050505050505, 0.3795918367346939], [0.3960396039603961, 0.6091911764705883], [0.4179775280898876, 0.4179775280898876], [0.6320224719101123, 0.625], [0.5769944341372912, 0.6696428571428572], [0.7740169238427077, 0.7740169238427077], [0.6944444444444444, 0.4000000000000001], [0.5377777777777778, 0.40760869565217384], [0.8421440865502825, 0.8421440865502825], [0.8251217578434704, 0.45925925925925926], [0.6600900423728814, 0.6600900423728814], [0.5964109781843773, 0.2604166666666667], [0.4536585365853659, 0.39952531645569617], [0.6578144078144077, 0.5533333333333333], [0.4543245869776481, 0.5487060546875001], [0.7014492753623188, 0.6792413935271077], [0.3506944444444444, 0.35046728971962615], [0.6233062330623306, 0.6233062330623306], [0.9670781893004115, 0.7309228039041704], [0.32763532763532766, 0.2373417721518987], [0.7361111111111112, 0.864795918367347], [0.5555555555555555, 0.3506944444444444], [0.5888888888888889, 0.31250000000000006], [0.5318681318681319, 0.5318681318681319], [0.5257009345794392, 0.28956422018348627], [0.43684710351377026, 0.267478813559322], [0.6091911764705883, 0.6095107453132146], [0.4227272727272727, 0.3506944444444444], [0.3188131313131313, 0.39453125], [0.47959183673469385, 0.47959183673469385], [0.45731707317073167, 0.19801980198019806], [0.4295051353874883, 0.5747427175998604], [0.34766355140186916, 0.21842355175688513], [0.37796610169491524, 0.17241379310344826], [0.4641544117647058, 0.3746698943661972], [0.3177966101694915, 0.34843750000000007], [0.7500000000000001, 0.6162076481077867], [0.8861997310842195, 0.8861997310842195], [0.5011235955056179, 0.39574468085106385], [0.8466372282608694, 0.8466372282608694], [0.3331163194444444, 0.36831683168316837], [0.3872, 0.2808302808302808], [0.5160550458715595, 0.21739130434782605], [0.5164292279411764, 0.21475256769374415], [0.6250000000000001, 0.6250000000000001], [0.9041027559546079, 0.6171248568155785], [0.8152173913043477, 0.8182989690721649], [0.4732510288065843, 0.49811035525321234], [0.5612244897959183, 0.5612244897959183], [0.5739795918367346, 0.48888888888888893], [0.4440366972477064, 0.5305305305305306], [0.12820512820512822, 0.25555555555555554], [0.5575, 0.2630208333333333], [0.6036745406824147, 0.34766355140186916], [0.19132653061224492, 0.1234567901234568], [0.618131868131868, 0.3506944444444444], [0.4464285714285715, 0.15873015873015875], [0.46875, 0.35118110236220473], [0.3599374021909233, 0.45634920634920634], [0.5377777777777778, 0.3835051546391753], [0.1111111111111111, 0.16853932584269662], [0.7636335784313727, 0.15151515151515152], [0.5698720166032515, 0.9163223140495868], [0.2735294117647059, 0.39952531645569617], [0.3506944444444444, 0.21505376344086022], [0.41333333333333333, 0.41333333333333333], [0.7309228039041704, 0.7309228039041704]]}}