{"seed": 42, "num_examples": 512, "batch_size": 1, "captions": [[["An elephant is in the back of a truck."], ["A statue of a man standing in the back of a truck."]], [["A man doing a trick on a skateboard in the air."], ["A man doing a trick on a skateboard in the air."]], [["A man standing on a tennis court holding a racket."], ["A man standing on a tennis court with a racket."]], [["A man standing in a box with a pizza in it."], ["A man sitting in a kitchen with a box of pizza."]], [["A pair of shoes and a table with a pair of scissors."], ["A person sitting at a desk with a pair of shoes."]], [["A table with glasses of wine and bread on it."], ["Two glasses of wine and bread on a table."]], [["A living room with a couch and a table."], ["A living room with a table and a couch."]], [["A man sitting at a table with a laptop computer."], ["A man sitting at a table in a train station."]], [["A desk with two computer monitors and a keyboard."], ["A computer with headphones sitting in front of a table."]], [["Two elephants and a baby elephant standing in a zoo."], ["An elephant and a rainbow in the background."]], [["A bathroom with a toilet with a table."], ["A bathroom with a toilet with a colorful seat."]], [["An airplane sitting on top of an airport runway."], ["An airplane sitting on top of an airport runway."]], [["A group of people riding a bike down a street."], ["Two men riding on a motorcycle down a street."]], [["Two giraffes and a baby giraffe standing next to a building."], ["A giraffe and a baby giraffe standing in front of a building."]], [["A woman sitting on a toilet on a street."], ["A woman sitting on a toilet in the water."]], [["A large clock on the side of a wall."], ["A clock on the side of a building."]], [["A man sitting on a beach next to a surfboard."], ["A young boy laying on a beach with a surfboard."]], [["An orange and white cat laying on the hood of a car."], ["An orange and white cat laying on the hood of a car."]], [["A bride and groom standing next to a wedding cake."], ["A group of people standing in front of a cake with christmas lights."]], [["A large dog sleeping on a bed."], ["A cat sleeping on a group of books."]], [["A baby laying in a bed with a blanket."], ["A young man laying in bed with a blanket."]], [["A train is sitting on the tracks at a train station."], ["A train is on the tracks in a train station."]], [["A stack of pancakes sitting on a plate on a table."], ["A stack of pancakes sitting on a plate."]], [["A pair of scissors sitting on top of a piece of paper."], ["A pair of scissors sitting on top of a table."]], [["A book shelf with a bunch of books."], ["A book shelf with a bunch of books."]], [["Two birds sitting on top of a tree."], ["An owl sitting on top of a tree branch."]], [["A woman sitting at a table eating food."], ["A woman sitting at a table looking at her cell phone."]], [["A man standing in the grass with a frisbee."], ["A man standing next to a dog with a tennis racket."]], [["A parking meter sitting on the side of a street."], ["A parking meter sitting next to a street."]], [["A phone sitting on top of a desk with a banana."], ["A banana sitting on a desk next to a phone and a phone."]], [["A group of people dressed in costumes walking down a street."], ["A group of people standing in front of a building talking on a cell phone."]], [["A white bouquet of white flowers on a table."], ["A table with glasses and a vase of flowers."]], [["A woman standing in a kitchen with a pot of food."], ["A woman standing in a kitchen with a pot of food."]], [["A clock tower in the middle of a city street."], ["A building with graffiti on the top of it."]], [["Two tennis players shaking hands on a tennis court."], ["Two tennis players shaking hands on a tennis court."]], [["A living room with a couch and a table."], ["A living room with a couch and a table."]], [["A man sitting on a bench in front of a church."], ["A church with a clock tower on top of it."]], [["A man riding on the back of an elephant."], ["A man riding on the back of an elephant."]], [["A stop sign with writing on it."], ["A stop sign with writing on it."]], [["A white bathroom with a bath tub and a sink."], ["A bathroom with a sink and a tub."]], [["A large airplane sitting on top of an airport runway."], ["An airplane sitting on top of an airport runway."]], [["A blue bus parked on the side of a street."], ["A bus parked on the side of a street."]], [["Two black and white cats laying next to each other."], ["A black and white cat playing with a toy."]], [["A pizza sitting on top of a white plate on a table."], ["A pizza on a white plate next to a glass of beer."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A plate with a sandwich and french fries."], ["A plate with a sandwich and french fries and a salad."]], [["A red and white bus parked in front of a building."], ["A bus parked on the side of a street."]], [["A train is sitting on the tracks."], ["A train is sitting on the tracks in a field."]], [["A black and white photo of a group of people."], ["A group of people standing around an elephant."]], [["A man standing on a tennis court holding a racket."], ["A man standing on a tennis court holding a racket."]], [["A kitchen with a stove top oven and a bread."], ["A group of bread and a toaster oven."]], [["A traffic light over a city street with a building."], ["An intersection with a traffic light and a street."]], [["A banana sitting on a plate next to a table."], ["A half eaten banana sitting on a plate."]], [["A young man wearing a white apron holding a large pair of scissors."], ["A man wearing a white coat and glasses standing in a room."]], [["A person standing on skis on a snow covered slope."], ["A man standing on top of a snow covered mountain."]], [["A kitchen with a table and a refrigerator."], ["A kitchen with a table and a refrigerator."]], [["A man in the air on a snowboard."], ["A person in a body of water on skis in a pool."]], [["A pizza sitting on top of a plate on a table."], ["A pizza on a plate on a table with a glass of wine."]], [["A cat playing with its reflection in a mirror."], ["A cat looking at a mirror."]], [["A vase with red flowers in it on a counter."], ["Three flowers in a vase in front of a oven."]], [["A group of people standing around a table with a cake."], ["A group of girls standing around a table with food on it."]], [["A woman standing next to an elderly man."], ["A man and a woman standing next to an elderly man."]], [["A clock on a pole on a city street."], ["A clock on the side of a building."]], [["A bathroom with a sink and a window."], ["A bathroom with a toilet and a trash can."]], [["A man with a dog sitting on the stairs."], ["A man with a stuffed animal on his head."]], [["Three teddy bears sitting next to each other."], ["A group of teddy bears sitting on a table."]], [["A young man riding a skateboard on a skate park."], ["A young man doing a trick in the air on a skateboard."]], [["A stuffed teddy bear wearing a mask sitting on a bed."], ["A stuffed animal with a mask on a bed."]], [["A group of people riding skis on a ski lift."], ["A group of people on a ski lift."]], [["A black bird sitting on a chair next to a woman."], ["A man and a woman looking at a pigeon."]], [["A dining room with a table and chairs."], ["A dining room with a table and chairs."]], [["A young boy swinging a baseball bat at a ball."], ["A baseball player swinging a bat at a ball."]], [["A city street at night with traffic lights."], ["A city street at night with traffic lights."]], [["A woman standing on skis in the snow."], ["A woman on skis in the snow."]], [["A bedroom with a bed with pillows on it."], ["A wooden bed with a sign on top of it."]], [["A man doing a trick on a skateboard at a skate park."], ["A man doing a trick on a skateboard at a skate park."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard."]], [["A group of horses grazing in a field."], ["A black and white photo of cows grazing in a field."]], [["A large swimming pool with a table in it."], ["A swimming pool with a person in it."]], [["A group of people standing on an airplane."], ["A group of people standing on an airplane."]], [["A black cat sitting in front of a door."], ["A black cat sitting in front of a door."]], [["A woman standing on a tennis court with a ball."], ["A man standing on a tennis ball on a court."]], [["A man standing on a tennis court with a ball."], ["A man standing on a tennis court holding a racket."]], [["A large bed with red pillows on top of it."], ["A large bed with red pillows on top of it."]], [["An airplane flying over a tree in the sky."], ["An airplane flying in the sky over trees."]], [["A truck and orange cones on a city street."], ["A group of orange cones in front of a truck."]], [["A hot dog and a bottle of beer."], ["A hot dog sitting next to a bottle of soda on a table."]], [["A red stop sign on the side of a street."], ["A stop sign water from the side of a water."]], [["A polar bear laying on the ground."], ["A polar bear sitting in the middle of a living room."]], [["A bunch of carrots and vegetables on a display."], ["A bunch of baskets of carrots and vegetables in a store."]], [["A group of teddy bears sitting on a table."], ["A large pile of teddy bears sitting next to each other."]], [["A train is on the tracks under a bridge."], ["A train is on the tracks."]], [["A white plate of food on a table."], ["A plate with a hamburger and a pickle on a table."]], [["A street with a building and a sign on it."], ["A city street with buildings and a large window."]], [["A seagull flying over a beach next to the ocean."], ["A bird flying over a beach next to the ocean."]], [["A cat laying on top of a laptop computer."], ["A kitten laying on top of a laptop computer."]], [["A group of people standing in front of a bus."], ["A group of people standing in front of buses."]], [["A bike on the side of a train."], ["A train with a bike on the side of it."]], [["A man holding a sign in a kitchen."], ["A man holding a sign in a kitchen next to a refrigerator."]], [["A black dog sitting in front of a mirror."], ["A black dog sitting in front of a mirror."]], [["A person flying a kite on the beach."], ["A man flying a kite on the beach."]], [["A person holding a cell phone in their hand."], ["A person holding a cell phone in their hand."]], [["A group of bikes parked next to each other."], ["A row of bikes parked next to each other."]], [["Two elephants standing next to each other in a zoo."], ["A herd of elephants standing in front of a building."]], [["A man holding a vase of flowers on a wall."], ["A man painting a wall in a room with flowers."]], [["A horse standing next to a fence in a field."], ["A horse standing in the grass behind a fence."]], [["A red double decker bus with people on it."], ["A double decker bus with people on top of it."]], [["A motorcycle parked in the grass next to a tent."], ["A motorcycle parked in the grass next to a tent."]], [["A black stove top oven sitting in a kitchen."], ["A black stove top oven sitting in a kitchen."]], [["A blender sitting on top of a counter."], ["A blender sitting on top of a table."]], [["A group of people flying kites in a field."], ["A group of people flying kites in the air."]], [["A group of people sitting around a table eating food."], ["A group of people sitting at a table eating food."]], [["A small car with two cars parked in a parking lot."], ["Two cars parked on the beach next to the ocean."]], [["A man standing next to a fire hydrant with smoke."], ["A fire hydrant with a bunch of fire hydrant."]], [["A person flying a bunch of kites in the air."], ["A large group of people flying kites in the air."]], [["A herd of cows grazing in a field."], ["A herd of cows in a field with a mountain in the background."]], [["A bus parked on the side of a street."], ["A bus parked on the side of a street."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A parking meter on the side of a street."], ["A pair of scissors sitting on top of a table."]], [["A woman eating a sandwich and a drink."], ["A woman eating a sandwich and a glass of water."]], [["A horse grazing in the grass next to a house."], ["A brown horse grazing in the grass next to a building."]], [["A man standing on a snowboard on a snow covered slope."], ["A man standing on a snowboard on a snow covered slope."]], [["A person riding a motorcycle on a track."], ["A person riding a motorcycle on a race track."]], [["A double decker bus driving down a street."], ["A double decker bus driving down a street."]], [["A man sitting on a motorcycle."], ["A man sitting next to two motorcycles parked next to a sign."]], [["A baseball player swinging a bat at a ball."], ["A baseball player holding a bat at a game."]], [["A man and a woman laying on a bed."], ["A man and a woman sitting on a bed."]], [["A group of pictures of a table with food."], ["A group of pictures of food on a tray."]], [["Two people playing tennis on a tennis court."], ["A man and a woman playing tennis on a tennis court."]], [["A red double decker bus on a city street."], ["A city street with a double decker bus."]], [["A man taking a picture of himself with his cell phone."], ["A man taking a picture of himself in a mirror."]], [["A group of people playing with a cow on the beach."], ["A group of men standing on the beach with elephants."]], [["A man in a costume standing on a trolley."], ["A statue of a person in the side of a bus."]], [["A woman holding a nintendo wii game controller."], ["Two women playing a video game with a wii controller."]], [["A group of construction workers standing next to a fire hydrant."], ["Two construction workers standing next to a yellow fire hydrant."]], [["A white toilet with three skateboards on top of it."], ["A white toilet with two white buttons on top of it."]], [["Two giraffes and a baby giraffe standing next to a building."], ["A giraffe and a baby giraffe standing next to a building."]], [["A plate of food and a cup of coffee."], ["A pizza and a cup of coffee on a table."]], [["A parking meter sitting on the side of a street."], ["A parking meter sitting in front of a parking lot."]], [["A man doing a trick on a skateboard over an orange cone."], ["A man doing a trick on a skateboard over an orange cone."]], [["A group of people standing in a field flying kites."], ["A group of people flying kites in the sky."]], [["A man brushing his teeth in front of a mirror."], ["A man playing a video game with a wii."]], [["A man painting a person on a street."], ["A man painting a fire hydrant on a street."]], [["A living room with chairs and a table."], ["A living room with chairs and a table."]], [["Two young men playing a video game with a wii."], ["Two young men playing a video game with a wii."]], [["A group of people standing around a table."], ["A group of people standing around a table with food."]], [["A zebra standing on top of a dirt field."], ["A baby zebra standing next to an adult zebra."]], [["A woman standing on a tennis court holding a ball."], ["A man jumping in the air on a tennis court."]], [["A cat sitting on top of a chair."], ["A cat sitting on a chair with a table."]], [["A blue bike parked on the side of a street."], ["A blue bike parked next to a bike parked on a street."]], [["A group of people sitting at a table."], ["A group of people sitting at a table."]], [["A young boy holding a baseball bat."], ["A young boy holding a baseball bat."]], [["A young boy riding a skateboard in a street."], ["A young man riding a skateboard in a park."]], [["A herd of giraffes running in a field."], ["A herd of giraffes walking in a field."]], [["Two men in suits and ties standing on a street."], ["Two men in ties standing on the steps."]], [["A street sign with a person on it."], ["A street sign with a person on it."]], [["A man holding a tennis ball on a tennis court."], ["A man standing on a tennis court holding a ball."]], [["A group of boats sitting in the water behind a fence."], ["A group of boats parked next to a fence."]], [["A man wearing a red hat talking on a cell phone."], ["A woman smoking a cigarette in front of a restaurant."]], [["A woman playing with a frisbee in a field."], ["A man with a backpack and an orange frisbee in a field."]], [["A teddy bear sitting on top of a red jacket."], ["A bunch of teddy bears sitting on a red pillow."]], [["A man sitting in front of a cake."], ["A man sitting at a table with a cake."]], [["A group of people walking in the rain with umbrellas."], ["A person with an umbrella in the water."]], [["Three people standing on skis in the snow."], ["Two people riding skis down a snow covered slope."]], [["A person standing next to a pile of luggage."], ["A group of luggage sitting next to each other."]], [["A white truck driving down a street with street signs."], ["A white truck driving down a street with street signs."]], [["A man standing on the tracks next to a train."], ["A woman standing on the tracks next to a train."]], [["A man riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard in the ocean."]], [["A banana split is sitting on top of a table."], ["A banana sitting in the water with a knife."]], [["A bedroom with a sink and a bed in it."], ["A living room with a bed and a table."]], [["A wooden bench next to a truck on a street."], ["A man standing on the back of a truck."]], [["A desk with two computer monitors and a laptop."], ["A desk with a laptop and two computer on it."]], [["A man riding on the back of a brown horse."], ["A man riding on the back of a brown horse."]], [["A person riding a dirt bike on a dirt road."], ["A black and white photo of a person riding a bike."]], [["A man flying through the air while riding a snowboard."], ["A person skiing down a snow covered slope."]], [["A pizza sitting on top of a kitchen counter."], ["A pizza sitting on top of a stove."]], [["A person with a backpack looking in a small refrigerator."], ["A woman playing a video game with a wii."]], [["A city street at night with cars and traffic lights."], ["A city street at night with cars and traffic lights."]], [["A group of people playing a game of frisbee."], ["A group of men playing frisbee with a dog."]], [["An open refrigerator with food in a table."], ["An open refrigerator with food in a kitchen."]], [["A kitchen with a stove and a refrigerator."], ["A kitchen with a stove and a refrigerator."]], [["Two cats sitting in front of a window."], ["Two cats sitting in a window sill in a room."]], [["A statue of a clock on top of a street."], ["A statue of a clock tower with a ball."]], [["A television in a bathroom with two sinks."], ["A television in a bathroom with sinks and a television."]], [["A room with a desk and a dog laying on the floor."], ["A woman laying on the floor in a room with a desk."]], [["A group of people standing in a field with a frisbee."], ["A group of people standing in the snow with a frisbee."]], [["A black and white cat sitting next to a bottle of water."], ["A cat is sitting next to a water bottle."]], [["A kite flying in the sky on the beach."], ["A group of people flying kites on the beach."]], [["A woman sitting in a chair holding an umbrella."], ["A woman sitting in a chair with an umbrella."]], [["Two giraffes standing in the middle of a field."], ["Two giraffes standing in a field of grass."]], [["A desk with a laptop computer sitting on top of it."], ["A chair with a computer sitting in a desk chair."]], [["A bedroom with a bed and a fireplace."], ["A bedroom with a bed and a fireplace."]], [["A small bird sitting on a tree branch."], ["A group of birds sitting on top of a tree branch."]], [["A bus with a picture on the side of a street."], ["A bus parked on the side of a city street."]], [["A zebra standing in a field next to a tree."], ["A zebra standing next to a tree in a field."]], [["A person sitting at a table with plates of pizza and salad."], ["Plates of food on a table with a glass of beer."]], [["A man sleeping in a bed with a cat."], ["A black dog laying next to an orange frisbee."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A group of zebras standing in the dirt."], ["Two zebras walking in the grass in a field."]], [["A group of jets flying in formation in the sky."], ["A group of planes flying in formation in the sky."]], [["A room with a bed and luggage on it."], ["Three pieces of luggage sitting on the floor in an airport."]], [["A person holding a group of cupcakes on a table."], ["A group of cupcakes on a cell phone."]], [["A group of children feeding a giraffe at a zoo."], ["A group of people standing in a display case."]], [["A group of people and animals in a field."], ["A group of people and animals on a road."]], [["A little girl eating a banana."], ["A little girl eating a banana."]], [["A bride and groom standing in front of a wedding."], ["A bride and groom cutting a wedding cake."]], [["A desk with a computer monitor and a keyboard."], ["A desk with a television and a phone on it."]], [["A man and a woman standing in front of fruit."], ["A man standing in front of a fruit stand."]], [["An airplane flying in the sky."], ["An airplane flying in the sky."]], [["A group of zebras grazing in a field."], ["A herd of zebras grazing in a field."]], [["A small dog wearing a red bow tie sitting on steps."], ["A dog standing next to a pillow with a red frisbee."]], [["A baby standing next to a box of apples."], ["A baby sitting on top of a bunch of bananas."]], [["Two elephants standing next to each other in a field."], ["A baby elephant standing next to an adult elephant."]], [["A picture of a group of people on a bathroom floor."], ["A picture of a man on the floor in a bathroom."]], [["A train is on the tracks in a field."], ["A train is sitting on the tracks."]], [["Two people and a child sitting on a bench."], ["A man and a woman sitting on a bench."]], [["A train is on the tracks in the snow."], ["A room with a group of buses on the tracks."]], [["A tree with red apples on top of it."], ["An apple tree in a field with red apples."]], [["A man standing on a tennis court holding a ball."], ["A man standing on a tennis court holding a racket."]], [["A group of people standing next to an airplane."], ["A group of people standing around an airplane in the sand."]], [["A statue of a cow standing in a street."], ["A statue of a cow in front of a street."]], [["A kitchen with a stove and a pot on the floor."], ["A living room with a group of cell phones."]], [["A cake and pastries on a table in a restaurant."], ["A display case with a bunch of cakes and pastries."]], [["A rear view mirror of a car with a man in it."], ["A rear view mirror with a pair of scissors in it."]], [["A toy is sitting next to a desk with a computer."], ["A toy is sitting next to a computer keyboard."]], [["A pizza sitting next to a can of soda."], ["A pizza sitting next to a can of soda and a pizza."]], [["A desk with a laptop computer sitting on top of it."], ["A desk with a laptop computer sitting on top of it."]], [["A crowd of people standing on a street with a traffic light."], ["A person holding a large pair of scissors."]], [["A woman sitting at a table with two slices of pizza."], ["A woman sitting at a table with two plates of pizza."]], [["A truck driving down a road with hay."], ["A truck driving down a road with hay."]], [["A group of street signs on a pole."], ["A dog looking out of a window at two street signs."]], [["A group of surfboards sitting on top of a beach."], ["A group of surfboards sitting on the beach."]], [["A man jumping in the air on a tennis court."], ["A man jumping in the air on a tennis court."]], [["A bathroom with a sink and a toilet."], ["A bathroom with a sink and a mirror."]], [["A man preparing food in a kitchen."], ["A chef preparing food in a restaurant kitchen."]], [["A group of people standing around a cake."], ["A group of people standing around with dogs."]], [["A woman riding a pink bike down a street."], ["A woman riding a bike down a city street."]], [["A plate of food and a glass of wine on a table."], ["A plate of food on a table with a glass of wine."]], [["A white cat laying on an office chair."], ["A white cat laying on top of an office chair."]], [["Two people standing in front of a bakery."], ["Two people standing in front of a bakery with donuts and donuts."]], [["A group of people with umbrellas."], ["A group of people with umbrellas."]], [["Two boats and a tractor on a beach."], ["A picture of a car with two planes on the beach."]], [["A refrigerator with a table in a room."], ["A refrigerator with the door open in front of a refrigerator."]], [["Two cups and a table with a table."], ["A cup of coffee sitting next to a plate with horses."]], [["An airplane flying in the sky with a large kite."], ["A plane flying in the sky."]], [["A group of cars stopped at a traffic light."], ["A group of cars parked on the side of a street with a building."]], [["A person flying a kite in the water."], ["A person standing in a lake flying a kite."]], [["A bathroom with a sink and a tub."], ["A bathroom with a sink and a shower door."]], [["Three people sitting in front of a tent with an umbrella."], ["Three men sitting in the grass with a child holding an umbrella."]], [["A small plane parked on display at a show."], ["A blue and white plane parked at a runway."]], [["A teddy bear sitting next to a man holding a tennis racket."], ["A teddy bear sitting on the floor holding a tennis racket."]], [["A group of people sitting at a table eating food."], ["A group of people sitting at a table with food."]], [["A clock on a wall with a mirror."], ["A clock on a wall with a table."]], [["A sandwich and food in a box."], ["A box of food with donuts in it."]], [["A cow and a calf standing in a field."], ["A cow and a baby calf standing in a field."]], [["A wooden bench sitting on the beach next to the ocean."], ["A bench sitting on the beach next to the ocean."]], [["A tall tower with a clock on the top of it."], ["A tower with a clock on the top of it."]], [["A black cat sitting in the seat of a car."], ["A car with a parked in the seat of a street."]], [["A group of cars are parked in a traffic light."], ["A group of cars and traffic lights on a city street."]], [["A group of people sitting at a table."], ["A group of people sitting at a table."]], [["A man in a skirt and tie holding a racket."], ["A man wearing a skirt and a tie holding a purse."]], [["A person riding a bike down a city street with cars."], ["Two trucks driving down a city street with a person on it."]], [["A group of zebras standing on the side of a dirt road."], ["A group of zebras standing in a field with trees."]], [["A man walking down a sidewalk with luggage in front of a building."], ["A group of fire hydrants in front of a building."]], [["A statue of a clock with two birds on top of it."], ["A statue of a clock with two birds on top of it."]], [["An airplane flying in the sky."], ["An airplane flying in the sky."]], [["A kitchen with a sink and a window."], ["A kitchen with a sink and a bed."]], [["A teddy bear and a stuffed animal sitting on a bench."], ["A teddy bear sitting on top of a wooden chair."]], [["A man and a woman standing next to a piece of paper."], ["A man and a woman reading a book."]], [["A man riding a motorcycle down a street."], ["A person riding a horse in the snow with cars."]], [["A plate with a sandwich and a bird on a table."], ["A plate of food and a bird on a table."]], [["A yellow and pink bus parked in a field."], ["A yellow and red bus parked in a parking lot."]], [["A man and a woman sitting at a table with pizza."], ["Two men sitting at a table with two pizzas."]], [["A group of cows laying in the hay in a barn."], ["A herd of cows in a barn."]], [["A young boy sitting at a table with a plate of food."], ["A young boy sitting at a table with a plate of food."]], [["Two people playing a video game on a wii."], ["Two men playing a video game on a wii."]], [["A group of people riding on horses in a field."], ["Two men in red uniforms on horses in front of a building."]], [["Two people standing on top of a display."], ["A picture of people standing in front of a display."]], [["Two giraffes standing in a field of grass."], ["Two giraffes standing in a field of grass."]], [["A baseball player holding a bat on a field."], ["A yellow picture of a baseball player holding a bat."]], [["A teddy bear sitting on the side of a tree."], ["A teddy bear sitting on the side of a parking meter."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A black and white photo of a plane on a street."]], [["A bathroom with a sink and a mirror."], ["A bathroom with a sink and a mirror."]], [["A baseball player holding a bat on a field."], ["A baseball player holding a bat on a field."]], [["A bunch of vegetables on a cutting board with a knife."], ["A bunch of vegetables on a cutting board with a knife."]], [["A group of people skiing on a snow covered mountain."], ["A group of people skiing down a snow covered mountain."]], [["A toilet in a bathroom with a green wall."], ["A white toilet in a bathroom with a door."]], [["A clock tower in the middle of a street."], ["A clock tower in the middle of a building."]], [["A clock in the middle of a field."], ["A clock in the middle of a field."]], [["A white toilet in a bathroom with a table."], ["A white toilet sitting on top of a glass table."]], [["Two computer monitors and a keyboard on a desk."], ["Two computer monitors and a keyboard on a desk."]], [["A person holding a sandwich in front of a table."], ["A person holding a sandwich in front of a table."]], [["A man riding a skateboard on a ramp."], ["A group of men riding skateboards at a skate park."]], [["A person holding a piece of food in front of a building."], ["A person holding a piece of food in front of a restaurant."]], [["A woman taking a picture of a dog in a car window."], ["A car window with a bunch of donuts in it."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A black and white photo of a plane on a street."]], [["A pair of scissors sitting in a box."], ["A pair of scissors in a box."]], [["A desk with three computers and a keyboard on it."], ["A desk with two computers and a computer on it."]], [["A man sitting in a hospital bed holding a plate of food."], ["A man sitting in a wheel chair holding a plate of food."]], [["A black and white cat sitting next to a laptop computer."], ["A cat sitting in front of a laptop computer."]], [["A man hitting a tennis ball with a racket."], ["A man swinging a tennis racket at a tennis ball."]], [["A blue sign on the side of a street."], ["A blue sign on the side of a street."]], [["A yellow and red train is on the tracks."], ["A train is on the tracks in the forest."]], [["A train is on a bridge over a city."], ["A bus driving down a city street with tall buildings."]], [["A group of cows standing in front of a church."], ["A group of cows standing in front of a church."]], [["Two seagulls standing on the beach next to the water."], ["Two seagulls standing on the beach next to the water."]], [["A man riding on the back of two elephants."], ["An elephant and two elephants in a field."]], [["A desk with a computer sitting on top of it."], ["A desk with a computer on top of it."]], [["A train is on the tracks next to a dirt road."], ["A train is sitting on the tracks next to a road."]], [["A black cat sitting on top of a television."], ["A cat sitting on a table in a living room."]], [["A computer keyboard and a mouse on a desk."], ["A computer keyboard and a mouse on a bed."]], [["Three people standing in front of a bakery."], ["Three women standing in front of a display of donuts."]], [["A yellow truck parked in a parking lot."], ["A yellow truck parked in a parking lot."]], [["A group of people standing in the snow."], ["A group of people standing next to a boat in the snow."]], [["A group of people skiing down a snow covered slope."], ["A group of people skiing down a snow covered slope."]], [["A baseball player holding a bat on a field."], ["A baseball player holding a bat on a field."]], [["A woman standing on a tennis court with a ball."], ["A woman standing on a tennis court with a ball."]], [["A man standing on the beach holding a surfboard."], ["A man standing on the beach holding a surfboard."]], [["A man holding a tennis racket on a court."], ["A man standing on a tennis court holding a racket."]], [["A group of people skiing down a snow covered slope."], ["A group of people riding skis down a snow covered slope."]], [["A group of people standing in the snow."], ["Two people standing in the snow next to a sign."]], [["A white plate of broccoli and meat on it."], ["A plate of broccoli and rice and a table."]], [["A person holding a sandwich and a drink."], ["A person holding a piece of food in their hand."]], [["A tray with a sandwich and a bowl of food."], ["A tray with plates of food and drinks on a table."]], [["A cat laying on top of a laptop computer."], ["A cat sitting on top of a laptop computer."]], [["A red fire hydrant in the middle of a forest."], ["A red fire hydrant in the middle of a forest."]], [["A kitchen with a stove and a refrigerator."], ["A kitchen with a white stove and a refrigerator."]], [["A group of people walking on a city street with a double decker bus."], ["A group of people walking on a city street with a double decker bus."]], [["A group of horses standing next to a field of hay."], ["A group of horses and a person on a road."]], [["A bird standing in the water in a field."], ["A bird standing in the water next to a body of water."]], [["A baseball player throwing a ball on a field."], ["A baseball player throwing a ball on a field."]], [["A man sitting at a table looking at his cell phone."], ["A man sitting at a table holding a cup of coffee."]], [["A bus driving down a city street with a building."], ["A bus driving down a city street with buildings."]], [["A woman standing in a kitchen preparing food."], ["A woman standing in a kitchen preparing food."]], [["A man doing a trick in the air on a skateboard."], ["A man flying a kite in the air over the water."]], [["A pizza sitting on top of a table in a restaurant."], ["A pizza sitting on top of a counter with people."]], [["A row of toilets in a bathroom with a window."], ["A row of toilets in a bathroom."]], [["A plate of food with broccoli and a table."], ["A bowl of food on a plate next to a sink."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A black and white photo of a plane on a street."]], [["A man walking a bike down a street."], ["A man walking a bike in front of an oven."]], [["A plate of food with rice and vegetables on a table."], ["A plate of food with rice and vegetables on a table."]], [["A small plane sitting on top of an airport runway."], ["An airplane sitting on top of an airport runway."]], [["A wooden bench sitting in the middle of a park."], ["A wooden bench sitting on the side of a sidewalk."]], [["A wooden table with plates of food on it."], ["A table with plates of food and flowers on it."]], [["A man standing on the beach with a surfboard."], ["A plane flying over a beach with people."]], [["A cat is on the wall of a room."], ["A cat is standing on the wall in a room."]], [["A man and a woman standing next to each other."], ["A man in a suit holding a laptop in front of a window."]], [["A dog wearing a helmet sitting next to a motorcycle."], ["A dog wearing a helmet sitting next to a motorcycle."]], [["A group of young people flying kites."], ["A group of people flying kites on a beach."]], [["A woman taking a picture of a man on a cell phone."], ["A woman taking a picture of herself in a mirror."]], [["Two street signs on a wooden pole."], ["A statue of a man sitting next to a street sign."]], [["A person doing a trick on a skateboard at a skate park."], ["A man doing a trick on a skateboard at a skate park."]], [["A group of people with luggage at an airport."], ["A group of people standing in an airport."]], [["A woman standing in front of a refrigerator."], ["A woman in a dress holding a glass of wine."]], [["A group of street signs in front of a tall building."], ["Two street signs on a pole in a city."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A man in a white shirt and tie."], ["A man in a tie eating a doughnut in his mouth."]], [["A blue suitcase sitting next to a wooden table."], ["A blue suitcase sitting on the floor next to a wooden bench."]], [["A piece of chocolate cake with a drink."], ["A man holding a glass of wine in a room."]], [["A plate of food on a table with a glass of wine."], ["A plate of food on a table with a glass of wine."]], [["A plate of food with meat and a salad."], ["A plate of chicken and salad with a fork."]], [["A group of trucks parked in a parking lot."], ["A large airplane parked in an airport with cars."]], [["A herd of elephants walking in a field."], ["A herd of elephants walking in a field."]], [["A broccoli plant growing in the middle of a field."], ["A green broccoli plant with green leaves in a field."]], [["Two teddy bears sitting next to each other."], ["Two teddy bears sitting next to each other."]], [["A group of people standing in a room."], ["A group of men standing in a room with a fire."]], [["A person riding a horse jumping over an obstacle."], ["A person riding a horse jumping over a jump."]], [["Two people riding in a horse drawn carriage."], ["A group of people riding horses in the water."]], [["A white sign in front of a brick building."], ["A sign on top of a building."]], [["A woman holding a tennis racket in front of a crowd."], ["A woman holding a tennis racket on a court."]], [["A blender with food in it on a counter."], ["A blender sitting on a counter with food."]], [["A cat laying on top of a suitcase."], ["A cat laying on top of a suitcase."]], [["A donut hanging from a christmas tree."], ["A doughnut hanging from a christmas tree in a forest."]], [["A kitchen with a stove and a refrigerator."], ["A kitchen with a stove and a refrigerator."]], [["Two oranges hanging from a tree in a field."], ["An orange hanging from a tree in a field."]], [["A man standing next to a bike on a street."], ["Two men standing next to a bike on a street."]], [["A group of people flying a kite in a field."], ["A woman holding a colorful kite in the grass."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["Two people in a boat on the beach."], ["Black and white photo of two boats in the ocean."]], [["A young child taking a picture of a cell phone."], ["A young boy holding a cell phone in front of a crowd."]], [["An airplane parked on the runway at an airport."], ["An airplane parked on the runway at an airport."]], [["A person riding skis down a snow covered slope."], ["A man riding skis down a snow covered slope."]], [["A group of people riding horses on the beach."], ["Two people riding horses in the ocean."]], [["A group of people sitting on a bench in a park."], ["A group of people sitting on a bench."]], [["A bowl of food with a fork on a table."], ["A salad in a bowl on a table with a fork."]], [["A man and a woman riding a skateboard on a ramp."], ["A man standing in front of an open fire hydrant in the dark."]], [["A baseball player throwing a ball on a field."], ["A baseball player throwing a ball on a field."]], [["Two elephants standing next to a tree in a field."], ["Two elephants standing next to a tree."]], [["A black refrigerator in a room with a table."], ["A black refrigerator in a room with a door."]], [["A pole with two signs on it on a street."], ["A group of street signs on the side of a road."]], [["A woman riding a motorcycle with a side car."], ["A woman riding in the back of an elephant car."]], [["A bunch of oranges in a glass bowl on a table."], ["A bowl of oranges on a table."]], [["A garden with plants in the middle of a building."], ["A bunch of plants in a garden."]], [["A man and a group of sheep in a field."], ["A group of sheep standing in front of a crowd."]], [["A cat looking at a statue of a bear."], ["A black cat looking out of a window of a car."]], [["A woman holding a baseball bat next to a table."], ["A group of people holding baseball bats."]], [["A group of zebras standing next to a fence."], ["A herd of zebras standing next to a fence."]], [["A polar bear standing next to a rock."], ["A polar bear standing next to a rock."]], [["A birthday cake and a car on a table."], ["A bag sitting on top of a table with a remote control."]], [["A man riding a skateboard at a skate park."], ["A man standing in front of a group of buses."]], [["A building with a clock on the top of it."], ["A group of black and white cats sitting on the back of a truck with a clock."]], [["A woman standing next to a brown horse."], ["A horse walking down a street with a group of people."]], [["A person standing on a skateboard on a ramp."], ["A person holding a skateboard on a street."]], [["A black bear standing on top of a tree."], ["A black bear is standing on top of a tree."]], [["A man wearing a santa hat holding a dog in front of a christmas tree."], ["A man sitting in front of a christmas tree with a dog."]], [["A kitchen with a stove and a refrigerator."], ["A kitchen with a microwave and a refrigerator."]], [["A person riding skis on a rail in the snow."], ["A man riding skis on a rail in the snow."]], [["A food truck parked in front of a building."], ["A large white truck parked on the side of a street."]], [["A basket of fruit sitting on a table."], ["A basket of fruit in a brown bag of fruit."]], [["A clock tower in the middle of a street."], ["A clock tower in the middle of a street with cars."]], [["A group of three women standing in front of a sign."], ["A group of women standing under a sign."]], [["A brown dog sitting in a yard next to a black and white dog."], ["A dog jumping in the air with a person."]], [["A pizza with meat and vegetables on top of a table."], ["A pizza with meat and vegetables on top of a table."]], [["A group of people standing in a store with bananas."], ["A group of people standing in a market with vegetables."]], [["A young boy standing in front of a television playing a video game."], ["A young boy playing a video game on a wii."]], [["A person riding a skateboard at a skate park."], ["A woman riding a skateboard in a skate park."]], [["Two people sitting next to each other eating pizza."], ["A group of people standing next to each other eating pizza."]], [["A white toilet in a bathroom with a window."], ["A white toilet in a bathroom with a window."]], [["A plate of food with chicken and potatoes."], ["A plate of food with chicken and carrots."]], [["An airplane flying in the sky."], ["An airplane flying over a street with a field."]], [["A woman laying in a bed in a room."], ["A woman laying in bed in a room."]], [["Two people playing a video game with a wii."], ["Three women standing in a kitchen."]], [["A group of street signs on a pole on a street."], ["Two street signs and a car on a street."]], [["A girl sitting at a table with a laptop computer."], ["A woman sitting at a table with two laptops."]], [["A dog standing on top of a skateboard."], ["A dog standing on a skateboard in a street."]], [["A bike parked in front of a red building."], ["A bike parked in front of a house."]], [["A plate with a piece of cake on a table."], ["A table with plates of food on it."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A black and white photo of people riding on a horse."], ["A person riding on the back of a horse."]], [["A white truck parked on the side of a street sign."], ["A white truck driving down a street sign."]], [["A large boat sitting next to a dock."], ["A black and white photo of a boat parked next to a dock."]], [["A person holding a cell phone in their hand."], ["A person holding a cell phone in their hand."]], [["A group of people playing tennis on a tennis court."], ["A group of people playing tennis on a tennis court."]], [["A bedroom with a bed and a television."], ["A room with a chair and a television in it."]], [["A group of zebras eating from a trough."], ["A group of zebras eating from a trough."]], [["A living room with a couch and a television."], ["A living room with a couch and a table."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A group of parking meters on the side of a street."], ["A man standing on a parking meter on a street."]], [["A man wearing a helmet riding a skateboard down a street."], ["A man riding a skateboard down a street."]], [["A person cutting a cake with a knife."], ["A person cutting a cake with a knife."]], [["A man sitting at a table with an umbrella."], ["A man sitting at a table with an umbrella."]], [["A train is on the tracks next to a river."], ["A train is sitting on the tracks next to a river."]], [["A traffic light on a city street with a building."], ["A traffic light on the side of a street."]], [["A young boy in the air with a tie."], ["Three young men standing in a room with ties."]], [["A man playing a video game in a living room."], ["A picture of a man in a mirror."]], [["A woman looking at her cell phone in a field."], ["A woman sitting with a piece of cake on a plate."]], [["A cat sitting next to a brick wall."], ["A cat sitting in a brick oven."]], [["A small bathroom with a toilet and a table."], ["A small bathroom with a toilet and a table."]], [["A person riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard in the ocean."]], [["A kitchen with a table and a sink."], ["A restaurant with tables and chairs in it."]], [["A little girl sitting in a bowl on a table."], ["A little girl eating out of a bowl."]], [["A group of ducks swimming in a body of water."], ["A flock of ducks swimming in a body of water."]], [["A man standing on the back of a truck."], ["A man standing on the back of a truck."]], [["Two motorcycles parked in the street with a group of people."], ["Two motorcycles parked next to each other in a street."]], [["A black and white cow standing next to a field."], ["A man standing next to a cow in a field."]], [["A group of people standing on a beach with boats."], ["A group of people standing on a beach with a plane."]], [["A motorcycle parked on the side of a road."], ["A motorcycle parked on the side of a road."]], [["A group of people in a red boat in the water."], ["A group of people in a small boat in the water."]], [["A herd of sheep standing in front of a building."], ["A herd of sheep walking down a city street."]], [["A suitcase sitting on the ground in the dirt."], ["A bag of vegetables in front of a glass of wine."]], [["A man riding a skateboard at a skate park."], ["A person doing a trick on a skateboard over a white bench."]], [["A man and a child on a snowboard down a snow covered slope."], ["A man standing on skis with a child on a snow covered slope."]], [["A cat and a dog looking out a window."], ["A dog looking at a dog looking at a window."]], [["A baseball player standing on the mound."], ["A baseball player standing on the mound."]], [["A young man riding on the back of a horse."], ["A young boy riding on the back of a horse."]], [["A wooden bed with a wooden headboard in a room."], ["A bedroom with a bed with noodles on it."]], [["A small bed with bottles of water on it."], ["A bed sitting on top of a wooden floor."]], [["A pizza is sitting in front of an oven."], ["A pizza in an oven."]], [["A yellow bird sitting on a tree branch."], ["A small yellow bird sitting on a tree branch."]], [["Two people standing in beds in a parking lot."], ["A man and a woman standing next to two beds."]], [["A man standing in front of a refrigerator."], ["A woman standing in front of a refrigerator."]], [["An elephant standing in front of a fence."], ["An elephant standing next to a fence in a zoo."]], [["A sink with dishes in it on a table."], ["A bathroom sink with a bunch of toothbrushes on it."]], [["Three hot dogs with toppings on top of a table."], ["Two hot dogs in buns and beans on a table."]], [["A group of birds sitting on top of a wooden roof."], ["Two people sitting on the ground with two birds."]], [["A bus driving in the rain on a street."], ["A bus driving down a street in the rain."]], [["Two men playing a game of soccer on a field."], ["Two young men playing a game of soccer."]], [["An airplane flying in the sky over a dirt road."], ["A large airplane flying over a dirt field."]], [["A black cat sitting in the grass."], ["A black cat sitting in the grass."]], [["A bathroom with a toilet and a bath tub."], ["A bathroom with a toilet and a bath tub."]], [["A laptop computer sitting on top of a wooden table."], ["A computer keyboard sitting on top of a desk."]], [["A group of people standing around a bench."], ["A group of people standing around a bench with a dog on it."]], [["A bunch of bread sitting on a plate next to a keyboard."], ["A person laying on a bed with a table."]], [["A cat standing in a bathroom with a toilet."], ["A cat sitting in front of a toilet."]], [["A person riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard in the ocean."]], [["A man holding a cell phone in front of a crowd."], ["A man with headphones and a dog next to a dog."]], [["A man standing under a sign in the grass."], ["A man standing under a sign in the park."]], [["A man doing a trick on a skateboard at a skate park."], ["A man doing a trick on a skateboard at a skate park."]], [["A woman walking a small white dog on a leash."], ["A man walking a small white dog down a sidewalk."]], [["A man riding a horse on a field next to the water."], ["Two people riding horses next to a body of water."]], [["A man riding a skateboard down a rail."], ["A man doing a trick on a skateboard over the stairs."]], [["A person holding a bowl of food."], ["Pictures of a pizza in a pan with a knife."]], [["A white plate with a sandwich on a table."], ["A plate with a sandwich and a salad and a laptop."]], [["Two hot dogs in a paper plate on a table."], ["A paper plate with a hot dog in a person holding their hand."]], [["A black horse standing in a field."], ["A black horse standing in the grass."]], [["A boat is sitting in the water next to a beach."], ["A large boat is sitting on the beach in the ocean."]], [["A bathroom with a sink and a mirror."], ["A bathroom with a sink and a mirror."]], [["An orange fire hydrant on the side of a street."], ["A red fire hydrant sitting on top of a street."]], [["A toilet with the seat up in a bathroom."], ["A toilet with the seat up sitting on a table."]], [["A group of people standing next to a group of signs."], ["A group of people standing next to umbrellas."]], [["A cat laying on top of a laptop computer."], ["A cat laying on top of a remote control."]], [["A man standing on a tennis court holding a racket."], ["A man standing on a tennis court holding a racket."]], [["A cat standing in front of a computer monitor."], ["A cat sitting next to a computer monitor."]], [["An airplane flying in the sky with a flag."], ["An airplane flying in the sky with an american flag."]], [["A group of stuffed teddy bears sitting on a table."], ["A group of stuffed teddy bears in a room."]], [["A bathroom with a toilet and a sink and a tub."], ["A bathroom with two sinks and a toilet."]], [["A street sign in front of a group of bikes."], ["A group of bikes parked next to a brick wall."]], [["A man riding a snowboard down a snow covered slope."], ["A man riding a snowboard down a snow covered slope."]], [["A large clock in the middle of a building."], ["A large clock in front of a building."]], [["A boat is sitting in the water next to a lake."], ["A painting of a horse drawn carriage on a bench."]], [["An orange train is on the tracks in a forest."], ["An orange train is on the tracks in a forest."]], [["A man doing a trick on a skateboard on a street."], ["A man doing a trick on a skateboard in the air."]]], "scores": {"meteor": [[0.7687074829931974, 0.535483870967742], [0.36831683168316837, 0.36831683168316837], [0.7585268884703913, 0.6974657995066158], [0.4094799210006583, 0.3297491039426523], [0.3475303164744159, 0.2303832116788321], [0.46890927624872564, 0.5876795162509448], [0.3896604938271605, 0.40990755276469565], [0.5863023175371843, 0.7485875706214691], [0.6944444444444444, 0.34128440366972473], [0.3468406593406593, 0.28714107365792757], [0.46875, 0.5975308641975308], [0.7060399917542773, 0.7060399917542773], [0.3468406593406593, 0.6360544217687074], [0.5373493975903614, 0.7555879494655005], [0.8017676767676769, 0.4737654320987654], [0.3757575757575758, 0.43509070294784574], [0.7500000000000001, 0.5111111111111111], [0.6852741096438575, 0.6852741096438575], [0.616925669350309, 0.13392857142857142], [0.5645569620253165, 0.46875], [0.3506944444444444, 0.4505050505050505], [0.48478260869565226, 0.49010989010989015], [0.9054545454545455, 0.8099489795918368], [0.4320647177790035, 0.5251825500842539], [0.6861724281549355, 0.6861724281549355], [0.6320224719101123, 0.6944444444444445], [0.8918539325842695, 0.6114130434782608], [0.33929649758454106, 0.44158415841584164], [0.5318681318681319, 0.7853703279064436], [0.40760869565217384, 0.4536052009456265], [0.5769944341372912, 0.3230218855218855], [0.15151515151515152, 0.5782312925170067], [0.520408163265306, 0.520408163265306], [0.6880733944954129, 0.21367521367521372], [0.6792413935271077, 0.6792413935271077], [0.5876795162509448, 0.5876795162509448], [0.7521527129370266, 0.34128440366972473], [0.9041027559546079, 0.9041027559546079], [0.6691919191919192, 0.6691919191919192], [0.537876167416119, 0.5076628352490421], [0.5616605616605616, 0.35493827160493824], [0.4536585365853659, 0.45925925925925926], [0.6578144078144077, 0.20202020202020204], [0.8436213991769549, 0.8099489795918368], [0.6545430672268908, 0.6545430672268908], [0.32206632653061223, 0.44158415841584164], [0.9086363636363638, 0.41296296296296303], [0.3835051546391753, 0.5724489795918367], [0.5160550458715595, 0.2388369678089304], [0.7789062500000001, 0.7789062500000001], [0.38490853658536583, 0.125], [0.5160550458715595, 0.5162738496071829], [0.618131868131868, 0.703125], [0.6004008746355685, 0.6058098915241772], [0.446, 0.446], [0.6388888888888888, 0.6388888888888888], [0.605, 0.19607843137254904], [0.8101794934841405, 0.7426470588235294], [0.8819444444444444, 0.4310344827586207], [0.40879120879120884, 0.21978021978021975], [0.6953898514851486, 0.5773420479302832], [0.66167290886392, 0.6657910689028086], [0.8629377676996723, 0.45510204081632655], [0.39453125, 0.2028218694885362], [0.4505050505050505, 0.37878787878787884], [0.46875, 0.3896604938271605], [0.5616605616605616, 0.6814868804664723], [0.30789825970548856, 0.1851851851851852], [0.40879120879120884, 0.4179775280898876], [0.565083176127594, 0.26976495726495725], [0.46875, 0.46875], [0.8993827160493828, 0.7052154195011338], [0.66167290886392, 0.66167290886392], [0.4179775280898876, 0.35967741935483877], [0.4505050505050505, 0.45731707317073167], [0.9139118457300276, 0.9139118457300276], [0.782267115600449, 0.6284569902727446], [0.46875, 0.5831325301204818], [0.625, 0.4179775280898876], [0.5796973961998594, 0.5796973961998594], [0.6410256410256411, 0.6410256410256411], [0.37763136750763293, 0.37763136750763293], [0.1648351648351648, 0.20000000000000004], [0.4101694915254237, 0.4101694915254237], [0.625, 0.8918539325842695], [0.4440665154950869, 0.40879120879120884], [0.5076628352490421, 0.7271538141387718], [0.5625, 0.45731707317073167], [0.4207547169811321, 0.5113636363636364], [0.5506172839506173, 0.24096385542168677], [0.7575757575757577, 0.40760869565217384], [0.7687074829931974, 0.4310344827586207], [0.39453125, 0.24752475247524755], [0.1834862385321101, 0.1851851851851852], [0.5902439024390245, 0.6859756097560975], [0.4732510288065843, 0.6226379440665155], [0.7602601480152501, 0.4955555555555556], [0.5011235955056179, 0.3468406593406593], [0.5503634475597092, 0.38413413413413416], [0.8017676767676769, 0.8017676767676769], [0.5011235955056179, 0.38448275862068976], [0.5975308641975308, 0.5975308641975308], [0.8819444444444444, 0.9993141289437586], [0.7145928899082569, 0.3468406593406593], [0.5952065677966102, 0.28956422018348627], [0.6724489795918367, 0.4505050505050505], [0.7687074829931974, 0.6918367346938775], [0.6981085116973618, 0.6981085116973618], [0.5506172839506173, 0.5506172839506173], [0.1875, 0.1875], [0.650318287037037, 0.4732510288065843], [0.616925669350309, 0.7282110091743119], [0.6777108433734939, 0.31562500000000004], [0.38110236220472443, 0.18518518518518517], [0.38490853658536583, 0.12195121951219512], [0.605, 0.7723408050419169], [0.1851851851851852, 0.1851851851851852], [0.6962184873949581, 0.6962184873949581], [0.6310013717421126, 0.13793103448275862], [0.5076628352490421, 0.5698720166032515], [0.5111111111111111, 0.42216721672167207], [0.7913056930693071, 0.7913056930693071], [0.6, 0.5574156746031746], [0.8918539325842695, 0.8918539325842695], [0.5563218390804598, 0.36764705882352944], [0.30303030303030304, 0.30303030303030304], [0.6792413935271077, 0.5948372615039282], [0.46296296296296297, 0.5506172839506173], [0.7059558517284465, 0.5569306930693068], [0.15151515151515152, 0.4523364485981308], [0.8030303030303031, 0.618131868131868], [0.6898846495119787, 0.49010989010989015], [0.5452674897119341, 0.18181818181818182], [0.6532519549876025, 0.5724489795918367], [0.7309228039041704, 0.484], [0.7789062500000001, 0.6657910689028086], [0.38027108433734946, 0.37128712871287134], [0.5202546296296297, 0.4024496937882765], [0.5698720166032515, 0.537876167416119], [0.5773420479302832, 0.5773420479302832], [0.7789062500000001, 0.625], [0.5164292279411764, 0.31794871794871804], [0.41682242990654206, 0.6405895691609977], [0.46499999999999997, 0.46499999999999997], [0.372, 0.372], [0.44999999999999996, 0.5294873855053832], [0.7650100242692836, 0.21842355175688513], [0.4263888888888889, 0.5724489795918367], [0.5011235955056179, 0.45925925925925926], [0.8200597312095569, 0.6696428571428572], [0.6476468138275718, 0.6476468138275718], [0.5306603773584906, 0.5306603773584906], [0.3896604938271605, 0.3188131313131313], [0.8918539325842695, 0.7773446457234581], [0.6880733944954129, 0.5257009345794392], [0.3, 0.3], [0.4440366972477064, 0.20000000000000004], [0.2100840336134454, 0.32051282051282054], [0.4810495626822157, 0.2485236220472441], [0.27777777777777773, 0.33938172043010756], [0.6918367346938775, 0.5111111111111111], [0.43509070294784574, 0.3757575757575758], [0.5160550458715595, 0.2949766355140187], [0.46875, 0.5533333333333333], [0.36351165980795613, 0.27263374485596703], [0.21978021978021975, 0.21978021978021975], [0.7145928899082569, 0.616925669350309], [0.6222271517302573, 0.8152173913043477], [0.9995, 0.41333333333333333], [0.256551724137931, 0.2191840277777778], [0.40879120879120884, 0.16666666666666666], [0.9993141289437586, 0.6974657995066158], [0.7181571815718157, 0.7181571815718157], [0.7500000000000001, 0.8399159663865547], [0.2929133858267717, 0.2525], [0.25252525252525254, 0.25510204081632654], [0.37500000000000006, 0.15151515151515152], [0.5616605616605616, 0.5616605616605616], [0.39480452674897115, 0.5208333333333333], [0.46875, 0.46875], [0.3546348314606741, 0.3546348314606741], [0.5575, 0.6233062330623306], [0.6724489795918367, 0.6792413935271077], [0.4213483146067415, 0.27472527472527475], [0.6881754609027336, 0.49145299145299143], [0.6284097797534854, 0.6284097797534854], [0.18018018018018017, 0.3506944444444444], [0.4056437389770724, 0.3444444444444445], [0.8301839254220206, 0.9041027559546079], [0.4505050505050505, 0.5739795918367346], [0.568544708029197, 0.3526410564225691], [0.4179775280898876, 0.4179775280898876], [0.6320224719101123, 0.5555555555555555], [0.5769944341372912, 0.485126253891387], [0.6859756097560975, 0.7740169238427077], [0.7150900900900901, 0.3876262626262626], [0.5377777777777778, 0.2839506172839506], [0.8421440865502825, 0.8421440865502825], [0.605, 0.5506172839506173], [0.6600900423728814, 0.7485875706214691], [0.43684710351377026, 0.3929455445544555], [0.38490853658536583, 0.39453125], [0.6578144078144077, 0.15151515151515152], [0.4543245869776481, 0.43684710351377026], [0.7014492753623188, 0.7014492753623188], [0.4440366972477064, 0.35046728971962615], [0.4737654320987654, 0.40879120879120884], [0.738954922628392, 0.8819444444444444], [0.32763532763532766, 0.32763532763532766], [0.7361111111111112, 0.6320224719101123], [0.5555555555555555, 0.3747899159663866], [0.6792413935271077, 0.13761467889908252], [0.5318681318681319, 0.2504960317460318], [0.47920792079207924, 0.5769944341372912], [0.43684710351377026, 0.20609318996415774], [0.4240362811791383, 0.5876795162509448], [0.2222222222222222, 0.3468406593406593], [0.3188131313131313, 0.3188131313131313], [0.47959183673469385, 0.47959183673469385], [0.4505050505050505, 0.36831683168316837], [0.5033238366571701, 0.43314500941619577], [0.3381818181818182, 0.17094017094017094], [0.2808302808302808, 0.37796610169491524], [0.41802832244008714, 0.36831683168316837], [0.34307065217391297, 0.41333333333333333], [0.5948372615039282, 0.5010893246187365], [0.8861997310842195, 0.8861997310842195], [0.544452519379845, 0.16853932584269662], [0.8466372282608694, 0.8466372282608694], [0.32206632653061223, 0.32206632653061223], [0.3872, 0.18564356435643567], [0.5160550458715595, 0.3546348314606741], [0.5164292279411764, 0.5164292279411764], [0.7853703279064436, 0.7853703279064436], [0.6071019473081329, 0.6861724281549355], [0.8918539325842695, 0.66167290886392], [0.4732510288065843, 0.49811035525321234], [0.5612244897959183, 0.5076058201058201], [0.5739795918367346, 0.7789062500000001], [0.370911214953271, 0.4360360360360361], [0.12820512820512822, 0.12820512820512822], [0.5575, 0.38027108433734946], [0.5011235955056179, 0.38027108433734946], [0.19132653061224492, 0.4518072289156627], [0.38490853658536583, 0.48076923076923084], [0.4464285714285715, 0.24966442953020132], [0.46875, 0.4056437389770724], [0.3599374021909233, 0.35493827160493824], [0.48478260869565226, 0.33938172043010756], [0.1111111111111111, 0.2839506172839506], [0.7636335784313727, 0.5569306930693068], [0.5698720166032515, 0.6600900423728814], [0.33283582089552244, 0.33283582089552244], [0.17045454545454547, 0.12], [0.41333333333333333, 0.36134651600753287], [0.7309228039041704, 0.7602601480152501], [0.6400966183574879, 0.647130647130647], [0.6724489795918367, 0.4043478260869566], [0.3468406593406593, 0.4043478260869566], [0.35046728971962615, 0.35046728971962615], [0.5625, 0.5667811679127096], [0.290625, 0.21739130434782605], [0.9280792420327304, 0.647130647130647], [0.3074380165289256, 0.2485236220472441], [0.41802832244008714, 0.41802832244008714], [0.5563218390804598, 0.5563218390804598], [0.6465763875643715, 0.6465763875643715], [0.7711943069306932, 0.5111111111111111], [0.5274612219056664, 0.4445422535211268], [0.864795918367347, 0.38490853658536583], [0.31250000000000006, 0.446], [0.7270233196159123, 0.5439024390243904], [0.541304347826087, 0.8819444444444444], [0.4518072289156627, 0.4746835443037974], [0.7017173423423423, 0.7017173423423423], [0.8880208333333333, 0.7687074829931974], [0.43314500941619577, 0.7458847736625513], [0.22030651340996166, 0.33633474576271183], [0.6225, 0.6225], [0.6376262626262627, 0.6918367346938775], [0.618131868131868, 0.5373493975903614], [0.2118288590604027, 0.21618150684931506], [0.6284569902727446, 0.6284569902727446], [0.6360544217687074, 0.6360544217687074], [0.4043478260869566, 0.4043478260869566], [0.6775541946145621, 0.7622047244094489], [0.4732510288065843, 0.4732510288065843], [0.8072916666666667, 0.8072916666666667], [0.32206632653061223, 0.32206632653061223], [0.7270233196159123, 0.25555555555555554], [0.6310013717421126, 0.6310013717421126], [0.5439024390243904, 0.5439024390243904], [0.6465763875643715, 0.39118246687054015], [0.9163223140495868, 0.9163223140495868], [0.46464646464646464, 0.2362204724409449], [0.5361402671755726, 0.5859375000000001], [0.5739795918367346, 0.5269186712485682], [0.6346938775510204, 0.6346938775510204], [0.6332138590203108, 0.6332138590203108], [0.6506642512077294, 0.3506944444444444], [0.7687074829931974, 0.2293577981651376], [0.6792413935271077, 0.6792413935271077], [0.29224537037037035, 0.39480452674897115], [0.625, 0.1648351648351648], [0.5888888888888889, 0.5888888888888889], [0.647130647130647, 0.647130647130647], [0.6148148148148148, 0.32206632653061223], [0.40879120879120884, 0.41333333333333333], [0.7080965909090909, 0.5769944341372912], [0.854119425547997, 0.5439024390243904], [0.5300453514739228, 0.5300453514739228], [0.5503634475597092, 0.5625], [0.8918539325842695, 0.8918539325842695], [0.7773446457234581, 0.7230634189159536], [0.35907859078590787, 0.35907859078590787], [0.7098765432098765, 0.7098765432098765], [0.7937500000000002, 0.7937500000000002], [0.8654513888888888, 0.8654513888888888], [0.4737654320987654, 0.6936813186813185], [0.45731707317073167, 0.5569306930693068], [0.6861724281549355, 0.37500000000000006], [0.5975308641975308, 0.41333333333333333], [0.5503634475597092, 0.5136986301369862], [0.551470588235294, 0.44158415841584164], [0.7212094907407407, 0.8287608596250572], [0.7789062500000001, 0.7789062500000001], [0.5076628352490421, 0.5424733996162567], [0.7934426229508196, 0.7934426229508196], [0.4481927710843373, 0.5447533344046279], [0.45925925925925926, 0.866013071895425], [0.5208333333333333, 0.5208333333333333], [0.5989583333333334, 0.6849868660335421], [0.6443520642201835, 0.5300453514739228], [0.9990234375, 0.9990234375], [0.4472257653061224, 0.19531250000000003], [0.9054545454545455, 0.582287961055982], [0.15, 0.12658227848101264], [0.4505050505050505, 0.36831683168316837], [0.6215431415929203, 0.6289424860853432], [0.7948022959183674, 0.446], [0.48478260869565226, 0.48478260869565226], [0.8211575489862951, 0.5542695473251028], [0.4361263736263736, 0.31562500000000004], [0.5452674897119341, 0.634712600636585], [0.3896604938271605, 0.2388369678089304], [0.45925925925925926, 0.38490853658536583], [0.8950617283950617, 0.22321428571428567], [0.8950617283950617, 0.8950617283950617], [0.32538659793814434, 0.46296296296296297], [0.6155365371955235, 0.647130647130647], [0.3639097744360902, 0.18653690186536898], [0.6904166666666668, 0.6904166666666668], [0.1851851851851852, 0.1293103448275862], [0.5215419501133786, 0.372], [0.7521527129370266, 0.43684710351377026], [0.8030303030303031, 0.8030303030303031], [0.755560651226783, 0.3876262626262626], [0.5377777777777778, 0.5204301075268818], [0.2525, 0.28956422018348627], [0.3153153153153153, 0.3153153153153153], [0.854119425547997, 0.45925925925925926], [0.5452674897119341, 0.23662551440329216], [0.600907029478458, 0.600907029478458], [0.4990583804143125, 0.40879120879120884], [0.6532519549876025, 0.6532519549876025], [0.7773446457234581, 0.4043478260869566], [0.6988249845392702, 0.5782312925170067], [0.45510204081632655, 0.41666666666666663], [0.6988249845392702, 0.38659793814432986], [0.6114130434782608, 0.4955555555555556], [0.3896604938271605, 0.46875], [0.7361111111111112, 0.7361111111111112], [0.5269186712485682, 0.7937500000000002], [0.34766355140186916, 0.34766355140186916], [0.20833333333333331, 0.3155006858710563], [0.5863023175371843, 0.7585268884703913], [0.537876167416119, 0.4955555555555556], [0.9530428249436514, 0.9530428249436514], [0.3814262023217247, 0.4353448275862069], [0.37763136750763293, 0.44285714285714284], [0.5377777777777778, 0.5377777777777778], [0.46296296296296297, 0.46296296296296297], [0.6944444444444445, 0.12658227848101264], [0.4054545454545455, 0.41682242990654206], [0.46668667466986796, 0.2554744525547445], [0.3112327656123276, 0.10869565217391304], [0.7212094907407407, 0.7212094907407407], [0.31562500000000004, 0.12658227848101264], [0.625, 0.625], [0.618131868131868, 0.4043478260869566], [0.9041027559546079, 0.31562500000000004], [0.6428433641975309, 0.35866477272727276], [0.5616605616605616, 0.35866477272727276], [0.5902439024390245, 0.2929133858267717], [0.6792413935271077, 0.5902048319327732], [0.5199864498644986, 0.4207547169811321], [0.46296296296296297, 0.46296296296296297], [0.8918539325842695, 0.8918539325842695], [0.29523809523809524, 0.26998299319727886], [0.4955555555555556, 0.3468406593406593], [0.738954922628392, 0.6], [0.703125, 0.19801980198019806], [0.45925925925925926, 0.46499999999999997], [0.9993141289437586, 0.9835843169176502], [0.7545454545454545, 0.8036036036036037], [0.5215419501133786, 0.6861724281549355], [0.9575062901873077, 0.806697108066971], [0.48888888888888893, 0.16304347826086954], [0.8918539325842695, 0.6233062330623306], [0.6988249845392702, 0.5830583058305829], [0.5635887028581092, 0.2949766355140187], [0.8551587301587302, 0.3896604938271605], [0.5813754073057795, 0.5813754073057795], [0.37500000000000006, 0.25555555555555554], [0.6696428571428572, 0.49975895870159076], [0.8819444444444444, 0.7471655328798186], [0.3155006858710563, 0.4295051353874883], [0.39480452674897115, 0.39480452674897115], [0.38265306122448983, 0.38265306122448983], [0.5563218390804598, 0.37878787878787884], [0.41666666666666663, 0.44592696629213474], [0.6411049268192124, 0.10416666666666666], [0.4043478260869566, 0.45925925925925926], [0.49010989010989015, 0.3188131313131313], [0.8918539325842695, 0.4955555555555556], [0.6181795634920636, 0.49387755102040815], [0.618131868131868, 0.5011235955056179], [0.9996243425995492, 0.9996243425995492], [0.5260869565217392, 0.7270233196159123], [0.611317254174397, 0.2388369678089304], [0.21067415730337075, 0.7911164465786316], [0.8017676767676769, 0.8017676767676769], [0.31525423728813556, 0.31525423728813556], [0.2607709750566893, 0.2808302808302808], [0.66167290886392, 0.66167290886392], [0.7687074829931974, 0.7687074829931974], [0.6818181818181819, 0.6818181818181819], [0.8687160326086956, 0.5318681318681319], [0.4634661835748792, 0.42720073103868417], [0.5739795918367346, 0.5739795918367346], [0.6988249845392702, 0.6988249845392702], [0.34128440366972473, 0.3381818181818182], [0.31562500000000004, 0.5162738496071829], [0.41666666666666663, 0.16666666666666666], [0.40879120879120884, 0.32206632653061223], [0.4990583804143125, 0.3126050420168068], [0.5575, 0.5645569620253165], [0.4955555555555556, 0.4955555555555556], [0.8152173913043477, 0.8152173913043477], [0.66167290886392, 0.3546348314606741], [0.446, 0.5739795918367346], [0.7789062500000001, 0.7789062500000001], [0.654320987654321, 0.654320987654321], [0.34307065217391297, 0.12711864406779658], [0.6600900423728814, 0.485126253891387], [0.23445463812436282, 0.3381818181818182], [0.4240362811791383, 0.4240362811791383], [0.5373493975903614, 0.4634661835748792], [0.4429133858267717, 0.8819444444444444], [0.3757575757575758, 0.16806722689075632], [0.6226379440665155, 0.4770408163265306], [0.39574468085106385, 0.2941176470588235], [0.3444444444444445, 0.40917431192660547], [0.42613636363636365, 0.42613636363636365], [0.5625, 0.49010989010989015], [0.412087912087912, 0.2777777777777778], [0.6944444444444445, 0.35493827160493824], [0.45925925925925926, 0.6285714285714286], [0.864795918367347, 0.854119425547997], [0.18518518518518517, 0.21767241379310345], [0.7773446457234581, 0.66167290886392], [0.3546348314606741, 0.5318681318681319], [0.3757575757575758, 0.28956422018348627], [0.582287961055982, 0.412087912087912], [0.6506642512077294, 0.20833333333333331], [0.6944444444444445, 0.5876795162509448], [0.3468406593406593, 0.25], [0.3468406593406593, 0.6320224719101123], [0.6392045454545455, 0.6392045454545455], [0.7052154195011338, 0.7052154195011338], [0.8993827160493828, 0.7575757575757577], [0.600907029478458, 0.7281553398058254], [0.5305305305305306, 0.13888888888888887], [0.3506944444444444, 0.5438202247191011], [0.8101794934841405, 0.8101794934841405], [0.5667811679127096, 0.3381818181818182], [0.6792413935271077, 0.6792413935271077], [0.5495818399044207, 0.5495818399044207], [0.7937500000000002, 0.7937500000000002], [0.3305340223944875, 0.37796610169491524], [0.8918539325842695, 0.8101794934841405], [0.12658227848101264, 0.38490853658536583], [0.5782312925170067, 0.5667811679127096], [0.49010989010989015, 0.5022321428571428], [0.7861781076066792, 0.5499999999999999], [0.31250000000000006, 0.31250000000000006], [0.6320224719101123, 0.6320224719101123], [0.49975895870159076, 0.5160550458715595], [0.4056437389770724, 0.4323630136986301], [0.3381818181818182, 0.3872], [0.654320987654321, 0.654320987654321], [0.6346938775510204, 0.6346938775510204], [0.78677398989899, 0.5739795918367346], [0.6411049268192124, 0.6918367346938775], [0.6050290486564996, 0.37860082304526754], [0.4265202702702703, 0.4445422535211268], [0.20000000000000004, 0.15], [0.28956422018348627, 0.28956422018348627], [0.4732510288065843, 0.41682242990654206], [0.3012048192771084, 0.18292682926829268], [0.6233062330623306, 0.6233062330623306], [0.7521527129370266, 0.6250000000000001]]}}