{"seed": 42, "num_examples": 256, "batch_size": 1, "captions": [[["An elephant is in the back of a truck."], ["An elephant eating hay in the back of a truck."]], [["A man doing a trick on a skateboard."], ["A man doing a trick on a skateboard."]], [["A man standing on a tennis court holding a racket."], ["A man holding a tennis racket on a tennis court."]], [["A man standing in front of a box of pizza."], ["A man standing in front of a box of pizza."]], [["A pair of shoes and a table with a pair of shoes."], ["A display case with a bunch of items."]], [["A table with glasses of wine and bread on it."], ["A table with glasses of wine and plates of food."]], [["A living room with a couch and a table."], ["A living room with a couch and a table and a chair."]], [["A man sitting at a table with a bike."], ["A man sitting at a table with a bunch of cars."]], [["A desk with two computer monitors and a keyboard."], ["A computer monitor and a keyboard on a desk."]], [["Two elephants and a baby elephant standing next to trees."], ["An elephant standing next to a fence in the snow."]], [["A bathroom with a toilet with a table."], ["A bathroom with a toilet with a seat on it."]], [["An airplane sitting on top of an airport runway."], ["An airplane sitting on top of an airport runway."]], [["Two men riding bikes down a street."], ["A man standing next to a bike with a bike."]], [["Two giraffes and a baby giraffe standing next to a building."], ["A giraffe and a baby giraffe standing in front of a building."]], [["A woman sitting on a toilet on a street."], ["A woman riding a skateboard on the side of a street."]], [["A large clock on the side of a building."], ["A clock sitting in front of a window."]], [["A man sitting on a beach with a surfboard."], ["A surfboard sitting on the beach next to a person on the ocean."]], [["An orange cat laying on the hood of a car."], ["A cat laying on the hood of a car."]], [["A bride and groom standing next to a wedding cake."], ["A group of people standing around a cake."]], [["A large dog sleeping on a bed."], ["A dog laying on a bed next to a window with a phone holder."]], [["A baby laying in a bed with a blanket."], ["A baby sleeping on a white couch with a remote."]], [["A train is sitting on the tracks at a train station."], ["A train is sitting on the tracks at a train station."]], [["A stack of pancakes sitting on a plate on a table."], ["A stack of pancakes sitting on a plate on a table."]], [["A pair of scissors sitting on top of a table."], ["A pair of scissors sitting on top of a table."]], [["A book shelf with a bunch of books."], ["A shelf with a bunch of books on it."]], [["Two birds sitting on top of a tree branch."], ["Two birds sitting on top of a tree branch."]], [["A woman sitting at a table eating food."], ["A woman sitting at a table with a glass of wine."]], [["A man standing in a field with a frisbee."], ["A man standing next to a dog with a tennis racket."]], [["A parking meter sitting on the side of a street."], ["A parking meter sitting in front of a building."]], [["A phone sitting on top of a desk with a banana."], ["A phone sitting next to a box on a desk."]], [["A group of people dressed in costumes walking down a street."], ["A group of people walking in a building."]], [["A white table with a vase of flowers and a table."], ["A painting of a woman with flowers in the snow."]], [["A woman standing in a kitchen with a pot of food."], ["A woman cooking food in a pot on a stove."]], [["A clock tower in the middle of a street."], ["A building with umbrellas in front of it on a street."]], [["Two tennis players standing on a tennis court."], ["Two tennis players standing on top of a tennis court."]], [["A living room with a couch and a table."], ["A living room with a couch and a table."]], [["A man sitting on a bench in front of a church."], ["A group of people standing in front of a building."]], [["A man riding on the back of an elephant."], ["A man riding on the back of an elephant."]], [["A stop sign with writing on it."], ["A stop sign with writing on it."]], [["A white bathroom with a bath tub and a sink."], ["A bathroom with a bath tub and a sink and a mirror."]], [["A large airplane sitting on top of an airport runway."], ["A man walking towards an airplane on an airport runway."]], [["A blue bus parked on the side of a street."], ["A bus parked in front of a building."]], [["Two cats laying on top of a bed."], ["Two cats playing with each other in a field."]], [["A pizza sitting on a plate next to a glass of beer."], ["A pizza sitting on a plate on a table with glasses."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A plate with a sandwich and french fries."], ["A plate of food with a sandwich and french fries and bread."]], [["A red and white bus parked in front of a building."], ["A bus parked in front of a building."]], [["A red and yellow train is on the tracks."], ["A yellow and red train is at a train station."]], [["A black and white photo of a group of people."], ["A black and white photo of a group of people."]], [["A man standing on a tennis court holding a racket."], ["A man standing on a tennis court holding a racket."]], [["A black and white stove top oven sitting in a kitchen."], ["A shelf with a oven and a toothbrush on it."]], [["A traffic light with a cloudy sky in a city."], ["A skateboard flying over a street with a person on it."]], [["A banana sitting on a plate next to a table."], ["A banana sitting on top of a white plate."]], [["A young man wearing a white apron holding a large pair of scissors."], ["A baby in a white suit and tie holding his hands."]], [["A person standing on skis on a snow covered slope."], ["A woman standing on skis on a snow covered slope."]], [["A kitchen with a table and a refrigerator."], ["A kitchen with a table and a refrigerator."]], [["A man in the air on a snowboard."], ["A person standing in the snow at night with a guitar."]], [["A pizza sitting on a plate on a table."], ["A pizza sitting on top of a table."]], [["A cat playing with a mirror on a table."], ["A cat playing with a mirror on a table."]], [["A vase with red flowers in it on a counter."], ["A group of flowers in front of an oven."]], [["A group of people standing around a table with a cake."], ["A group of people standing around a table with food on it."]], [["A man and a woman standing next to each other."], ["A man and a woman standing next to each other."]], [["A clock on the side of a building."], ["A clock on a pole on a city street."]], [["A bathroom with a sink and a window."], ["A bathroom with two sinks and a window."]], [["A man with a dog sitting in an airport."], ["A man with a dog in an airport."]], [["A group of teddy bears sitting next to each other."], ["A pile of teddy bears sitting next to each other."]], [["A young man riding a skateboard in a pool."], ["A young boy standing on a skateboard."]], [["A stuffed teddy bear wearing a bow tie sitting on a bed."], ["A stuffed teddy bear wearing a red bow tie."]], [["A group of people riding skis on a ski lift."], ["A group of people skiing in the snow."]], [["A black bird sitting on a chair next to a woman."], ["A black bird sitting on the ground next to chairs."]], [["A dining room with a table and chairs."], ["A dining room with a table and chairs."]], [["A young boy swinging a baseball bat at a ball."], ["A baseball player swinging a bat at a ball."]], [["A city street at night with a traffic light."], ["A city street at night with a green traffic light."]], [["A person standing on skis in the snow."], ["A person on skis in the snow."]], [["A bedroom with a bed with pillows on it."], ["A black and white photo of an old bed with pillows."]], [["A man doing a trick on a skateboard at a skate park."], ["A man riding a skateboard at a skate park."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard."]], [["A group of horses grazing in a field."], ["A black and white photo of horses in the snow."]], [["A large swimming pool with a table in it."], ["A large swimming pool with a person sitting in it."]], [["A group of people standing on an airplane."], ["A sign on the front of an airplane on the runway."]], [["A black cat sitting in front of a door."], ["A black cat is sitting in front of a door."]], [["A woman standing on a tennis court with a ball."], ["A man standing on a tennis court holding a ball."]], [["A man standing on a tennis court with a racket."], ["Two men standing on a tennis court."]], [["A large bed with red pillows on top of it."], ["A large white bed with red pillows on it."]], [["An airplane flying over a tree in the sky."], ["A plane flying in the sky over trees."]], [["A truck and orange cones on a city street."], ["A view of a room with cars in a window."]], [["A hot dog and a bottle of beer."], ["A bottle of beer and bread on a table."]], [["A stop sign on the side of a street."], ["A stop sign on a sidewalk."]], [["A polar bear laying on the ground."], ["A polar bear laying on the ground in a field."]], [["A bunch of carrots and vegetables on a display."], ["A bunch of carrots and vegetables in baskets at a market."]], [["A group of teddy bears sitting on a table."], ["A bunch of teddy bears sitting on a table."]], [["A train is on the tracks under a bridge."], ["A train is sitting on the tracks at a train station."]], [["A plate of food on a table."], ["A plate of food with bread and a pickle on it."]], [["A street with a building and a sign on it."], ["A street with traffic lights on and a street."]], [["A seagull flying over a beach next to the ocean."], ["A white bird flying over the beach next to the ocean."]], [["A kitten laying on top of a laptop computer."], ["A small kitten laying on top of a laptop."]], [["A group of people standing in front of a bus."], ["A group of people standing in front of buses."]], [["A bike on the side of a train."], ["A bike sitting on the side of a train."]], [["A man holding a sign in a kitchen."], ["A man holding a sign in a kitchen."]], [["A black dog standing in front of a mirror."], ["A black dog looking at its reflection in a mirror."]], [["A person flying a kite next to the ocean."], ["A young boy flying a kite next to the ocean."]], [["A person holding a cell phone in their hand."], ["A person holding a small device in their hand."]], [["A group of bikes parked next to each other."], ["A row of bikes parked next to each other."]], [["Two elephants standing next to each other in a zoo."], ["A group of elephants walking in a dirt field."]], [["A man standing on a wall with flowers."], ["A man and a woman drinking water from a bottle."]], [["A brown horse standing in a field next to a fence."], ["A horse standing next to a baby horse in a field."]], [["A red double decker bus with people on it."], ["A red double decker bus with people on it."]], [["A motorcycle parked in the grass next to a tent."], ["A group of tents sitting in a field with tents."]], [["A black stove top oven sitting in a kitchen."], ["A black stove top oven in a kitchen."]], [["A kitchen with a blender on a counter."], ["A table with bottles of wine on top of it."]], [["A group of people flying kites in a field."], ["A painting of kites flying in the air over the water."]], [["A group of people sitting at a table eating food."], ["A group of people sitting at tables in a restaurant."]], [["A small car with two cars parked in a parking lot."], ["A group of cars parked in a field."]], [["A man standing next to a fire hydrant with smoke."], ["A fire hydrant on the side of a sidewalk."]], [["A person flying a bunch of kites in the air."], ["A woman flying a bunch of kites in the air."]], [["A herd of cows grazing in a field."], ["A black cow standing in a field of grass."]], [["A bus parked on the side of a street."], ["A bus parked on the side of a street."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A parking meter on the side of a street."], ["A parking meter in front of a building."]], [["A woman eating a sandwich and a drink."], ["A man laying on a bed eating food in a bag."]], [["A horse standing next to a tree in a field."], ["A horse standing in the grass next to a wall."]], [["A man standing on a snowboard on a snow covered slope."], ["A man standing on a snowboard on top of a mountain."]], [["A man riding a motorcycle on a track."], ["A person riding a motorcycle on a race track."]], [["A double decker bus driving down a street."], ["A red double decker bus driving down a street."]], [["A man sitting on a motorcycle."], ["A man sitting on a motorcycle next to a car."]], [["A baseball player swinging a bat at a game."], ["A baseball player swinging a bat at a ball."]], [["A man and a woman laying on a bed."], ["A man and a woman laying on a bed."]], [["A group of pictures of a table with food."], ["A group of pictures of cakes and coffee."]], [["A group of people playing tennis on a tennis court."], ["Two people playing tennis on a tennis court."]], [["A double decker bus on a city street."], ["A double decker bus on a city street."]], [["A young man taking a picture of himself with his cell phone."], ["A man taking a picture of himself in a mirror."]], [["A group of people walking on a beach with cows."], ["A group of people standing next to a cow on the beach."]], [["A man in a costume standing on a bus."], ["A man in a costume riding a skateboard on a truck."]], [["A woman playing a video game with a wii."], ["A woman holding an apple and a these people."]], [["A group of construction workers standing next to a fire hydrant."], ["Two construction workers standing next to a yellow fire hydrant."]], [["A white toilet with two shirts on top of it."], ["A white toilet sitting next to a sink."]], [["Two giraffes and a baby giraffe standing next to a building."], ["Two giraffes and a baby giraffe standing next to each other."]], [["A plate of food and a cup of coffee."], ["A tray of food and a cup of coffee."]], [["A parking meter sitting on the side of a street."], ["A parking meter sitting next to a group of cars."]], [["A man doing a trick on a skateboard over an orange cone."], ["A man doing a trick on a skateboard over an orange cone."]], [["A group of people standing in a field."], ["A group of people flying kites in the sky."]], [["A man brushing his teeth in front of a mirror."], ["A man standing in front of a mirror."]], [["A man painting a person on a street."], ["A man holding a surfboard in the air over a wave."]], [["A living room with chairs and a table."], ["A living room with chairs and a table."]], [["Two young men playing a video game with a wii."], ["Two men playing a video game with a wii."]], [["A group of people standing around a table."], ["A group of people standing around a table with plates of food."]], [["A zebra standing on top of a dirt field."], ["A herd of zebras standing in a field."]], [["A woman standing on a tennis court holding a ball."], ["A woman standing on a tennis court holding a ball."]], [["A cat sitting on a chair."], ["A gray cat sitting on top of a chair with an umbrella."]], [["A blue bike parked on the side of a street."], ["A blue bike parked next to a sidewalk."]], [["A group of people sitting at a table."], ["A group of people sitting at tables eating food."]], [["A young boy holding a baseball bat and a ball."], ["A young boy holding a baseball bat and a helmet."]], [["A young boy riding a skateboard down a street."], ["A young boy riding a skateboard down a street."]], [["A herd of giraffes running in a field."], ["A herd of giraffes running in a field."]], [["Two men in suits and ties standing on a street."], ["Two men standing next to each other in a street."]], [["A street sign with a person on it."], ["A blue sign with a person on it."]], [["A man holding a tennis ball on a tennis court."], ["A man standing on a tennis court holding a racket."]], [["A group of boats sitting in the water behind a fence."], ["A group of boats parked next to the water."]], [["A man wearing a red hat talking on a cell phone."], ["A man looking out of a window."]], [["A woman with a frisbee in a field."], ["A woman holding a baseball bat on a field."]], [["A teddy bear sitting on top of a red jacket."], ["A teddy bear sitting on a red pillow."]], [["A man standing in front of a cake."], ["A man standing in front of a bunch of wine glasses."]], [["A group of people walking in the rain with umbrellas."], ["A group of people in the water with umbrellas."]], [["Three people standing on skis in the snow."], ["A black and white photo of people on skis next to a tree."]], [["A person standing next to a pile of luggage."], ["A person holding an orange bag next to a red suitcase."]], [["A white truck parked on the side of a street."], ["A car driving down a street with street signs on it."]], [["A man walking on the tracks next to a train."], ["A man walking next to a train."]], [["A man riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard in the ocean."]], [["A banana split is sitting on top of a table."], ["A banana split is sitting on top of a field."]], [["A room with a bed and a lamp."], ["A table with bottles of wine and a table with lamp."]], [["A wooden bench with a truck on it."], ["A bench and a trailer with a trailer."]], [["A desk with two computer monitors and a laptop."], ["A laptop computer sitting on top of a desk."]], [["A person riding a horse on a dirt road."], ["A man riding a horse on a dirt road."]], [["A black and white photo of a person riding a motorcycle."], ["A man riding a dirt bike next to a road."]], [["A man flying through the air while riding skis."], ["A man flying through the air while riding skis."]], [["A pizza sitting on top of a kitchen counter."], ["A pizza sitting on top of a stove."]], [["A woman looking in a small refrigerator."], ["A young boy playing with a fire with a fire."]], [["A city street at night with cars and traffic lights."], ["A city street at night with cars and traffic."]], [["A group of people playing a game of frisbee."], ["A group of people playing a game of frisbee."]], [["An open refrigerator with food in a room."], ["An open refrigerator with food in a table."]], [["A kitchen with a stove and a refrigerator."], ["A kitchen with a stove and a refrigerator."]], [["Two cats sitting in front of a window."], ["Two cats sitting in front of a window."]], [["A statue of a clock tower in the middle of it."], ["A clock tower with graffiti on top of a wall."]], [["A television in a bathroom with two sinks."], ["A bathroom with two sinks and a television."]], [["A room with a desk and a knit desk."], ["A group of books in a room with a table with pizza."]], [["A group of people standing in a field."], ["A group of people standing in the grass with frisbees."]], [["A black and white cat sitting next to a bottle of water."], ["A cat sitting on a window sill next to a bottle of water."]], [["A kite flying in the sky on the beach."], ["A person flying a kite on the beach."]], [["A woman sitting in a chair holding an umbrella."], ["A woman sitting in a chair holding an umbrella."]], [["Two giraffes standing in the middle of a field."], ["Two giraffes standing in a field of grass."]], [["A chair with a laptop computer sitting on a desk."], ["A small bed with two computers on a desk."]], [["A bedroom with a bed and a fireplace."], ["A bedroom with a bed and a fireplace."]], [["A small bird standing on a tree branch."], ["A bird sitting on top of a tree branch."]], [["A bus with a picture on the side of it."], ["A bus with a picture on the side of it."]], [["A zebra standing next to a tree in a field."], ["A zebra standing under a tree in a field."]], [["A person sitting at a table with plates of pizza and salad."], ["A plate with a salad and a pizza and a glass of beer."]], [["A man sleeping in a bed with a cat."], ["A black photo of a pot on a table."]], [["A person riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard."]], [["A group of zebras standing in the dirt."], ["A group of zebras standing in the dirt."]], [["A group of planes flying in formation in the sky."], ["A group of planes flying in formation in the sky."]], [["A bedroom with a bed and luggage on the floor."], ["A bedroom with a statue on a bed and a dresser."]], [["A picture of cupcakes on a television."], ["A chair with baseball bats sitting in it."]], [["A group of children feeding a giraffe."], ["A group of children standing next to a fence with giraffes."]], [["A group of people standing around with animals in a street."], ["A group of people swimming in a pool under a tree."]], [["A little girl eating a banana."], ["A little girl sitting at a banana bowl."]], [["A bride and groom standing in a wedding."], ["A bride and groom shaking hands in front of a wedding."]], [["A desk with a computer monitor and a keyboard."], ["A desk with a picture of a television."]], [["A man and a woman standing in front of fruit."], ["A man standing in front of a fruit stand."]], [["An airplane flying in the sky."], ["An airplane flying in the sky."]], [["A group of zebras grazing in a field."], ["A herd of zebras grazing in the grass."]], [["A small dog wearing a red bow tie sitting on steps."], ["A dog reading a book next to a dog."]], [["A baby standing next to boxes of apples."], ["A man standing in front of a window with apples."]], [["Two elephants standing next to each other in a field."], ["A man holding an elephant in front of his trunk."]], [["A picture of a group of people on a bathroom floor."], ["A bathroom with pictures of people on a urinal."]], [["A train is sitting on the tracks in a field."], ["A train is sitting on the tracks at night."]], [["Two women and a child sitting on a bench."], ["A man sitting on a bench playing a guitar."]], [["A train is on the tracks in the snow."], ["A train is sitting on the tracks in the snow."]], [["A tree with red apples in it."], ["A statue of orange flowers in front of an orange field."]], [["A man standing on a tennis court holding a ball."], ["A man standing on a tennis court holding a ball."]], [["A group of people standing next to an airplane."], ["A group of people standing around an airplane on the beach."]], [["A statue of a cow standing in a street."], ["A statue of a cow standing on top of a street."]], [["A kitchen with a stove and a table."], ["A bedroom with a dresser and a mirror."]], [["A cake and pastries on a table in a restaurant."], ["A display case with a group of cupcakes and cakes."]], [["A rear view mirror of a dog in a car."], ["A dog in a rear view mirror of a car."]], [["A toy is sitting on a desk with a computer."], ["A toy is sitting next to a computer keyboard."]], [["A pizza sitting next to a can of soda."], ["A pizza and a can of soda on the floor and a can of soda."]], [["A desk with a laptop computer sitting on top of it."], ["A desk with a laptop computer sitting on top of it."]], [["A crowd of people standing on a street with a traffic light."], ["A group of people standing on the side of a bus."]], [["A woman sitting at a table with two slices of pizza."], ["A woman sitting at a table with two slices of pizza."]], [["A truck driving down a road with hay."], ["A truck driving down a street with hay."]], [["A group of street signs on a pole."], ["A group of street signs in front of a brick wall."]], [["A group of surfboards sitting on the beach."], ["A group of surfboards sitting on top of a beach."]], [["A man standing on a tennis court with a ball."], ["A man holding a tennis racket on a tennis court."]], [["A bathroom with a sink and a toilet in a mirror."], ["A bathroom with a toilet and a sink and a mirror."]], [["A man preparing food in a kitchen."], ["A man standing in front of a kitchen counter with a sandwich."]], [["A group of people standing around a table with a cake."], ["A woman holding a little girl in front of a crowd."]], [["A woman riding a pink bike down a street."], ["A man walking down a street with a backpack."]], [["A plate of food and a glass of wine on a table."], ["A table with plates of food and glasses of wine."]], [["A white cat laying on an office chair."], ["A cat sleeping on top of an office chair."]], [["A group of people standing in front of a bakery."], ["A woman standing in front of a bakery with a bakery."]], [["A group of people with umbrellas."], ["A group of people with umbrellas in the rain."]], [["Two boats and a tractor on a beach."], ["Two boats are sitting on the beach next to the ocean."]], [["A refrigerator with a table in a room."], ["A refrigerator in a room with a bed."]], [["Two cups and a table with a table."], ["A cup of coffee and a plate on a table."]], [["An airplane flying in the sky with a large kite."], ["Two birds flying in the sky."]], [["A group of cars stopped at a traffic light."], ["A group of cars parked on the side of a street."]], [["A person flying a kite in the water."], ["A kite flying in the sky over a body of water."]], [["A bathroom with a sink and a tub."], ["A bathroom with a sink and a toilet and a shower."]], [["Three people sitting in front of a tent with an umbrella."], ["Two men standing under an umbrella in the grass."]], [["A small plane parked on the runway at an airport."], ["A fighter jet parked at an airport."]], [["A teddy bear sitting next to a man holding a tennis racket."], ["An old man and a little girl holding tennis rackets."]], [["A group of people sitting at a table eating food."], ["A group of people sitting at a table eating food."]], [["A clock on a wall with a mirror."], ["A mirror and a clock on a wall in a room."]], [["A sandwich and food in a box."], ["A toy and two clocks in a plastic container."]], [["A cow and a calf standing in a field."], ["A cow and a baby calf standing in a field."]], [["A wooden bench sitting on the beach next to the ocean."], ["A field with grass and a field and the water."]]], "scores": {"meteor": [[0.7687074829931974, 0.7602601480152501], [0.32206632653061223, 0.32206632653061223], [0.7585268884703913, 0.485126253891387], [0.15, 0.15], [0.3475303164744159, 0.11235955056179774], [0.46890927624872564, 0.372], [0.3896604938271605, 0.3996598639455783], [0.5913134484563056, 0.5813754073057795], [0.6944444444444444, 0.4440665154950869], [0.5318681318681319, 0.5472527472527473], [0.46875, 0.45731707317073167], [0.7060399917542773, 0.7060399917542773], [0.5068181818181817, 0.35118110236220473], [0.5373493975903614, 0.7555879494655005], [0.8017676767676769, 0.8289915966386556], [0.43069584736251404, 0.32206632653061223], [0.6360544217687074, 0.6528630869823657], [0.6989795918367346, 0.8017676767676769], [0.616925669350309, 0.18691588785046728], [0.5645569620253165, 0.5065920173379086], [0.3506944444444444, 0.25555555555555554], [0.48478260869565226, 0.48478260869565226], [0.9054545454545455, 0.9054545454545455], [0.5251825500842539, 0.5251825500842539], [0.6861724281549355, 0.8017676767676769], [0.6310013717421126, 0.6310013717421126], [0.8918539325842695, 0.5569306930693068], [0.3811965811965813, 0.44158415841584164], [0.5318681318681319, 0.5377777777777778], [0.40760869565217384, 0.40879120879120884], [0.5769944341372912, 0.4711111111111111], [0.4748434027076177, 0.25], [0.520408163265306, 0.4766949152542372], [0.6792413935271077, 0.3126050420168068], [0.600907029478458, 0.5625], [0.5876795162509448, 0.5876795162509448], [0.7521527129370266, 0.4101694915254237], [0.9041027559546079, 0.9041027559546079], [0.6691919191919192, 0.6691919191919192], [0.537876167416119, 0.7433333333333335], [0.5616605616605616, 0.49010989010989015], [0.4536585365853659, 0.5575], [0.5011235955056179, 0.48888888888888893], [0.8099489795918368, 0.6284097797534854], [0.6545430672268908, 0.6545430672268908], [0.32206632653061223, 0.40760869565217384], [0.9086363636363638, 0.6465763875643715], [0.23662551440329216, 0.18292682926829268], [0.5160550458715595, 0.5160550458715595], [0.7789062500000001, 0.7789062500000001], [0.5060506050605059, 0.18292682926829268], [0.40917431192660547, 0.2869318181818182], [0.618131868131868, 0.6310013717421126], [0.6004008746355685, 0.24752475247524755], [0.446, 0.5625], [0.6388888888888888, 0.6388888888888888], [0.605, 0.24658203125000006], [0.854119425547997, 0.6388888888888888], [0.4955555555555556, 0.4955555555555556], [0.40879120879120884, 0.1736111111111111], [0.6953898514851486, 0.6782713085234094], [0.5888888888888889, 0.5888888888888889], [0.45510204081632655, 0.8629377676996723], [0.39453125, 0.39453125], [0.5679012345679012, 0.49387755102040815], [0.45731707317073167, 0.38490853658536583], [0.41333333333333333, 0.4746835443037974], [0.30423280423280424, 0.5506172839506173], [0.40879120879120884, 0.4179775280898876], [0.565083176127594, 0.5698720166032515], [0.46875, 0.46875], [0.8993827160493828, 0.7052154195011338], [0.625, 0.618131868131868], [0.29760000000000003, 0.2977594339622642], [0.4505050505050505, 0.4481927710843373], [0.9139118457300276, 0.6657318376068376], [0.782267115600449, 0.6284569902727446], [0.46875, 0.15], [0.625, 0.618131868131868], [0.5796973961998594, 0.4726890756302521], [0.6410256410256411, 0.7485875706214691], [0.37763136750763293, 0.3279411764705883], [0.1648351648351648, 0.5068181818181817], [0.4101694915254237, 0.3811965811965813], [0.625, 0.66167290886392], [0.4440665154950869, 0.1648351648351648], [0.5076628352490421, 0.4505050505050505], [0.5681818181818182, 0.46458333333333335], [0.4207547169811321, 0.5160550458715595], [0.5506172839506173, 0.30789825970548856], [0.7575757575757577, 0.5782312925170067], [0.7687074829931974, 0.6114130434782608], [0.2222711267605634, 0.2920471841704718], [0.1834862385321101, 0.1851851851851852], [0.5902439024390245, 0.6157965194109771], [0.6226379440665155, 0.650318287037037], [0.7602601480152501, 0.4955555555555556], [0.5011235955056179, 0.4955555555555556], [0.5503634475597092, 0.5503634475597092], [0.6792413935271077, 0.4263888888888889], [0.4955555555555556, 0.4766949152542372], [0.5975308641975308, 0.5975308641975308], [0.8819444444444444, 0.9993141289437586], [0.7145928899082569, 0.43069584736251404], [0.41682242990654206, 0.28956422018348627], [0.6657910689028086, 0.4295051353874883], [0.7687074829931974, 0.7687074829931974], [0.6981085116973618, 0.40917431192660547], [0.5506172839506173, 0.5575], [0.3194444444444444, 0.39118246687054015], [0.650318287037037, 0.5060506050605059], [0.7282110091743119, 0.6880733944954129], [0.6777108433734939, 0.7361111111111112], [0.38110236220472443, 0.5208333333333333], [0.38490853658536583, 0.18292682926829268], [0.605, 0.3155006858710563], [0.1851851851851852, 0.1851851851851852], [0.6962184873949581, 0.6962184873949581], [0.6310013717421126, 0.7361111111111112], [0.5076628352490421, 0.2100840336134454], [0.618131868131868, 0.446], [0.7913056930693071, 0.785891089108911], [0.5739795918367346, 0.5574156746031746], [0.8918539325842695, 0.8654513888888888], [0.5563218390804598, 0.446], [0.3535353535353535, 0.30303030303030304], [0.6792413935271077, 0.6792413935271077], [0.46296296296296297, 0.46875], [0.6724489795918367, 0.7059558517284465], [0.1530612244897959, 0.1530612244897959], [0.775219664108553, 0.618131868131868], [0.31525423728813556, 0.4000000000000001], [0.4481481481481482, 0.37307380373073795], [0.5679012345679012, 0.3472222222222222], [0.7309228039041704, 0.484], [0.6918367346938775, 0.2607709750566893], [0.38027108433734946, 0.4726890756302521], [0.5202546296296297, 0.4701436130007558], [0.5698720166032515, 0.46890927624872564], [0.5773420479302832, 0.5773420479302832], [0.5739795918367346, 0.625], [0.5164292279411764, 0.2776119402985075], [0.41682242990654206, 0.2869318181818182], [0.46499999999999997, 0.46499999999999997], [0.372, 0.4505050505050505], [0.44999999999999996, 0.6038032945736435], [0.7650100242692836, 0.3675766283524904], [0.4263888888888889, 0.4263888888888889], [0.5563218390804598, 0.530952380952381], [0.8200597312095569, 0.703125], [0.6476468138275718, 0.6411049268192124], [0.43314500941619577, 0.485126253891387], [0.3896604938271605, 0.3896604938271605], [0.8918539325842695, 0.8918539325842695], [0.6880733944954129, 0.34403669724770647], [0.3, 0.3411111111111111], [0.4440366972477064, 0.20000000000000004], [0.2100840336134454, 0.26976495726495725], [0.4810495626822157, 0.2545362903225807], [0.2336448598130841, 0.21367521367521372], [0.6918367346938775, 0.45510204081632655], [0.32206632653061223, 0.31250000000000006], [0.5160550458715595, 0.3472222222222222], [0.46875, 0.3357712765957447], [0.36351165980795613, 0.23232323232323232], [0.20000000000000004, 0.4043478260869566], [0.8103975535168196, 0.6343858298036196], [0.6222271517302573, 0.8152173913043477], [0.9995, 0.8993827160493828], [0.3411111111111111, 0.19531250000000003], [0.5739795918367346, 0.3546348314606741], [0.9993141289437586, 0.48076923076923084], [0.7349537037037036, 0.8287608596250572], [0.8399159663865547, 0.618131868131868], [0.2504960317460318, 0.2504960317460318], [0.25252525252525254, 0.25510204081632654], [0.4989690721649485, 0.13761467889908252], [0.5616605616605616, 0.5679012345679012], [0.39480452674897115, 0.39480452674897115], [0.46875, 0.46875], [0.3546348314606741, 0.3546348314606741], [0.5575, 0.5575], [0.42216721672167207, 0.7789062500000001], [0.4213483146067415, 0.22471910112359547], [0.36764705882352944, 0.38942107455226993], [0.7948022959183674, 0.5625], [0.18018018018018017, 0.3357712765957447], [0.4056437389770724, 0.5215419501133786], [0.8301839254220206, 0.8301839254220206], [0.4505050505050505, 0.5739795918367346], [0.4641544117647058, 0.2222222222222222], [0.4179775280898876, 0.4179775280898876], [0.66167290886392, 0.625], [0.616925669350309, 0.616925669350309], [0.7740169238427077, 0.45925925925925926], [0.7150900900900901, 0.46691176470588236], [0.5377777777777778, 0.2839506172839506], [0.7095046854082998, 0.864795918367347], [0.605, 0.605], [0.7485875706214691, 0.7485875706214691], [0.7145928899082569, 0.40301835019722176], [0.39952531645569617, 0.0625], [0.38659793814432986, 0.27777777777777773], [0.6428433641975309, 0.3993055555555555], [0.7014492753623188, 0.3599374021909233], [0.4523364485981308, 0.34090909090909094], [0.4737654320987654, 0.3546348314606741], [0.738954922628392, 0.8819444444444444], [0.32763532763532766, 0.32763532763532766], [0.7361111111111112, 0.864795918367347], [0.5555555555555555, 0.2504960317460318], [0.6861724281549355, 0.267478813559322], [0.5318681318681319, 0.12195121951219512], [0.47920792079207924, 0.5876795162509448], [0.43314500941619577, 0.3506944444444444], [0.5202546296296297, 0.5681818181818182], [0.2222222222222222, 0.21978021978021975], [0.3835051546391753, 0.23232323232323232], [0.47959183673469385, 0.47959183673469385], [0.4505050505050505, 0.31250000000000006], [0.5033238366571701, 0.4810495626822157], [0.34766355140186916, 0.2949766355140187], [0.2808302808302808, 0.267478813559322], [0.5625, 0.4641544117647058], [0.3177966101694915, 0.41333333333333333], [0.5948372615039282, 0.48677248677248675], [0.8861997310842195, 0.8861997310842195], [0.544452519379845, 0.3260869565217391], [0.8466372282608694, 0.8466372282608694], [0.32206632653061223, 0.49387755102040815], [0.3872, 0.290625], [0.3546348314606741, 0.5160550458715595], [0.41360294117647056, 0.34128440366972473], [0.6250000000000001, 0.7309228039041704], [0.6071019473081329, 0.44285714285714284], [0.8152173913043477, 0.21739130434782605], [0.4732510288065843, 0.23379629629629628], [0.5612244897959183, 0.31562500000000004], [0.5739795918367346, 0.6411049268192124], [0.4440366972477064, 0.520408163265306], [0.12820512820512822, 0.3155006858710563], [0.5575, 0.4295051353874883], [0.5011235955056179, 0.4179775280898876], [0.19132653061224492, 0.29444444444444445], [0.38490853658536583, 0.48076923076923084], [0.4464285714285715, 0.15625000000000003], [0.46875, 0.39208834218618954], [0.3599374021909233, 0.3876262626262626], [0.48478260869565226, 0.16666666666666666], [0.22865853658536583, 0.3234880450070324], [0.7636335784313727, 0.20000000000000004], [0.5698720166032515, 0.5698720166032515], [0.33283582089552244, 0.3112327656123276], [0.17045454545454547, 0.1111111111111111], [0.41333333333333333, 0.36134651600753287], [0.7309228039041704, 0.20000000000000004]]}}