{"seed": 42, "num_examples": 512, "batch_size": 1, "captions": [[["An elephant in the back of a truck."], ["A person with an umbrella out the door of a trailer."]], [["A person doing a trick on a skateboard."], ["A man riding a skateboard on a sidewalk."]], [["A man standing on a tennis court holding a racket."], ["A man holding a tennis racket on a tennis court."]], [["A man standing in front of a pizza in a box."], ["A man standing next to a box of scissors."]], [["A pair of shoes and a pair of shoes on a table."], ["A doll sitting on a table with a pair of shoes."]], [["A table with glasses of wine and plates of bread."], ["A table with wine glasses and plates of food on it."]], [["A living room with a couch and a table."], ["A living room with a table and a laptop computer."]], [["A man sitting at a table in a train station."], ["A man riding a bike in a train station."]], [["A desk with two computer monitors and a keyboard."], ["A computer monitor and a keyboard on a desk."]], [["Two elephants and a baby elephant standing in a zoo."], ["An elephant and a baby elephant standing next to a fountain."]], [["A bathroom with a toilet with a table."], ["A bowl of a toilet in a bowl on a table."]], [["An airplane sitting on top of an airport runway."], ["An airplane sitting on top of an airport runway."]], [["A group of people riding a bike down a street."], ["Two men riding bikes down a street."]], [["Two giraffes and a baby giraffe standing next to a building."], ["Two giraffes and a baby giraffe standing next to a building."]], [["A woman sitting on a toilet on a street."], ["A painting of a bear on top of a table."]], [["A large clock on the side of a building."], ["A clock in the window of a window."]], [["A man sitting on the beach next to a surfboard."], ["A man laying on a surfboard in the air."]], [["An orange cat laying on the hood of a car."], ["An orange cat standing on the back of a car window of a car."]], [["A bride and groom standing next to a wedding cake."], ["A woman standing in front of a cake with lights."]], [["A large dog sleeping on a bed."], ["A stuffed animal sitting on a bed with a cup of coffee."]], [["A baby laying in a bed with a blanket."], ["A baby laying in a bed with a bunch of fruits and vegetables."]], [["A train is sitting on the tracks in a train yard."], ["A man standing on top of a parking lot."]], [["A stack of pancakes sitting on a plate on a table."], ["A stack of pancakes sitting on a plate on a table."]], [["A pair of scissors sitting on top of a table."], ["A pair of scissors sitting on top of a table."]], [["A book shelf with a bunch of books."], ["A book shelf with a bunch of books."]], [["Two birds sitting on top of a tree branch."], ["Three birds sitting on top of a tree."]], [["A woman sitting at a table eating food."], ["A woman sitting at a table with a bird on it."]], [["A man standing in the grass with a frisbee."], ["A brown and white dog standing next to a suitcase."]], [["A parking meter on the side of a street."], ["An elephant standing next to a sign on a street."]], [["A banana sitting on top of a desk."], ["A phone and a sandwich on a desk with a sandwich."]], [["A group of people in costumes walking down a street."], ["A group of people walking in a market."]], [["A white bouquet of white flowers on a table."], ["A bird sitting on the side of a car in the snow."]], [["A woman standing next to a pot of food on a stove."], ["A woman standing in front of an oven with food."]], [["A clock tower in the middle of a street."], ["A painting of a clock tower in the middle of a street."]], [["Two tennis players shaking hands on a tennis court."], ["Two tennis players standing on top of a tennis court."]], [["A living room with a couch and a table."], ["A hotel room with three beds and a table."]], [["A man sitting on a bench in front of a church."], ["A woman sitting on a bench in front of a tree."]], [["A man riding on the back of an elephant."], ["A man riding on the back of an elephant."]], [["A stop sign with writing on it."], ["A wooden stop sign with writing on it."]], [["A bathroom with a bath tub and a toilet."], ["A bathroom with a toilet and a bath tub."]], [["A group of people standing in front of an airplane."], ["A painting of people standing in front of an airplane."]], [["A green bus parked on the side of a street."], ["A green bus driving down a street next to a building."]], [["Two cats laying on top of a bed."], ["A group of cats laying on the floor with books."]], [["A pizza sitting on top of a white plate on a table."], ["A pizza sitting on a white plate next to a glass of beer."]], [["A man riding a wave on a surfboard with a dog."], ["A person riding a wave on a surfboard in the ocean."]], [["A plate with a sandwich and french fries."], ["A plate with a sandwich and french fries and a sandwich."]], [["A red and white bus parked in front of a building."], ["A painting of a bus parked in front of a building."]], [["A train is sitting on the tracks."], ["A train is sitting on the tracks next to a building."]], [["A black and white photo of a group of people."], ["A group of people standing around with teddy bears."]], [["A man standing on a tennis court holding a racket."], ["A man standing on a tennis court with a racket."]], [["A black stove top oven sitting in a kitchen."], ["A stove top oven with a table in a kitchen."]], [["A traffic light in the middle of a city street."], ["A traffic light over a city street with traffic lights."]], [["A banana sitting on a plate next to a table."], ["A banana and an egg on a plate on a table."]], [["A young man in a white coat holding a large pair of scissors."], ["A picture of a man in a ice cream and tie and tie."]], [["A person standing on skis on a snow covered slope."], ["A person standing on skis on a snow covered slope."]], [["A kitchen with a table and a refrigerator."], ["A living room with boxes and a stove and a fireplace."]], [["A man flying through the air on a snowboard."], ["A man flying through the air while riding a snowboard."]], [["A pizza sitting on a plate next to a drink."], ["A man holding a plate of food on a table."]], [["A cat playing with its reflection in a mirror."], ["A cat drinking from a glass of wine."]], [["A vase with red flowers in front of a oven."], ["A group of flowers in front of a fireplace."]], [["A group of people standing around a table with a cake."], ["A group of people standing around a table with a box of food."]], [["A woman standing next to an elderly man."], ["An old man in a suit and tie in a window."]], [["A clock on a pole on a city street."], ["A clock on the side of a city street."]], [["A bathroom with a sink and a window."], ["A bathroom with a toilet and a table."]], [["A man with a dog sitting on the stairs."], ["A man holding a bunch of baseball bats in his hand."]], [["A group of teddy bears sitting next to each other."], ["A teddy bear laying on top of a bed."]], [["A young man riding a skateboard at a skate park."], ["A young man with a guitar in his mouth."]], [["A stuffed teddy bear wearing a mask on a bed."], ["A dog sitting on a bed with two teddy bears."]], [["A group of people riding skis on a ski lift."], ["A group of people on a ski lift on a ski lift."]], [["A black bird sitting on a chair next to a woman."], ["A dog sitting in front of chairs and chairs and a table with an umbrella."]], [["A dining room with a table and chairs."], ["A dining room with a table and chairs."]], [["A young boy swinging a baseball bat at a ball."], ["A man swinging a baseball bat at a ball in a batting cage."]], [["A city street at night with a traffic light."], ["A city street at night with cars and traffic."]], [["A person standing on skis in the snow."], ["A man standing on skis on a snow covered slope with skis."]], [["A wooden bed with pillows on top of it."], ["A group of black cats sitting on a couch in a living room."]], [["A man doing a trick on a skateboard at a skate park."], ["A man doing a trick on a skateboard on a ramp."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A group of horses grazing in a field."], ["A group of horses grazing in a field."]], [["A large swimming pool with a table and a table."], ["A large swimming pool with a table and a large pool."]], [["A group of people standing on an airplane."], ["A group of people standing next to an airplane on the runway."]], [["A black cat sitting in front of a door."], ["A black cat standing in front of a door."]], [["A woman standing on a tennis court with a ball."], ["A man standing on a tennis court holding a ball."]], [["A man standing on a tennis court with a racket."], ["A group of people standing standing in the water."]], [["A large bed with red pillows on top of it."], ["A bed with two lamps in a room with a table."]], [["An airplane flying over a tree in the sky."], ["A large airplane flying over a tree."]], [["A construction truck and orange cones on a street."], ["A group of orange cones in front of a building."]], [["A hot dog sitting next to a bottle of soda."], ["A hot dog in a bun on a table."]], [["A red stop sign on the side of a street."], ["A stop sign on a sidewalk next to a sidewalk."]], [["A polar bear laying on the ground."], ["A polar bear standing next to a pile of pillows."]], [["A bunch of carrots and vegetables in baskets."], ["A display of carrots and other vegetables in a store."]], [["A group of white teddy bears sitting next to each other."], ["A group of white teddy bears sitting on a table."]], [["A train is on the tracks under a bridge."], ["A train is on the tracks under a bridge."]], [["A plate of food on a table."], ["A plate with an orange and an orange and a knife."]], [["A street with a building and a sign on it."], ["A person standing on a city street at night."]], [["A seagull flying over a beach next to the ocean."], ["A seagull flying over a beach with a pillow."]], [["A cat laying on top of a laptop computer."], ["A kitten laying on top of a laptop computer."]], [["A group of people standing in front of a bus."], ["A group of people standing in front of a bus."]], [["A bike sitting on the side of a train."], ["A bike sitting on the side of a train."]], [["A man holding a yellow sign in a kitchen."], ["A man holding a box in a kitchen."]], [["A black dog sitting in front of a mirror."], ["A black dog standing on a bed with a frisbee."]], [["A person flying a kite next to the ocean."], ["A person flying a kite in the sky."]], [["A person holding a cell phone in their hand."], ["A person holding a cell phone in their hand."]], [["A row of bikes parked next to each other."], ["A bike parked on the floor next to a table."]], [["Two elephants standing next to each other in a zoo."], ["An elephant standing in the sand next to trees."]], [["A man holding a vase of flowers on a wall."], ["A man taking a picture of a cell phone building."]], [["A brown horse standing next to a barbed wire fence."], ["Two horses walking in the grass in a field."]], [["A red double decker bus with people on it."], ["A double decker bus with people on it."]], [["A motorcycle parked next to a tent in a field."], ["A group of people sitting under an umbrella in the snow."]], [["A black stove top oven sitting in a kitchen."], ["A stove top oven in a kitchen with a table."]], [["A blender sitting on top of a table."], ["A group of people sitting around a table eating food."]], [["A group of people flying kites in a field."], ["A group of kites flying in the sky on the beach."]], [["A group of people sitting at a table eating food."], ["A group of people sitting at a table eating food."]], [["A small car with two cars parked in a parking lot."], ["A car parked in the sand next to a car."]], [["A man standing next to a fire hydrant with water."], ["A group of people standing in the water with a fire hydrant."]], [["A person flying a bunch of kites in the air."], ["A crowd of people holding umbrellas."]], [["A herd of cows grazing in a field with a mountain in the background."], ["A horse standing in a field with animals in the background."]], [["A bus parked on the side of a street."], ["A bus parked in front of a building."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A parking meter on the side of a street."], ["A person standing next to a red fire hydrant."]], [["A woman eating a sandwich and drinking coffee."], ["A woman eating food and a candle on a bed."]], [["A horse standing next to a building."], ["A horse grazing in the grass under a tent."]], [["A man standing on a snowboard on a snow covered slope."], ["A person standing in the snow with a snowboard."]], [["A person riding a motorcycle on a track."], ["A person riding a motorcycle on a race track."]], [["A double decker bus driving down a street."], ["A double decker bus parked on the side of a road."]], [["A man sitting on a motorcycle."], ["A man sitting on a motorcycle next to a evidently car."]], [["A baseball player swinging a bat at a ball."], ["A baseball player swinging a bat at a game."]], [["A man and a woman laying on a bed."], ["A man and a woman laying on a bed."]], [["A group of pictures of food on a table."], ["A group of pictures of a table with food."]], [["Two people playing tennis on a tennis court."], ["Two men playing tennis on a tennis court."]], [["A red double decker bus on a city street."], ["A red double decker bus on a city street."]], [["A man taking a picture of himself in a mirror."], ["A man sitting in a chair holding a cell phone."]], [["A group of people playing with a cow on the beach."], ["A group of people playing with elephants in the water."]], [["A man in a costume standing on a trolley."], ["A man standing in front of an airplane."]], [["A woman holding a nintendo wii game controller."], ["Two men playing a video game with a wii."]], [["A group of construction workers standing next to a fire hydrant."], ["A group of construction workers standing next to a fire hydrant."]], [["A white toilet with two skateboards on top of it."], ["A white toilet in the bathroom with a table."]], [["Two giraffes and a baby giraffe standing next to a building."], ["Two giraffes standing next to each other in front of a building."]], [["A plate of food and a cup of coffee."], ["A pizza and a cup of coffee on a plate."]], [["A parking meter sitting on the side of a street."], ["A parking meter sitting on the side of a street."]], [["A man doing a trick on a skateboard over an orange cone."], ["A painting of a man jumping over an orange cone on the water."]], [["A group of people standing in a field."], ["A group of people flying kites in the sky in the sky."]], [["A man brushing his teeth in front of a mirror."], ["A man brushing his teeth in front of a mirror."]], [["A man standing on a street next to a pole."], ["A child holding a baby in front of an umbrella."]], [["A living room with chairs and a table."], ["An office with chairs and a table in it."]], [["Two young men playing a video game with a wii."], ["Two men playing a video game with a wii."]], [["A group of people standing around a table with food."], ["A group of men standing around a table of food."]], [["A zebra standing next to a baby zebra."], ["Two zebras standing in front of a mirror."]], [["A woman standing on a tennis court holding a ball."], ["A man hitting a tennis ball on a tennis court."]], [["A cat sitting on a chair."], ["A cat standing on top of a bench next to a couch."]], [["A blue bike parked on the side of a street."], ["A blue bike parked on the side of a street."]], [["A group of people sitting at a table."], ["A group of people sitting at tables eating food."]], [["A young boy holding a baseball bat."], ["A young boy holding a baseball bat next to a pillow."]], [["A young boy riding a skateboard in a park."], ["A young boy riding on a skateboard in a pool."]], [["A herd of giraffes running in a field."], ["A herd of giraffes running in a field."]], [["Two men in suits and ties standing on a street."], ["Two men walking down a street with a large clock."]], [["A street sign with a person on it."], ["A street sign on top of a pole."]], [["A man holding a tennis ball on a tennis court."], ["A man holding a tennis racket on a tennis court."]], [["A group of boats sitting in the water behind a fence."], ["An airplane sitting on top of an airport runway."]], [["A man wearing a red hat talking on a cell phone."], ["A man eating a piece of food in front of a restaurant."]], [["A person playing with a frisbee in a field."], ["A woman wearing a red hat on a fence."]], [["A teddy bear sitting on top of a red jacket."], ["A teddy bear sitting in front of a window."]], [["A man sitting in front of a cake."], ["A bottle of wine and a glass on a table."]], [["A group of people walking in the rain with umbrellas."], ["A group of people standing in the water with umbrellas."]], [["Three people standing on skis in the snow."], ["Two women standing on skis in the snow."]], [["A person standing next to a pile of luggage."], ["A person standing next to a pile of luggage."]], [["A white truck parked on the side of a street."], ["A white car driving down a street with palm trees."]], [["A man walking on the tracks next to a train."], ["A man standing on the tracks next to a train."]], [["A woman riding a wave on a surfboard in the ocean."], ["A woman riding a wave on a surfboard in the ocean."]], [["A banana split is sitting on top of a table."], ["A person holding a banana with whipped cream and a knife."]], [["A hotel room with a sink and a table."], ["A living room with two lamps and an umbrella."]], [["A wooden bench next to a truck on a street."], ["Three trucks parked next to a fence on a street."]], [["A desk with two computer monitors and a laptop."], ["A desk with a computer sitting on top of it."]], [["A man riding a horse on a dirt road."], ["A man riding on the back of a brown horse."]], [["A person riding a dirt bike on a dirt road."], ["A person riding a dirt bike on a road."]], [["A man flying through the air while riding a snowboard."], ["A man riding skis on top of a snow covered slope."]], [["A pizza sitting on top of a kitchen counter."], ["A pizza sitting on top of a kitchen counter."]], [["A person with a backpack looking in a small refrigerator."], ["A person laying on the floor with a bunch of toys."]], [["A city street at night with cars and traffic lights."], ["A city street at night with cars and people."]], [["A group of people playing a game of frisbee."], ["Two women playing tennis on a tennis court."]], [["An open refrigerator with food in a room."], ["An open refrigerator with food in front of the ocean."]], [["A kitchen with a stove and a refrigerator."], ["A kitchen with a stove and a refrigerator."]], [["Two cats sitting in front of a window."], ["Two cats sitting on top of a window sill."]], [["A statue of a clock on top of a street."], ["A statue of a man playing with two clocks and ball."]], [["A television in a bathroom with two sinks."], ["A bathroom with a urinal and a television in it."]], [["A dog laying on the floor in a room with a desk."], ["A book shelf with books and a book shelf with books."]], [["A group of people standing in a field."], ["A group of people standing in front of a tree with frisbees."]], [["A cat sitting on the floor next to a bottle of water."], ["A cat sitting on top of a bottle of water."]], [["A group of people flying a kite on the beach."], ["Two people flying kites on the beach."]], [["A woman sitting in a chair holding an umbrella."], ["A woman sitting in a chair with an umbrella."]], [["Two giraffes standing in a field of grass."], ["A picture of an elephant walking in a field."]], [["A chair with a laptop computer sitting on a desk."], ["A desk with a phone and a chair and a computer."]], [["A bedroom with a bed and a fireplace."], ["A bedroom with a bed and a fireplace."]], [["A small bird sitting on a tree branch."], ["A bird sitting on top of a tree branch."]], [["A bus with a picture on the side of a street."], ["A bus parked in front of a building."]], [["A zebra standing next to a tree in a field."], ["A herd of zebras standing next to each other."]], [["A table with plates of pizza and a salad."], ["A table with two plates of pizza and a knife and pizza."]], [["A man sleeping in a bed with a cat."], ["A woman laying in bed with a cat."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["Three zebras standing next to each other on a field."], ["A group of zebras standing next to a glass vase."]], [["A group of jets flying in formation in the sky."], ["A group of jets flying in formation in the sky."]], [["A room with a laptop and a dresser."], ["A chair and a book next to a bed and a bed with a suitcase."]], [["A picture of a group of cupcakes on a table."], ["A picture of a cell phone with a bird on it."]], [["A group of children feeding a giraffe at a zoo."], ["A painting of people taking a picture of a piano."]], [["A group of people standing around with animals."], ["A group of people walking down a street with food."]], [["A little girl eating a banana."], ["A woman eating a banana on the floor."]], [["A bride and groom standing in a wedding."], ["A bride and groom cutting a wedding cake."]], [["A desk with a computer sitting on top of it."], ["A table with a picture of cell phones on it."]], [["A man and a woman standing in front of a fruit stand."], ["A group of people standing in front of a fruit stand."]], [["An airplane flying in the sky."], ["An airplane flying in a cloudy sky."]], [["A group of zebras grazing in a field."], ["A group of zebras grazing in a field."]], [["A small dog wearing a red bow tie sitting on steps."], ["A dog wearing a red tie sitting in a living room."]], [["A young boy standing next to a pile of apples."], ["A man standing in front of a fruit stand."]], [["Two elephants standing next to each other in a field."], ["An elephant standing next to a box on a beach."]], [["A picture of people on a bathroom floor."], ["A painting of a man hanging from the wall with cows."]], [["A train is on the tracks in a field."], ["A train is sitting on the tracks at a train station."]], [["A man and a woman sitting on a park bench."], ["A group of people sitting on park benches in a park."]], [["A train is sitting on the tracks."], ["A train is on the tracks in a train station."]], [["A tree with red apples on top of it."], ["A painting of trees in a field with trees."]], [["A man standing on a tennis court holding a ball."], ["A man standing on a tennis court holding a ball."]], [["Two people sitting next to an airplane in the desert."], ["Two people sitting under a surfboard on the beach with two dogs."]], [["A statue of a cow standing in front of a street."], ["A statue of a man standing on top of a statue."]], [["A kitchen with a stove and a table."], ["A bath tub with toys in a room with a cake."]], [["A cake and a table in a bakery."], ["A bunch of cakes and other desserts in a glass case."]], [["A dog in the side view mirror of a car."], ["A man standing in a rear view mirror of a car."]], [["A toy is sitting on a desk with a computer."], ["A toy is sitting next to a computer keyboard."]], [["A pizza and a can of soda on a table."], ["A pizza and a can of soda on the floor with a pizza."]], [["A desk with a laptop computer sitting on top of it."], ["An umbrella and a desk with a computer."]], [["A crowd of people standing on a street with a traffic light."], ["A crowd of people standing on a sidewalk with a building with a ben on it."]], [["A woman sitting at a table with two slices of pizza."], ["A man sitting at a table with plates of food."]], [["A truck driving down a road with hay."], ["A truck parked in the front of a fence."]], [["A group of street signs on a pole."], ["Three street signs in front of a brick wall."]], [["A group of surfboards sitting on top of a beach."], ["A group of chairs and an umbrella on the beach."]], [["A man standing on a tennis court with a ball."], ["A man standing on a tennis court holding a ball."]], [["A bathroom with a sink and a toilet in a mirror."], ["A bathroom with a toilet and a sink and a mirror."]], [["A man preparing food in a kitchen."], ["A group of people standing around a table with cakes."]], [["A group of people standing around a cake."], ["A black and white photo of a little girl and a dog with a plate of people."]], [["A woman riding a pink bike down a street."], ["An elephant walking down a city street with an umbrella."]], [["A plate of food and a glass of wine on a table."], ["A plate of food on a table with cups of coffee."]], [["A white cat laying on an office chair."], ["A cat laying on top of a black chair."]], [["A group of people standing in front of a bakery."], ["Two men looking at a display of donuts in a display case."]], [["A group of people with umbrellas."], ["A group of people with umbrellas in the rain with umbrellas."]], [["Two boats and a tractor sitting on a beach."], ["A black and white photo of a car in front of an old car."]], [["A refrigerator with a table on the front of it."], ["A refrigerator with pictures on the side of it."]], [["Two cups and a table with a table."], ["A cup sitting on top of a towel next to a toilet paper towel."]], [["Two planes flying next to each other in the sky."], ["A person flying a kite in the sky."]], [["A group of cars on a traffic light."], ["A group of cars driving down a road with umbrellas in front of a building."]], [["A person flying a kite in front of a lake."], ["A painting of a man holding an umbrella in the water."]], [["A bathroom with a sink and a tub."], ["A bathroom with a toilet and a shower."]], [["Two people sitting in front of a large umbrella."], ["Two men sitting under a blue umbrella in the grass."]], [["A small plane parked on display at a show."], ["An airplane parked in the sand in a beach."]], [["A teddy bear sitting next to a table with a tennis racket."], ["A young boy holding a tennis racket in his hand."]], [["A group of people sitting at a table eating food."], ["Two women sitting at tables with plates of food."]], [["A bunch of clocks on a wall in a room."], ["A mirror with a clock on the wall."]], [["A tray with a sandwich and fruit in it."], ["A fish in the back of a car with an apple."]], [["A cow and a calf standing in a field."], ["A baby calf standing next to a cow."]], [["A wooden bench sitting on the beach next to the ocean."], ["A painting of a bench sitting on the beach with the ocean."]], [["A tall tower with a clock on the top of it."], ["A tower with an orange on the top of it."]], [["A black cat sitting in the seat of a car."], ["A teddy bear sitting on the seat of a car."]], [["A group of cars are stopped at a traffic light."], ["A group of cars are parked in a traffic light."]], [["A group of people sitting at a table."], ["A group of people sitting at a picnic table with umbrellas."]], [["A man in a skirt and tie holding a bag."], ["A young man holding a dog and a tie."]], [["A woman riding a bike down a city street with cars."], ["A man riding a bike down a city street with cars."]], [["A group of zebras standing in the grass."], ["A group of zebras standing in the sand."]], [["A man walking down a sidewalk with luggage in front of a building."], ["A red fire hydrant in front of a building."]], [["A statue of a clock with two birds on top of it."], ["A statue of a man and a clock in front of a street."]], [["An airplane flying in the sky."], ["An airplane is sitting on a paper towel."]], [["A kitchen with a sink and a window."], ["A room with green walls and a table with white chairs."]], [["A teddy bear and a stuffed animal sitting on a bench."], ["Two teddy bears sitting on top of a wooden bench."]], [["A man and a woman holding a piece of cake."], ["A man and a woman eating a piece of cake."]], [["A man riding a motorcycle down a street."], ["A person riding a motorcycle on a dirt track with a beer."]], [["A plate of food and a bird on a table."], ["A plate with an orange and a vase of boat in the water."]], [["A yellow and pink bus parked in a field."], ["A yellow and red school bus parked in front of a building."]], [["A man and a woman sitting at a table with two pizzas."], ["Two men sitting at a table with two pizzas."]], [["A group of black and white cows in a barn."], ["A group of cows eating hay in a barn."]], [["A young boy sitting at a table with a plate of food."], ["A girl sitting at a table with a plate of food."]], [["Two people playing a video game on a wii."], ["Two women playing a video game on a wii."]], [["A group of men in red uniforms on horses."], ["Two men riding horses in front of a building."]], [["Two people standing on top of a display."], ["A picture of a person on top of a table."]], [["Two giraffes standing in a field of grass."], ["Two giraffes walking down a road with cars."]], [["A baseball player holding a bat on a field."], ["A baseball player holding a bat on a field."]], [["A teddy bear sitting on the side of a tree."], ["A teddy bear sitting next to trees."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A gold painting of a plane sitting on a street."]], [["A bathroom with a sink and a mirror."], ["A bathroom with a sink and a mirror."]], [["A baseball player holding a bat on a field."], ["A baseball player holding a bat on a field."]], [["A bunch of vegetables on a cutting board with a knife."], ["A bunch of vegetables on a cutting board with a knife."]], [["A group of people skiing on a snow covered mountain."], ["A group of people on skis on a snow covered slope."]], [["A toilet in a bathroom with a green wall."], ["A toilet with a bottle on top of it."]], [["A clock tower in the middle of a street."], ["A clock tower in the middle of a small building with graffiti."]], [["A clock in the middle of a field."], ["A clock on a pole in the middle of trees."]], [["A white toilet sitting in a bathroom with a desk."], ["A bottle of water sitting on top of a toilet."]], [["Two computer monitors and a keyboard on a desk."], ["A computer monitor sitting on top of a desk."]], [["A person holding a sandwich on a plate."], ["A person holding a sandwich with pickles and a table."]], [["A man riding a skateboard on a ramp."], ["A man riding a skateboard in a skate park."]], [["A person holding a piece of food in front of a building."], ["A person holding a donut in front of a store."]], [["A person taking a picture of a dog in a car window."], ["A person holding a remote control in the car."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A person standing on the sand next to a kite."]], [["A pair of scissors sitting on top of a wooden box."], ["A rainbow in the sky next to a pair of scissors in a box."]], [["A desk with a group of computers and a chair."], ["A group of beds and computers in a room."]], [["A man sitting in a hospital room holding a plate of food."], ["A man standing in a hospital room with a plate of food."]], [["A cat sitting next to a laptop computer."], ["A black and white cat standing in front of a refrigerator."]], [["A man hitting a tennis ball with a racket."], ["A woman standing on a tennis court holding a racket."]], [["A blue sign on the side of a street."], ["A sign on a city street with writing on it."]], [["A train is on the tracks."], ["A yellow and red train is on the tracks in the snow."]], [["A train is on a bridge over a city."], ["A bridge over a city with tall buildings."]], [["A group of cows standing in front of a church."], ["Three cows standing in front of a church with a clock tower."]], [["Two seagulls standing on the beach next to the water."], ["A seagull standing on the ground next to the water."]], [["A man riding on the back of an elephant."], ["A man riding on the back of a group of elephants."]], [["A desk with a laptop and a computer on it."], ["An office with a desk with a laptop computer."]], [["A train is on the tracks next to a road."], ["A green train is sitting on the tracks with lights."]], [["A black cat sitting on top of a television."], ["A black cat sitting on top of a television."]], [["A computer keyboard and a mouse on a desk."], ["A computer mouse and a keyboard on a table."]], [["Three people standing in front of a display of donuts."], ["Three men standing in front of a display of pastries."]], [["A yellow truck parked in a parking lot."], ["A painting of an old yellow truck parked in a parking lot."]], [["A group of people standing on a snow covered mountain."], ["A group of people standing on top of a mountain."]], [["A group of people riding skis down a snow covered slope."], ["A group of people skiing down a snow covered slope."]], [["A baseball player holding a bat on a field."], ["A baseball player holding a bat on a field."]], [["A woman standing on a tennis court holding a ball."], ["A woman standing on a tennis court holding a ball."]], [["A man standing on the beach holding a surfboard."], ["A man standing on the beach with a surfboard."]], [["A man swinging a tennis racket on a court."], ["A man riding a skateboard in the water."]], [["A group of people skiing down a snow covered slope."], ["A picture of snow covered mountains in the background."]], [["Two people standing in the snow with a snowboard."], ["Two people standing next to a motorcycle in the snow."]], [["A white plate of broccoli and meat on it."], ["A plate of broccoli and other vegetables on it."]], [["A person holding a sandwich and a drink."], ["A person holding a sandwich in their hand."]], [["A tray with a sandwich and a salad on a table."], ["A tray with a sandwich and a bottle of wine on a table."]], [["A cat laying on top of a laptop computer."], ["A cat laying on top of a laptop computer."]], [["A red fire hydrant in the middle of leaves."], ["A red fire hydrant in the middle of a forest."]], [["A kitchen with a stove and a refrigerator."], ["A white kitchen with a stove and a refrigerator."]], [["A group of people walking on a street with a double decker bus."], ["A group of people walking in the snow on a street."]], [["A group of horses standing next to a baby horse."], ["A group of horses standing next to a pile of hay."]], [["A bird standing in the water in a body of water."], ["A bird standing in the grass in the water."]], [["A baseball player throwing a ball on a field."], ["A baseball player throwing a ball on a field."]], [["A man sitting at a table looking at his cell phone."], ["A man sitting on a bench looking at his cell phone."]], [["A bus driving down a city street with a building."], ["A white bus driving down a city street with a building."]], [["A woman standing in a kitchen preparing food."], ["A man standing in a kitchen preparing food."]], [["A man doing a trick on a skateboard in the air."], ["A painting of a man doing a trick on a skateboard."]], [["A pizza sitting on top of a table."], ["A pizza sitting on top of a table at night."]], [["A row of toilets in a bathroom with a window."], ["A row of chairs sitting in a bathroom."]], [["A plate of food with broccoli and a table."], ["A group of bowls of flowers in a bowl."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A view of a view of a car with a surfboard in the sky."]], [["A man walking a bike down a street."], ["A man walking a bike down a street with signs."]], [["A plate of food with rice and vegetables on a table."], ["A plate of rice and broccoli on a table."]], [["A small plane sitting on top of an airport runway."], ["An airplane sitting on top of an airport runway."]], [["A wooden bench sitting in the middle of a park."], ["A bench sitting on the side of a sidewalk."]], [["A wooden table with plates of food on it."], ["A glass vase with flowers on a table."]], [["A man standing on the beach next to the ocean."], ["A group of people standing on a beach in the ocean."]], [["A cat is standing on the wall of a room."], ["A bathroom with graffiti on the wall and a tree."]], [["A man and a woman standing next to each other."], ["A man in a suit and tie holding a drink."]], [["A dog wearing a helmet sitting next to a motorcycle."], ["A dog wearing a helmet standing next to a motorcycle."]], [["A group of young people flying kites."], ["A group of people holding skateboards in front of houses."]], [["A woman taking a picture of a man on a cell phone."], ["A woman taking a picture of themselves with her cell phone."]], [["A street sign on a wooden pole."], ["A street sign on a wooden pole next to a street sign."]], [["A person riding a skateboard at a skate park."], ["A man doing a trick on a skateboard in a pool."]], [["A group of people with luggage at an airport."], ["A group of people standing at an airport."]], [["A woman in a black dress standing in front of a refrigerator."], ["A woman holding a glass of orange juice in front of a door."]], [["A group of street signs in front of a tall building."], ["A group of street signs in front of a building."]], [["A man riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard in the ocean."]], [["A man in a white shirt and tie."], ["A group of people playing a video game with a wii controller."]], [["A blue suitcase sitting next to a pair of shoes."], ["A pair of shoes and a suitcase on the floor next to a couch."]], [["A piece of chocolate cake with a drink in it."], ["A person holding a large sandwich in their hand."]], [["A plate of food on a table with a glass of wine."], ["A plate of food on a table with a salad."]], [["A plate of food with a salad and a table."], ["A plate of stairs with a salad and a salad."]], [["A large group of trucks parked in a parking lot."], ["A group of people standing in front of a building with umbrellas."]], [["A herd of elephants walking in a field."], ["A herd of elephants standing in a field."]], [["A green broccoli plant growing in a field."], ["A large green broccoli plant in a garden."]], [["Two teddy bears sitting next to a wall."], ["A teddy bear sitting on top of two cups of coffee."]], [["A group of men standing in a room."], ["A doll with a cat sitting next to a window."]], [["A person riding a horse jumping over an obstacle."], ["A woman riding a horse jumping over an obstacle."]], [["A group of people riding in a horse drawn carriage."], ["Two women sitting on a bench with a horse drawn carriage."]], [["A white sign in front of a brick building."], ["A street sign in front of a brick building."]], [["A woman holding a tennis racket in front of a crowd."], ["A man holding a tennis ball on a tennis court."]], [["A blender with food in it on a counter."], ["A blender standing in a kitchen."]], [["A cat laying on top of a suitcase."], ["A cat laying on top of a suitcase."]], [["A donut hanging from a christmas tree."], ["A fish in its mouth with a christmas tree in its mouth."]], [["A kitchen with a stove and a table."], ["A kitchen with white cabinets and a table."]], [["An orange tree with a green leaves on it."], ["A tree in the middle of a field."]], [["A man standing next to a bike on a street."], ["Two men standing next to a fire hydrant."]], [["A group of people holding a kite in a field."], ["A group of people standing in a field with a kite."]], [["A man riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard."]], [["A black and white photo of two people in a boat in the water."], ["A large balloon in the water next to the ocean with people."]], [["A young boy taking a picture of a cell phone."], ["A man taking a picture of a cell phone in a crowd."]], [["An airplane parked on the runway at an airport."], ["An airplane sitting on top of an airport runway."]], [["A person skiing down a snow covered slope."], ["A group of people skiing in the snow."]], [["A group of people riding horses on the beach."], ["A group of people riding horses on the beach."]], [["A group of people sitting on benches in a park."], ["A man sitting on a bench with a guitar."]], [["A bowl of food with vegetables and a fork."], ["A container of rice and vegetables next to a pair of scissors."]], [["A man and a woman on a skateboard with fire."], ["A man doing a trick on a skateboard in front of a fire."]], [["A baseball player throwing a ball on a field."], ["A baseball player throwing a ball on a field."]], [["An elephant standing next to a tree in a field."], ["An elephant and a baby elephant standing on top of it."]], [["A black refrigerator in a room with a table."], ["A black refrigerator in a room with a table."]], [["A pole with two signs on it on a street."], ["A group of street signs on a pole on a street."]], [["A woman sitting on a motorcycle with a side car."], ["A woman standing on a beach with a surfboard."]], [["A bunch of oranges in a bowl on a table."], ["A bowl of oranges sitting on top of a table."]], [["A garden with plants in the middle of a building."], ["A house with plants in front of a house with a house."]], [["A man and a group of sheep in a field."], ["A man and two dogs with sheep in a field."]], [["A cat looking at a statue of a bear."], ["A dog sitting in front of a door with noodles."]], [["A woman holding a baseball bat next to a table."], ["A woman holding a baseball bat in front of a crowd."]], [["A group of zebras standing next to a fence."], ["Three zebras standing in the dirt in front of a fence."]], [["A polar bear standing next to a rock."], ["A polar bear on top of rocks."]], [["A birthday cake and a bag on a table."], ["A bunch of remote controls sitting on a table."]], [["A man riding a skateboard at a skate park."], ["A man doing a trick on a skateboard at a skate park."]], [["A building with a clock on the top of it."], ["A picture of people on the top of a building with a clock."]], [["A woman standing next to a brown horse."], ["A brown cow standing next to a group of people."]], [["A person standing on top of a skateboard."], ["A person riding on a skateboard on a bed."]], [["A black bear standing on top of a log."], ["A large tree in a field with trees."]], [["A man wearing a santa hat holding a dog in front of a christmas tree."], ["A man in a santa hat holding a dog in front of christmas decorations."]], [["A kitchen with a refrigerator and a microwave."], ["A kitchen with a sink and a stove."]], [["A person riding skis on a rail in the snow."], ["A man riding skis on a rail in the snow."]], [["A food truck parked in front of a street."], ["A group of people riding bikes in front of a food truck."]], [["A basket of fruit sitting on a table."], ["A basket of fruit in a table."]], [["A clock tower in the middle of a street."], ["A clock tower on the side of a street with cars."]], [["A group of women standing in front of a sign."], ["A group of women standing next to each other holding bananas."]], [["A brown dog sitting next to a black and white dog."], ["A dog is sitting in front of a man with a frisbee in its mouth."]], [["A pizza with meat and vegetables on top of a table."], ["A pizza with cheese and vegetables on a table."]], [["A group of people standing in a store with bananas."], ["A group of people standing in front of a refrigerator."]], [["A young boy playing a video game in a living room."], ["Two people playing a video game on a wii."]], [["A person riding a skateboard at a skate park."], ["A woman riding a skateboard in a parking lot."]], [["A man and a woman eating a piece of pizza."], ["Two women brushing their teeth in a city."]], [["A white toilet in a bathroom with a window."], ["A toilet in the snow in front of a window."]], [["A plate of chicken and potatoes and vegetables."], ["A plate of chicken and vegetables with a dog."]], [["An airplane flying in the sky."], ["A group of planes and a plane on a table."]], [["A person laying on a bed in a hotel room."], ["A picture of a woman brushing her teeth in a bedroom."]], [["Two people playing a video game with a wii."], ["Two men playing a video game with a wii."]], [["A group of street signs on a pole on a street."], ["Two street signs on the side of a road."]], [["A girl sitting at a table with a laptop computer."], ["A desk with a laptop computer sitting on top of it."]], [["A dog standing on top of a skateboard."], ["A small dog wearing a scarf on a skateboard."]], [["A blue bike parked in front of a red and white door."], ["A bike parked in front of a building."]], [["A plate with a piece of cake on a table."], ["A sandwich on a plate on a table."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A black and white photo of two people riding on a horse."], ["A person riding horses in the snow at night."]], [["A white truck parked on the side of a street sign."], ["A street sign on the side of a street sign."]], [["A black and white photo of boats parked next to a dock."], ["A group of boats parked next to a dock in a city."]], [["A person holding a cell phone in their hand."], ["A person holding a cell phone in their hand."]], [["A young boy swinging a tennis racket at a tennis ball."], ["A man hitting a tennis ball with a racket."]], [["A bedroom with a bed and a television."], ["A living room with chairs and a television with a table."]], [["A group of zebras eating from a trough."], ["A herd of zebras and elephants in an elephant."]], [["A living room with a couch and a television."], ["A living room with a couch and a yellow table."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A group of parking meters on a city street."], ["A row of parking meters in the snow."]], [["A man wearing a helmet riding a skateboard down a street."], ["A man wearing a helmet riding a skateboard down a street."]], [["A bride and groom cutting a wedding cake."], ["A bride and groom standing in front of a wedding cake."]], [["A man sitting at a table with an umbrella."], ["A woman sitting at a table with a cake with candles."]], [["A train is on the tracks next to a river."], ["A train is on a bridge over a river."]], [["A traffic light on the side of a street."], ["An umbrella sitting on top of a street with a building."]], [["Young boys in ties jumping in the air."], ["Young boys in the rain with ties and ties."]], [["A man playing a video game in a living room."], ["A man riding a skateboard down a ramp."]], [["A woman in a scarf looking at her cell phone."], ["A woman looking at her cell phone with a candle."]], [["A cat sitting next to a brick wall."], ["A cat is sitting on the couch with a hose."]], [["A small bathroom with a toilet and a table."], ["A small bathroom with a toilet and a shower."]], [["A person riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A kitchen with a table and a chair."], ["A dog sitting in an office with a teddy bear."]], [["A little girl sitting in a bowl on a table."], ["A little girl eating out of a bowl."]], [["A group of ducks swimming in a body of water."], ["A flock of birds standing in the water."]], [["A man standing on the back of a truck."], ["A man walking on the back of a truck."]], [["Two motorcycles parked next to people on a street."], ["A group of people standing next to motorcycles."]], [["A black and white cow standing next to a man."], ["A woman standing next to a group of cows eating hay."]], [["A black and white photo of people on a beach with sail boats."], ["A group of people riding a wave in the ocean."]], [["A motorcycle parked on the side of a road."], ["A group of people standing on the side of a road."]], [["Two people in a red boat in the water."], ["A group of people in a boat in the water."]], [["A herd of sheep standing in front of a building."], ["A crowd of people holding balloons in the street."]], [["A suitcase sitting on the ground in the dirt."], ["A blue suitcase sitting on the grass next to a body of water."]], [["A man riding a skateboard at a skate park."], ["A man riding a skateboard at a skate park."]], [["A man and a child on a snowboard down a snow covered slope."], ["A man standing in front of a stuffed animal and ball."]], [["A cat and a dog looking at a window."], ["A cat looking out of a window at a dog."]], [["A baseball player standing on the mound."], ["A young man standing on a baseball field holding a remote control."]], [["A man riding on the back of a horse."], ["A man riding on the back of a truck."]], [["A bedroom with a bed and a table."], ["Two beds in front of a mirror."]], [["A small bed with bottles of water on it."], ["A bed with bottles sitting in the middle of it."]], [["A pizza is in an oven."], ["A teddy bear sitting in an open oven with fruit."]], [["A yellow and red bird sitting on a tree branch."], ["A yellow bird sitting on a tree branch."]], [["Two people standing in beds with a woman."], ["Two men standing in the back of a truck."]], [["A man standing in front of a refrigerator."], ["A woman standing in front of a refrigerator."]], [["An elephant standing next to a fence in a zoo."], ["Two elephants standing next to each other in a zoo."]], [["A kitchen sink with dishes in it."], ["A bathroom sink with a candle and other items on a table."]], [["Three hot dogs with toppings on top of a table."], ["Hot dogs and ketchup and mustard on a table."]], [["A group of birds sitting on top of a wooden roof."], ["Two cats sitting on top of a roof."]], [["A bus driving down a street in the rain."], ["A double decker bus driving down a street in the rain."]], [["Two men playing a game of soccer on a field."], ["Two men standing next to each other holding tennis rackets."]], [["An airplane flying in the sky over a road."], ["A group of people riding skis down a snow covered slope."]], [["A black cat sitting in the grass."], ["A black cat wearing a field of grass."]], [["A bathroom with a toilet and a bath tub."], ["A bathroom with a toilet and a bath tub."]], [["A laptop computer sitting on top of a wooden table."], ["A computer keyboard sitting on top of a desk."]], [["A group of people standing around a bench."], ["A group of people standing around a body of water."]], [["A bunch of bread sitting on a plate next to a keyboard."], ["A group of pillows on a bed."]], [["A cat standing in a bathroom next to a toilet."], ["A cat sitting on top of a row of toilets."]], [["A person riding a wave on a surfboard in the ocean."], ["A woman riding a wave on a surfboard in the ocean."]], [["A man taking a picture of a cell phone."], ["A man looking at his cell phone in the air."]], [["A man standing under a sign in the grass."], ["A man standing in the grass holding a sign."]], [["A man doing a trick on a skateboard at a skate park."], ["A person riding a skateboard at a skate park."]], [["A woman walking a small white dog down a sidewalk."], ["A man walking a dog down a street with a skateboard."]], [["A man riding a horse on a field next to the water."], ["A person riding a horse in front of a mountain."]], [["A man doing a trick on a skateboard down a rail."], ["A man riding a skateboard down a rail."]], [["Four pictures of a bowl of food on a table."], ["Four pictures of a bowl of soup with eggs."]], [["A white plate with a sandwich on a table."], ["A sandwich and a cell phone in a basket."]], [["Two hot dogs on a white plate."], ["Two hot dogs and green peppers on a paper towel."]], [["A black horse standing in a field."], ["A small brown horse standing next to a field."]], [["A boat is sitting in the water next to a beach."], ["A boat is sitting in the water next to the beach."]], [["A bathroom with a sink and a mirror."], ["A bathroom with a sink and a mirror."]], [["A red fire hydrant on the side of a street."], ["An orange fire hydrant on the side of a street."]], [["A toilet with the seat up in a bathroom."], ["A toilet with the seat up sitting on top of it."]], [["A group of people standing next to a group of signs."], ["A man standing in front of a group of signs."]], [["A cat laying on top of a laptop computer."], ["A cat laying on top of a table."]], [["A man standing on a tennis court holding a racket."], ["A man holding a tennis racket on a tennis court."]], [["A cat sitting in front of a television."], ["A cat sitting in front of a television."]], [["An airplane flying in the sky with a flag."], ["An airplane flying in the sky with an american flag."]], [["A group of stuffed teddy bears sitting on a table."], ["A group of stuffed teddy bears sitting in chairs in front of a screen."]], [["A bathroom with a toilet and a sink and a tub."], ["A bathroom with a toilet and a sink and a tub."]], [["A group of bikes parked next to a building."], ["A street sign in front of a building."]], [["A man riding a snowboard down a snow covered slope."], ["Two pictures of a person on a snowboard in the snow."]], [["A large clock in the middle of a building."], ["A large clock in front of a building."]], [["A boat is sitting in the water next to a lake."], ["A white boat sitting in the water next to a lake."]], [["An orange train is on the tracks in a forest."], ["An orange train is sitting on the tracks in the woods."]], [["A man doing a trick on a skateboard on a city street."], ["A woman riding a skateboard down a city street."]]], "scores": {"meteor": [[0.7853703279064436, 0.4043478260869566], [0.47908863920099876, 0.3795918367346939], [0.7585268884703913, 0.485126253891387], [0.28774193548387095, 0.15151515151515152], [0.5555555555555556, 0.2554744525547445], [0.372, 0.36831683168316837], [0.3896604938271605, 0.4064337599446558], [0.7485875706214691, 0.5424733996162567], [0.6944444444444444, 0.4440665154950869], [0.3468406593406593, 0.6400966183574879], [0.46875, 0.18072289156626503], [0.7060399917542773, 0.7060399917542773], [0.3468406593406593, 0.5068181818181817], [0.5373493975903614, 0.5373493975903614], [0.8017676767676769, 0.31525423728813556], [0.43069584736251404, 0.32206632653061223], [0.8950617283950617, 0.5681818181818182], [0.6989795918367346, 0.5504317111459968], [0.616925669350309, 0.13761467889908252], [0.5645569620253165, 0.23023023023023023], [0.3506944444444444, 0.3357712765957447], [0.5373493975903614, 0.29224537037037035], [0.9054545454545455, 0.9054545454545455], [0.5251825500842539, 0.5251825500842539], [0.6861724281549355, 0.6861724281549355], [0.6310013717421126, 0.5438202247191011], [0.8918539325842695, 0.5569306930693068], [0.33929649758454106, 0.7789062500000001], [0.5681818181818182, 0.3468406593406593], [0.22471910112359547, 0.31250000000000006], [0.5160550458715595, 0.4711111111111111], [0.15151515151515152, 0.19607843137254904], [0.6756756756756757, 0.28956422018348627], [0.6792413935271077, 0.6592637054821929], [0.6792413935271077, 0.5625], [0.5876795162509448, 0.4732510288065843], [0.7521527129370266, 0.6670168067226891], [0.9041027559546079, 0.9041027559546079], [0.6691919191919192, 0.6320224719101123], [0.5747427175998604, 0.6002938034188035], [0.25, 0.20000000000000004], [0.5439024390243904, 0.6657910689028086], [0.5011235955056179, 0.412087912087912], [0.8436213991769549, 0.8767791460099152], [0.5783794999481273, 0.5813754073057795], [0.32206632653061223, 0.44158415841584164], [0.9086363636363638, 0.6289424860853432], [0.3835051546391753, 0.5353535353535354], [0.5160550458715595, 0.23662551440329216], [0.7789062500000001, 0.8950617283950617], [0.5681818181818182, 0.372], [0.372, 0.4263888888888889], [0.618131868131868, 0.5373493975903614], [0.7562196601941749, 0.3611650485436893], [0.446, 0.446], [0.6388888888888888, 0.290625], [0.8017676767676769, 0.9995], [0.6233062330623306, 0.5439024390243904], [0.8819444444444444, 0.28714107365792757], [0.40879120879120884, 0.29224537037037035], [0.6953898514851486, 0.5247058823529411], [0.66167290886392, 0.37128712871287134], [0.8629377676996723, 0.4505050505050505], [0.39453125, 0.20444444444444443], [0.4505050505050505, 0.21739130434782605], [0.45731707317073167, 0.3155006858710563], [0.40879120879120884, 0.4505050505050505], [0.3116531165311653, 0.15], [0.40879120879120884, 0.4000000000000001], [0.565083176127594, 0.2032520325203252], [0.46875, 0.46875], [0.8993827160493828, 0.6089882761615284], [0.625, 0.7471655328798186], [0.29760000000000003, 0.6332138590203108], [0.5975308641975308, 0.11764705882352941], [0.9139118457300276, 0.6763636363636364], [0.782267115600449, 0.782267115600449], [0.46875, 0.46875], [0.49010989010989015, 0.4043478260869566], [0.5796973961998594, 0.6490885416666666], [0.6410256410256411, 0.5747427175998604], [0.37763136750763293, 0.3279411764705883], [0.1648351648351648, 0.1111111111111111], [0.4101694915254237, 0.3126050420168068], [0.625, 0.3234880450070324], [0.4440665154950869, 0.446], [0.7585268884703913, 0.5681818181818182], [0.5625, 0.8993827160493828], [0.4207547169811321, 0.37796610169491524], [0.1875, 0.5439024390243904], [0.5260869565217392, 0.8228395061728395], [0.7687074829931974, 0.7687074829931974], [0.2222711267605634, 0.2547945205479452], [0.1834862385321101, 0.29224537037037035], [0.5902439024390245, 0.5506172839506173], [0.4732510288065843, 0.6226379440665155], [0.7602601480152501, 0.7602601480152501], [0.4955555555555556, 0.4955555555555556], [0.6405895691609977, 0.5503634475597092], [0.8017676767676769, 0.31562500000000004], [0.4955555555555556, 0.5011235955056179], [0.5975308641975308, 0.5975308641975308], [0.9993141289437586, 0.49010989010989015], [0.7145928899082569, 0.3506944444444444], [0.5952065677966102, 0.31525423728813556], [0.446, 0.4505050505050505], [0.7687074829931974, 0.66167290886392], [0.8211575489862951, 0.25302530253025296], [0.5506172839506173, 0.24390243902439024], [0.1875, 0.3116531165311653], [0.650318287037037, 0.36831683168316837], [0.7282110091743119, 0.7282110091743119], [0.6777108433734939, 0.5439024390243904], [0.38110236220472443, 0.27479091995221033], [0.38490853658536583, 0.06410256410256411], [0.7668240850059032, 0.6006127782283501], [0.1851851851851852, 0.3546348314606741], [0.6962184873949581, 0.6962184873949581], [0.6310013717421126, 0.3811965811965813], [0.3675766283524904, 0.37796610169491524], [0.35866477272727276, 0.5162738496071829], [0.7913056930693071, 0.6792413935271077], [0.6, 0.5574156746031746], [0.8918539325842695, 0.6157965194109771], [0.5563218390804598, 0.44158415841584164], [0.30303030303030304, 0.3535353535353535], [0.6792413935271077, 0.6792413935271077], [0.5506172839506173, 0.46296296296296297], [0.7059558517284465, 0.5739795918367346], [0.15151515151515152, 0.15151515151515152], [0.618131868131868, 0.46890927624872564], [0.6898846495119787, 0.40879120879120884], [0.5452674897119341, 0.234375], [0.6532519549876025, 0.5679012345679012], [0.7309228039041704, 0.7309228039041704], [0.6918367346938775, 0.4732510288065843], [0.38027108433734946, 0.49074074074074076], [0.5202546296296297, 0.4024496937882765], [0.5698720166032515, 0.5698720166032515], [0.5773420479302832, 0.5016339869281046], [0.5739795918367346, 0.6155365371955235], [0.5164292279411764, 0.5164292279411764], [0.34128440366972473, 0.11029411764705882], [0.46499999999999997, 0.26081871345029245], [0.372, 0.4505050505050505], [0.5294873855053832, 0.7081753669680179], [0.32327586206896547, 0.32327586206896547], [0.4263888888888889, 0.6724489795918367], [0.5563218390804598, 0.21505376344086022], [0.8200597312095569, 0.8200597312095569], [0.6476468138275718, 0.6411049268192124], [0.5306603773584906, 0.4295051353874883], [0.3896604938271605, 0.4536585365853659], [0.8918539325842695, 0.8918539325842695], [0.6880733944954129, 0.45731707317073167], [0.3, 0.3872], [0.4440366972477064, 0.4440366972477064], [0.2100840336134454, 0.08547008547008547], [0.4810495626822157, 0.3962101636520241], [0.27777777777777773, 0.1851851851851852], [0.6918367346938775, 0.4505050505050505], [0.43509070294784574, 0.13793103448275862], [0.5160550458715595, 0.34403669724770647], [0.46875, 0.234375], [0.36351165980795613, 0.36351165980795613], [0.20000000000000004, 0.21978021978021975], [0.8103975535168196, 0.7145928899082569], [0.6222271517302573, 0.6222271517302573], [0.9995, 0.6289424860853432], [0.2583333333333333, 0.23379629629629628], [0.40879120879120884, 0.618131868131868], [0.9993141289437586, 0.616925669350309], [0.8287608596250572, 0.7181571815718157], [0.7500000000000001, 0.8017676767676769], [0.2929133858267717, 0.34307065217391297], [0.25252525252525254, 0.25252525252525254], [0.37500000000000006, 0.13636363636363635], [0.5616605616605616, 0.5679012345679012], [0.39480452674897115, 0.2388369678089304], [0.46875, 0.5439024390243904], [0.3546348314606741, 0.3546348314606741], [0.5575, 0.9993141289437586], [0.6724489795918367, 0.5569306930693068], [0.4213483146067415, 0.21978021978021975], [0.5399659863945577, 0.19965277777777776], [0.7948022959183674, 0.47018807523009204], [0.18018018018018017, 0.1834862385321101], [0.5724489795918367, 0.2577319587628866], [0.8301839254220206, 0.9041027559546079], [0.5739795918367346, 0.3188131313131313], [0.4641544117647058, 0.38834397810218974], [0.4179775280898876, 0.4179775280898876], [0.6320224719101123, 0.625], [0.5769944341372912, 0.1875], [0.7740169238427077, 0.5975308641975308], [0.6944444444444444, 0.5157198014340871], [0.5377777777777778, 0.28714107365792757], [0.8421440865502825, 0.8421440865502825], [0.8251217578434704, 0.45731707317073167], [0.6600900423728814, 0.6600900423728814], [0.4849137931034482, 0.3005952380952382], [0.4536585365853659, 0.5831325301204818], [0.6578144078144077, 0.21978021978021975], [0.40888888888888886, 0.37796610169491524], [0.7014492753623188, 0.4213483146067415], [0.4523364485981308, 0.35046728971962615], [0.6233062330623306, 0.2808302808302808], [0.9670781893004115, 0.8627717391304347], [0.32763532763532766, 0.2373417721518987], [0.7361111111111112, 0.7361111111111112], [0.5555555555555555, 0.5404974489795918], [0.484, 0.13888888888888887], [0.5318681318681319, 0.3116531165311653], [0.5257009345794392, 0.2869318181818182], [0.43684710351377026, 0.34307065217391297], [0.6091911764705883, 0.36831683168316837], [0.4227272727272727, 0.40879120879120884], [0.3188131313131313, 0.3188131313131313], [0.47959183673469385, 0.47959183673469385], [0.45731707317073167, 0.2505446623093682], [0.4295051353874883, 0.3746811224489796], [0.34766355140186916, 0.2303832116788321], [0.2720905172413793, 0.3747899159663866], [0.4641544117647058, 0.36831683168316837], [0.3177966101694915, 0.41333333333333333], [0.7500000000000001, 0.555775708341589], [0.8861997310842195, 0.4049744897959184], [0.544452519379845, 0.3835051546391753], [0.8466372282608694, 0.618131868131868], [0.32206632653061223, 0.4505050505050505], [0.3872, 0.29523809523809524], [0.5160550458715595, 0.34128440366972473], [0.41360294117647056, 0.41360294117647056], [0.6250000000000001, 0.7309228039041704], [0.6071019473081329, 0.37500000000000006], [0.8918539325842695, 0.2949766355140187], [0.4732510288065843, 0.275735294117647], [0.5612244897959183, 0.6157965194109771], [0.5739795918367346, 0.9041027559546079], [0.4440366972477064, 0.33938172043010756], [0.12820512820512822, 0.5373493975903614], [0.5506172839506173, 0.46106557377049184], [0.4970472440944882, 0.5009920634920636], [0.19132653061224492, 0.43604651162790703], [0.618131868131868, 0.4213483146067415], [0.2525, 0.22727272727272727], [0.40917431192660547, 0.350076103500761], [0.3599374021909233, 0.3984942886812045], [0.5377777777777778, 0.3468406593406593], [0.1111111111111111, 0.23148148148148148], [0.7636335784313727, 0.5318681318681319], [0.5698720166032515, 0.5913134484563056], [0.2735294117647059, 0.2601398601398601], [0.3506944444444444, 0.11718749999999999], [0.41333333333333333, 0.16853932584269662], [0.7309228039041704, 0.4795698924731184], [0.6400966183574879, 0.3468406593406593], [0.6724489795918367, 0.446], [0.5902439024390245, 0.3468406593406593], [0.35046728971962615, 0.35328467153284676], [0.5625, 0.3340595497458243], [0.36831683168316837, 0.290625], [0.5438202247191011, 0.5438202247191011], [0.3074380165289256, 0.3289473684210526], [0.41802832244008714, 0.38070436507936506], [0.5563218390804598, 0.28714107365792757], [0.6465763875643715, 0.2869318181818182], [0.7711943069306932, 0.446], [0.6087662337662337, 0.5587622254288921], [0.864795918367347, 0.5076058201058201], [0.446, 0.39821428571428563], [0.7270233196159123, 0.530952380952381], [0.7515909589642309, 0.8819444444444444], [0.18790849673202614, 0.3155006858710563], [0.7017173423423423, 0.5113636363636364], [0.8880208333333333, 0.7687074829931974], [0.5506172839506173, 0.6784188034188035], [0.22030651340996166, 0.15889830508474576], [0.6225, 0.3194444444444444], [0.6376262626262627, 0.6376262626262627], [0.618131868131868, 0.42613636363636365], [0.2118288590604027, 0.1694915254237288], [0.6284569902727446, 0.6284569902727446], [0.6360544217687074, 0.6360544217687074], [0.4043478260869566, 0.4043478260869566], [0.6775541946145621, 0.5487060546875001], [0.4732510288065843, 0.29224537037037035], [0.8072916666666667, 0.7835477941176472], [0.32206632653061223, 0.39118246687054015], [0.6859756097560975, 0.18750000000000003], [0.6310013717421126, 0.45925925925925926], [0.703125, 0.5902439024390245], [0.6465763875643715, 0.5452674897119341], [0.9163223140495868, 0.6726694915254237], [0.5406060606060606, 0.3384038800705468], [0.5361402671755726, 0.2485236220472441], [0.9996243425995492, 0.49145299145299143], [0.372, 0.37878787878787884], [0.6332138590203108, 0.5204301075268818], [0.44592696629213474, 0.48478260869565226], [0.7687074829931974, 0.3468406593406593], [0.6792413935271077, 0.31562500000000004], [0.32877604166666663, 0.33513513513513515], [0.625, 0.28714107365792757], [0.5888888888888889, 0.6490885416666666], [0.647130647130647, 0.5318681318681319], [0.654320987654321, 0.6284097797534854], [0.8722527472527472, 0.4955555555555556], [0.582287961055982, 0.4766949152542372], [0.854119425547997, 0.854119425547997], [0.5300453514739228, 0.6226379440665155], [0.634712600636585, 0.6724489795918367], [0.8918539325842695, 0.9449404761904763], [0.5902439024390245, 0.4536585365853659], [0.3547523427041499, 0.35907859078590787], [0.7098765432098765, 0.7098765432098765], [0.8993827160493828, 0.8993827160493828], [0.8654513888888888, 0.7471655328798186], [0.4737654320987654, 0.2525], [0.45731707317073167, 0.3188131313131313], [0.37878787878787884, 0.446], [0.5975308641975308, 0.5506172839506173], [0.5503634475597092, 0.5281690140845071], [0.5667811679127096, 0.4962243797195253], [0.7212094907407407, 0.7212094907407407], [0.6792413935271077, 0.7789062500000001], [0.5076628352490421, 0.5424733996162567], [0.6800326497296194, 0.4726890756302521], [0.5902439024390245, 0.4481927710843373], [0.6657910689028086, 0.5975308641975308], [0.5208333333333333, 0.5208333333333333], [0.5989583333333334, 0.4518072289156627], [0.6443520642201835, 0.6384943181818182], [0.9990234375, 0.864795918367347], [0.4634661835748792, 0.4043478260869566], [0.5931718481785236, 0.6443520642201835], [0.15, 0.125], [0.4505050505050505, 0.13888888888888887], [0.6215431415929203, 0.24572649572649571], [0.7948022959183674, 0.6918367346938775], [0.48478260869565226, 0.36443494776828117], [0.8211575489862951, 0.5542695473251028], [0.4361263736263736, 0.3188131313131313], [0.5452674897119341, 0.45510204081632655], [0.7789062500000001, 0.6849868660335421], [0.4536585365853659, 0.20495129870129872], [0.8950617283950617, 0.34128440366972473], [0.8950617283950617, 0.7789062500000001], [0.32538659793814434, 0.2735294117647059], [0.6155365371955235, 0.6545430672268908], [0.3639097744360902, 0.35532407407407407], [0.5424733996162567, 0.36831683168316837], [0.1851851851851852, 0.125], [0.6320203400121432, 0.5183697753978879], [0.7521527129370266, 0.6600900423728814], [0.8030303030303031, 0.7309228039041704], [0.755560651226783, 0.13513513513513514], [0.41360294117647056, 0.5504317111459968], [0.2929133858267717, 0.46296296296296297], [0.3153153153153153, 0.40917431192660547], [0.4536585365853659, 0.6233062330623306], [0.5402650356778795, 0.31000000000000005], [0.600907029478458, 0.600907029478458], [0.5076628352490421, 0.4445422535211268], [0.8099489795918368, 0.46464646464646464], [0.66167290886392, 0.10989010989010987], [0.6988249845392702, 0.6360544217687074], [0.5318681318681319, 0.32004830917874394], [0.6988249845392702, 0.6988249845392702], [0.6114130434782608, 0.2293577981651376], [0.3896604938271605, 0.12820512820512822], [0.7361111111111112, 0.7361111111111112], [0.5269186712485682, 0.3757440476190476], [0.34766355140186916, 0.6284569902727446], [0.3444444444444445, 0.234375], [0.5863023175371843, 0.5076628352490421], [0.4766949152542372, 0.7231040564373898], [0.9530428249436514, 0.66167290886392], [0.4619272516364239, 0.2505446623093682], [0.4536585365853659, 0.2976190476190476], [0.5377777777777778, 0.1111111111111111], [0.46875, 0.605], [0.6944444444444445, 0.6944444444444445], [0.40917431192660547, 0.23662551440329216], [0.4505050505050505, 0.3125], [0.41360294117647056, 0.22409638554216865], [0.7212094907407407, 0.7212094907407407], [0.446, 0.24096385542168677], [0.625, 0.625], [0.618131868131868, 0.7597604259094942], [0.8833333333333334, 0.625], [0.5530265748031497, 0.5530265748031497], [0.5616605616605616, 0.4000000000000001], [0.5902439024390245, 0.6859756097560975], [0.6792413935271077, 0.1694915254237288], [0.5199864498644986, 0.5137215528781793], [0.46296296296296297, 0.5831325301204818], [0.8918539325842695, 0.29040404040404044], [0.29523809523809524, 0.13888888888888887], [0.4955555555555556, 0.5495818399044207], [0.738954922628392, 0.598404255319149], [0.703125, 0.45074722802506817], [0.6388888888888888, 0.45925925925925926], [0.8880208333333333, 0.125], [0.7545454545454545, 0.6637168141592921], [0.5841316118284048, 0.5215419501133786], [0.9575062901873077, 0.806697108066971], [0.37878787878787884, 0.5010893246187365], [0.8918539325842695, 0.7120253164556962], [0.6988249845392702, 0.4043478260869566], [0.551470588235294, 0.34090909090909094], [0.6447688564476887, 0.3542857142857143], [0.5813754073057795, 0.3811965811965813], [0.37500000000000006, 0.1694915254237288], [0.4359925788497217, 0.4464285714285715], [0.8819444444444444, 0.6411049268192124], [0.485126253891387, 0.08620689655172413], [0.39480452674897115, 0.372], [0.3599374021909233, 0.25813692480359146], [0.5563218390804598, 0.06097560975609756], [0.46890927624872564, 0.34307065217391297], [0.6411049268192124, 0.5162738496071829], [0.4043478260869566, 0.30864197530864196], [0.49010989010989015, 0.40760869565217384], [0.8918539325842695, 0.5679012345679012], [0.5212782787533617, 0.600907029478458], [0.618131868131868, 0.5438202247191011], [0.9996243425995492, 0.9996243425995492], [0.4795698924731184, 0.3896604938271605], [0.611317254174397, 0.6880733944954129], [0.8236151603498543, 0.17857142857142858], [0.8017676767676769, 0.8017676767676769], [0.5304621848739496, 0.3444444444444445], [0.2607709750566893, 0.34307065217391297], [0.66167290886392, 0.2974186307519641], [0.7687074829931974, 0.7602601480152501], [0.6818181818181819, 0.6818181818181819], [0.654320987654321, 0.5438202247191011], [0.4634661835748792, 0.4634661835748792], [0.38448275862068976, 0.3151260504201681], [0.6988249845392702, 0.42216721672167207], [0.34128440366972473, 0.29224537037037035], [0.5162738496071829, 0.2100840336134454], [0.4213483146067415, 0.3506944444444444], [0.40879120879120884, 0.3546348314606741], [0.5439024390243904, 0.49010989010989015], [0.5575, 0.46890927624872564], [0.4955555555555556, 0.4955555555555556], [0.8152173913043477, 0.8333333333333334], [0.7773446457234581, 0.1648351648351648], [0.446, 0.5739795918367346], [0.7789062500000001, 0.3546348314606741], [0.654320987654321, 0.4955555555555556], [0.16666666666666666, 0.46875], [0.7485875706214691, 0.3747899159663866], [0.4282069970845481, 0.3468406593406593], [0.4240362811791383, 0.3112327656123276], [0.6944444444444445, 0.46855921855921845], [0.4429133858267717, 0.3506944444444444], [0.3757575757575758, 0.5245403946702648], [0.6226379440665155, 0.6226379440665155], [0.39574468085106385, 0.38027108433734946], [0.4732510288065843, 0.5160550458715595], [0.42613636363636365, 0.44375889890840053], [0.5681818181818182, 0.5681818181818182], [0.7773446457234581, 0.12658227848101264], [0.6944444444444445, 0.4536585365853659], [0.5717948717948719, 0.49010989010989015], [0.8437033349925335, 0.864795918367347], [0.18691588785046728, 0.23662551440329216], [0.7773446457234581, 0.66167290886392], [0.5318681318681319, 0.618131868131868], [0.5269186712485682, 0.28434684684684686], [0.582287961055982, 0.3472222222222222], [0.6506642512077294, 0.5595505617977528], [0.5876795162509448, 0.520408163265306], [0.3468406593406593, 0.2808302808302808], [0.3506944444444444, 0.16304347826086954], [0.6392045454545455, 0.7773446457234581], [0.7052154195011338, 0.7052154195011338], [0.8993827160493828, 0.7575757575757577], [0.600907029478458, 0.5111111111111111], [0.5305305305305306, 0.2373417721518987], [0.46855921855921845, 0.3468406593406593], [0.8101794934841405, 0.7309228039041704], [0.650318287037037, 0.5111111111111111], [0.6792413935271077, 0.6792413935271077], [0.5495818399044207, 0.5679012345679012], [0.8993827160493828, 0.42216721672167207], [0.3305340223944875, 0.27472527472527475], [0.7309228039041704, 0.8918539325842695], [0.38490853658536583, 0.2028218694885362], [0.5782312925170067, 0.3757575757575758], [0.3234880450070324, 0.484], [0.7861781076066792, 0.4955555555555556], [0.31250000000000006, 0.19801980198019806], [0.6320224719101123, 0.6320224719101123], [0.582287961055982, 0.49975895870159076], [0.4056437389770724, 0.5067567567567568], [0.3381818181818182, 0.39118246687054015], [0.654320987654321, 0.66167290886392], [0.6346938775510204, 0.446], [0.7132444814660558, 0.7132444814660558], [0.6411049268192124, 0.6918367346938775], [0.6050290486564996, 0.5563616071428571], [0.4265202702702703, 0.4265202702702703], [0.15151515151515152, 0.32206632653061223], [0.28956422018348627, 0.37128712871287134], [0.4732510288065843, 0.41682242990654206], [0.3012048192771084, 0.40760869565217384], [0.6233062330623306, 0.6777108433734939], [0.8300000000000002, 0.41296296296296303]]}}