{"seed": 42, "num_examples": 512, "batch_size": 1, "captions": [[["An elephant is in the back of a truck."], ["A statue of an elephant is in a bathroom next to a toilet."]], [["A man doing a trick on a skateboard."], ["A man doing a trick on a skateboard."]], [["A man standing on a tennis court holding a racket."], ["A man riding a tennis racket at a tennis ball."]], [["A man standing in front of a pizza in a box."], ["A man sitting at a table with a box of pizza."]], [["A pair of shoes and a pair of shoes on a table."], ["A pair of shoes and an umbrella on a table."]], [["A table with glasses of wine and bread on it."], ["A table with glasses of wine and plates of food."]], [["A living room with a couch and a table."], ["A living room with a couch and a table and a television."]], [["A man sitting at a table in a train station."], ["A man sitting at a bench looking at his cell phone."]], [["A desk with two computer monitors and a keyboard."], ["A group of computer monitors and a keyboard on a desk."]], [["Two elephants and a baby elephant standing next to trees."], ["An elephant and a baby elephant standing in the snow."]], [["A bathroom with a toilet with a table."], ["A toilet with a blanket on top of it."]], [["A large airplane sitting on top of an airport runway."], ["An airplane taking off from an airport runway."]], [["A group of people riding a bike down a street."], ["A man riding on the back of a motorcycle."]], [["Two giraffes and a baby giraffe standing next to each other."], ["A group of giraffes and other animals in a building."]], [["A woman sitting on a toilet on the sidewalk."], ["A black and white photo of a woman sitting on a fire hydrant."]], [["A large clock on the side of a building."], ["A large clock on the side of a building."]], [["A man laying on the beach next to a surfboard."], ["A baby laying on the beach with a surfboard on the beach."]], [["An orange cat laying on the hood of a car."], ["An orange and white cat laying on the hood of a car."]], [["A bride and groom standing next to a wedding cake."], ["A bride and groom standing in front of a wedding cake."]], [["A large dog sleeping on a bed."], ["A man laying in bed with his hand on his hand."]], [["A baby laying in a bed with a blanket."], ["A young boy in a hospital bed with stuffed animals."]], [["A train is on the tracks in a train yard."], ["An airplane is sitting on the tracks next to a train station."]], [["A stack of pancakes sitting on a plate on a table."], ["A stack of pancakes sitting on a plate."]], [["A pair of scissors sitting on top of a table."], ["A pair of scissors in a glass case."]], [["A book shelf with a bunch of books."], ["A shelf with a bunch of books on it."]], [["Two birds sitting on top of a tree branch."], ["Two birds sitting on top of a tree branch."]], [["A woman sitting at a table eating food."], ["A woman sitting at a table in a kitchen."]], [["A man standing in a field with a frisbee."], ["A man standing next to a brown and white frisbee with a dog."]], [["A parking meter sitting on the side of a street."], ["A parking meter sitting on the side of a street."]], [["A banana sitting on top of a desk."], ["A phone sitting on a desk next to a phone phone."]], [["A group of people dressed in costumes walking down a street."], ["A group of people dressed in costumes on a cell phone."]], [["A table with glasses and a vase of flowers."], ["A table with a vase of flowers and a vase of flowers."]], [["A woman standing next to a pot of food on a stove."], ["A woman holding a pot with a pair of scissors."]], [["A clock tower in the middle of a street."], ["A building with a clock tower in front of it."]], [["Two tennis players shaking hands on a tennis court."], ["Two tennis players shaking hands on a tennis court."]], [["A living room with a couch and a table."], ["A living room with a couch and a table and a window."]], [["A man sitting on a bench in front of a church."], ["A building with a clock tower in front of it."]], [["A man riding on the back of an elephant."], ["A man riding on the back of an elephant."]], [["A stop sign with writing on it."], ["A stop sign with writing on it on a street."]], [["A bathroom with a bath tub and a toilet."], ["A bathroom with three sinks and two mirrors."]], [["A group of people standing in front of an airplane."], ["A large airplane sitting on top of an airport runway."]], [["A green bus parked on the side of a street."], ["A green bus parked on the side of a street."]], [["Two cats laying on top of a bed."], ["Two cats sitting next to each other in front of a mirror."]], [["A pizza sitting on a plate next to a glass of beer."], ["A pizza sitting on a white plate on a table."]], [["A person riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard in the ocean."]], [["A plate with a sandwich and french fries."], ["A plate with a sandwich and french fries and a table."]], [["A red and white bus parked on the street."], ["A red bus parked in front of a building."]], [["A train is sitting on the tracks."], ["A yellow train is sitting on the tracks."]], [["A black and white photo of a group of people."], ["A black and white photo of a group of people."]], [["A man standing on a tennis court holding a racket."], ["A man standing on a tennis court holding a racket."]], [["A black stove top oven sitting in a kitchen."], ["A stove top oven sitting in a room."]], [["A traffic light in the middle of a city street."], ["A traffic light over a street with cars."]], [["A banana sitting on a plate next to a table."], ["A banana sitting on a plate next to a table."]], [["A young man in a white coat holding a large pair of scissors."], ["A man in white holding a pair of glasses holding a pair of scissors."]], [["A person standing on skis on a snow covered slope."], ["A person on skis on a snow covered slope."]], [["A kitchen with a table and chairs in it."], ["A kitchen with a table and a refrigerator."]], [["A man flying through the air on a snowboard."], ["A man riding skis down a snow covered slope."]], [["A pizza sitting on a plate next to a drink."], ["A pizza sitting on top of a table."]], [["A cat playing with its reflection in a mirror."], ["A kitten with headphones sitting next to a table."]], [["A vase with red flowers in it in front of a oven."], ["Three flowers in an oven with an oven."]], [["A group of women standing around a table with a cake."], ["A group of women standing around a table with food on it."]], [["A man and a woman standing next to each other."], ["An elderly man and a woman standing next to each other."]], [["A clock on a pole on a building."], ["A clock on a pole on a city street."]], [["A bathroom with a sink and a window."], ["A row of baskets hanging on a wall."]], [["A man with a dog sitting on the stairs."], ["A man with a dog on the stairs with luggage."]], [["A group of teddy bears sitting next to each other."], ["Two teddy bears sitting next to each other."]], [["A young man riding a skateboard at a skate park."], ["A young boy doing a trick on a skateboard in the air."]], [["A stuffed teddy bear wearing a mask sitting on a bed."], ["A dog wearing a costume sitting next to stuffed animals."]], [["A group of people on a ski lift."], ["A group of people skiing down a ski lift."]], [["A black bird sitting on a chair next to a woman."], ["A woman sitting on a chair next to a bird."]], [["A dining room with a table and chairs."], ["A dining room with a table and chairs."]], [["A young boy swinging a baseball bat at a ball."], ["A young boy swinging a baseball bat at a ball."]], [["A city street at night with a traffic light."], ["A city street at night with traffic lights."]], [["A person standing on skis in the snow."], ["A woman on skis in the snow."]], [["A wooden bed with pillows on top of it."], ["A bedroom with a bed with a table."]], [["A man doing a trick on a skateboard at a skate park."], ["A man doing a trick on a skateboard at a skate park."]], [["A man riding a wave on a surfboard in the ocean."], ["A young boy riding a wave on a surfboard in the ocean."]], [["A group of horses grazing in a field."], ["A black and white photo of horses in a field."]], [["A large swimming pool with a table in it."], ["A swimming pool with a table and chairs in it."]], [["A group of people standing on an airplane."], ["A group of people standing in the window of a plane with horses."]], [["A black cat sitting in front of a door."], ["A black cat sitting in front of a door."]], [["A woman standing on a tennis court with a ball."], ["A man standing on a tennis ball on a court."]], [["A man standing on a tennis court with a racket."], ["A man standing on a tennis court holding a ball."]], [["A large bed with red pillows on top of it."], ["A bed with pillows on top of it in a room."]], [["An airplane flying over a tree in the sky."], ["An airplane flying over a tree in the sky."]], [["A construction truck and orange cones on a street."], ["An orange cones and a truck on a city street."]], [["A hot dog and a bottle of soda on tin foil."], ["A hot dog sitting next to a bottle of soda."]], [["A red stop sign on the side of a street."], ["A stop sign on the side of a street."]], [["A polar bear laying on the ground."], ["A polar bear laying on the ground."]], [["A bunch of carrots and vegetables in baskets."], ["A bunch of carrots and other vegetables in a display case."]], [["A group of white teddy bears sitting next to each other."], ["A group of teddy bears sitting on a table."]], [["A train is on the tracks under a bridge."], ["A train is on the tracks under a bridge."]], [["A plate of food on a table."], ["A white plate with a sandwich and a pickle on top of it."]], [["A city street with a sign on the side of it."], ["A street sign in front of a building at night."]], [["A seagull flying over a beach next to the ocean."], ["A bird flying over the beach next to the ocean."]], [["A cat laying on top of a laptop computer."], ["A cat laying on top of a laptop."]], [["A group of people standing in front of a bus."], ["A group of people standing in front of buses."]], [["A bike sitting on the side of a train."], ["A bike on the side of a train."]], [["A man holding a yellow kite in a kitchen."], ["A man holding a box in a kitchen."]], [["A black dog sitting in front of a mirror."], ["A small dog standing in front of a mirror."]], [["A person flying a kite next to the ocean."], ["A woman flying a kite in front of the ocean."]], [["A person holding a cell phone in their hand."], ["A person holding a small watch in their hand."]], [["A row of bikes parked next to each other."], ["A bike parked in a room with a group of bikes."]], [["Two elephants standing next to each other in a zoo."], ["An elephant standing in front of a group of buildings."]], [["A man holding a vase of flowers on a wall."], ["A man painting a vase of flowers on a wall."]], [["A horse standing next to a fence in a field."], ["A group of horses grazing in a field."]], [["A red double decker bus with people on it."], ["A red double decker bus driving down a street."]], [["A motorcycle parked in the grass in a field."], ["A motorcycle parked in the snow at night."]], [["A black stove top oven sitting in a kitchen."], ["A black oven sitting on top of a counter."]], [["A blender sitting on a counter."], ["A man standing in a kitchen preparing food."]], [["A group of people flying kites in the air."], ["A group of people flying kites in the sky."]], [["A group of people sitting around a table eating food."], ["A group of people sitting at a table eating food."]], [["A small car with two cars parked in a parking lot."], ["A car parked in a parking lot with cars."]], [["A man standing next to a fire hydrant with water."], ["An elephant with dry grass on the street."]], [["A man holding a bunch of kites in the air."], ["A woman flying a kite in the air."]], [["A herd of cows grazing in a field."], ["A group of cows in a field with a mountain in the background."]], [["A bus parked on the side of a street."], ["A van parked in front of a building with a tree."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard."]], [["A parking meter on the side of a street."], ["A parking meter in front of a building."]], [["A woman eating a sandwich and a drink."], ["A man eating a slice of pizza and drinking beer."]], [["A horse standing in the grass next to a building."], ["A person laying on a bed in a room with two horses."]], [["A man standing on a snowboard on a snow covered slope."], ["A man standing in the snow with a snowboard."]], [["A person riding a motorcycle on a track."], ["A person on a motorcycle on a race track."]], [["A double decker bus driving down a street."], ["A double decker bus parked on the side of a street."]], [["A man sitting on a motorcycle."], ["A man sitting on top of a motorcycle."]], [["A baseball player swinging a bat at a ball."], ["A baseball player holding a bat at a game."]], [["A man and a woman laying on a bed."], ["A man and a woman laying on a bed."]], [["A group of pictures of food on a table."], ["A group of pictures of food on a table."]], [["Two people playing tennis on a tennis court."], ["Two women playing tennis on a tennis court."]], [["A red double decker bus on a city street."], ["A city street with a double decker bus on it."]], [["A man taking a picture of himself with his cell phone."], ["A woman taking a picture of herself in a mirror."]], [["A group of people playing with a cow on a beach."], ["A group of men riding elephants in the sand."]], [["A man in a costume standing on a trolley."], ["A man in the back of a truck talking on a cell phone."]], [["A woman holding a nintendo wii game controller."], ["Two people playing a video game with a wii."]], [["A group of construction workers standing next to a fire hydrant."], ["Two construction workers standing next to a fire hydrant on the beach."]], [["A white toilet with two skateboards on top of it."], ["A white toilet in a bathroom with two rolls of toilet paper."]], [["Two giraffes and a baby giraffe standing next to a building."], ["A baby giraffe standing next to a building."]], [["A plate of food and a cup of coffee."], ["A table with a plate of food and a cup of coffee."]], [["A parking meter sitting on the side of a street."], ["A parking meter on the side of a street."]], [["A man doing a trick on a skateboard over an orange cone."], ["A man doing a trick on a skateboard over an orange cone."]], [["A group of people standing in a field."], ["A crowd of people flying kites in the sky."]], [["A man brushing his teeth in front of a mirror."], ["A man wearing glasses standing in front of a bed."]], [["A person standing next to a pole on a street."], ["A person painting a fire hydrant with a street."]], [["A living room with chairs and a table."], ["A group of chairs in a room with a table."]], [["Two young men playing a video game with a wii."], ["Two young men playing a video game with a wii."]], [["A group of people standing around a table with food."], ["A group of people standing around a table with food."]], [["A zebra standing next to a baby zebra."], ["Two zebras standing next to each other on a dirt field."]], [["A woman standing on a tennis court holding a ball."], ["A man jumping in the air with a tennis racket."]], [["A cat sitting on a chair."], ["A cat laying on top of a chair."]], [["A blue bike parked on the side of a street."], ["A blue bike parked next to a bike rack on a street."]], [["A group of people sitting at a table."], ["A group of people sitting at tables."]], [["A young boy holding a baseball bat."], ["A young boy holding a baseball bat and a helmet."]], [["A young boy riding a skateboard in a park."], ["A young boy standing on top of a skateboard on a street."]], [["A herd of giraffes running in a field."], ["A herd of giraffes walking in a field."]], [["Two men in suits and ties standing on a street."], ["Three men running down a street with ties."]], [["A street sign with a person on it."], ["A street sign in a room with a tree."]], [["A man holding a tennis ball on a tennis court."], ["A man holding a tennis ball on a court."]], [["A group of boats sitting in a harbor."], ["A group of bags of boats next to a fence."]], [["A man wearing a red hat talking on a cell phone."], ["A man talking on a cell phone in a crowd."]], [["A person playing with a frisbee in a field."], ["A young boy playing with a frisbee on the beach."]], [["A teddy bear sitting on top of a red jacket."], ["A teddy bear sitting on top of a red jacket."]], [["A man cutting a cake at a table."], ["A group of people sitting at night with food at night."]], [["A group of people walking in the rain with umbrellas."], ["A group of people walking in the rain with umbrellas."]], [["Three people standing on skis in the snow."], ["A group of people standing on skis on a snow covered slope."]], [["A person standing next to a pile of luggage."], ["A baby in a stroller with a group of people."]], [["A white truck driving down a street with street signs."], ["A group of street signs on the side of a road."]], [["A man walking on the tracks next to a train."], ["A man walking next to a train."]], [["A person riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A banana split is sitting on top of a table."], ["A banana split is sitting in a plastic container."]], [["A bedroom with a sink and a bed in it."], ["A man laying in bed in front of a candle."]], [["A wooden bench next to a truck on a street."], ["A group of wine glasses sitting on a wooden bench."]], [["A desk with two computer monitors and a laptop."], ["A desk with two computer monitors and a laptop."]], [["A man riding a horse on a dirt road."], ["A man riding on the back of a horse next to a stop sign."]], [["A man riding a dirt bike on a dirt road."], ["A man riding a dirt bike on a road."]], [["A man flying through the air while riding a snowboard."], ["A man flying through the air while riding a snowboard."]], [["A pizza sitting on top of a cutting board."], ["A pizza sitting on top of a stove."]], [["A person with a backpack looking in a small refrigerator."], ["A woman looking in front of a refrigerator."]], [["A city street at night with cars and traffic lights."], ["A city street at night with cars and traffic lights."]], [["A group of people playing a game of frisbee."], ["Two men playing a game of water with a ball."]], [["An open refrigerator with food in a room."], ["An open refrigerator with food in a table."]], [["A kitchen with a stove and a refrigerator."], ["A small kitchen with a stove and a table."]], [["Two cats sitting in front of a window."], ["Two cats sitting in front of a window."]], [["A statue of a clock on top of a street."], ["A statue of a clock with a ball."]], [["A television in a bathroom with two sinks."], ["A bathroom with a sink and a mirror."]], [["A dog laying on the floor in a room."], ["A person laying on the floor in a library with a dog."]], [["A group of people standing in a field."], ["A group of people standing in a field with frisbees."]], [["A black cat sitting next to a bottle of water."], ["A person window with a bottle of water in a room."]], [["A person flying a kite on the beach."], ["A person flying a kite on the beach."]], [["A woman sitting in a chair holding an umbrella."], ["A woman sitting in a chair holding an umbrella."]], [["Two giraffes standing in the middle of a field."], ["Two giraffes standing in a field of grass."]], [["A desk with a laptop computer sitting on top of it."], ["A desk with a laptop and a phone and a chair."]], [["A bedroom with a bed and a fireplace."], ["A black and white photo of a bedroom with a fireplace."]], [["A small bird standing on a tree branch."], ["A bird sitting on top of a tree branch."]], [["A bus with a picture on the side of it."], ["A blue bus parked in front of a building."]], [["A zebra standing in a field next to a tree."], ["A zebra standing under a tree in a field."]], [["A person sitting at a table with two plates of pizza and salad."], ["Plates of pizza on plates in a restaurant."]], [["A man sleeping in a bed with a cat."], ["A child sleeping on a bed with a group of remote controls."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A group of zebras walking in the dirt."], ["A group of zebras standing in a field."]], [["A group of jets flying in formation in the sky."], ["A group of jets flying in formation in the sky."]], [["A bedroom with a laptop and a dresser."], ["A room with boxes and a laptop on a bed."]], [["A picture of a group of cupcakes on a table."], ["A picture of a cupcake on the side of a car."]], [["A group of children feeding a giraffe at a zoo."], ["A group of people feeding a giraffe at a zoo."]], [["A group of people standing around with animals."], ["A group of people and a large eagle in a field with cows."]], [["A little girl eating a banana."], ["A little girl eating a banana."]], [["A bride and groom standing in a wedding."], ["A bride and groom standing in a wedding."]], [["A desk with a computer sitting on top of it."], ["A desk with a bunch of electronics on it."]], [["A man and a woman standing in front of fruit."], ["A man and a woman standing in front of fruit."]], [["An airplane flying in the sky."], ["An airplane flying in the sky."]], [["A group of zebras grazing in a field."], ["A herd of zebras grazing in a field."]], [["A small dog wearing a red bow tie sitting on steps."], ["A small dog wearing a red tie sitting in a mirror."]], [["A young boy standing next to a pile of apples."], ["A person hanging from a ceiling in the air."]], [["Two elephants standing next to each other in a field."], ["A white white vase with two elephants standing next to each other."]], [["A picture of people on a bathroom floor."], ["A group of people in a bathroom with urinals."]], [["A train is on the tracks in a field."], ["A train is on the tracks in a field."]], [["A man and a woman sitting on a park bench."], ["A man and a little girl sitting on a park bench."]], [["A train is sitting on the tracks."], ["A train is on the tracks."]], [["A tree with apples on top of it."], ["A bunch of apples hanging from a tree."]], [["A man standing on a tennis court holding a ball."], ["A man standing on a tennis court holding a ball."]], [["Two people standing next to an airplane in the desert."], ["A group of people sitting in a field next to a cow."]], [["A statue of a cow standing in front of a street."], ["A statue of a cow in the middle of a street."]], [["A kitchen with a stove and a pot on the floor."], ["An old bed with a dog sitting on the floor."]], [["A piece of cake and pastries in a bakery."], ["A cake sitting on display in a window."]], [["A dog in the side view mirror of a car."], ["A rear view mirror of a person in a car."]], [["A toy is sitting on a desk with a computer."], ["A toy is sitting next to a desk with two computer."]], [["A pizza and a can of soda on a table."], ["A pizza and a can of soda on a table with a pizza."]], [["A desk with a laptop computer sitting on top of it."], ["An office with a laptop computer sitting on a desk."]], [["A crowd of people standing on a street with a traffic light."], ["A crowd of people walking down a sidewalk holding a umbrella."]], [["A woman sitting at a table with two slices of pizza."], ["A woman sitting at a table eating pizza."]], [["A truck driving down a road with hay."], ["A truck driving down a road with logs."]], [["A group of street signs on a pole."], ["A street sign in front of a brick building."]], [["A group of surfboards sitting on top of a beach."], ["A group of chairs and a beach in the ocean."]], [["A man standing on a tennis court with a ball."], ["A person doing a trick on a skateboard in the air."]], [["A bathroom with a sink and a toilet."], ["A bathroom with a sink and a toilet and a window."]], [["A man preparing food in a kitchen."], ["Two men standing in a restaurant kitchen with food."]], [["A group of people standing around a table with a cake."], ["A black and white photo of a group of people standing around a cake."]], [["A woman riding a pink bike down a street."], ["A group of people walking a dog down a street."]], [["A plate of food and a glass of wine on a table."], ["A plate of food on a table with a glass of wine."]], [["A white cat laying on an office chair."], ["A white cat sleeping on a black desk."]], [["A group of people standing in front of a bakery."], ["Two children sitting in front of a counter of donuts."]], [["A group of people with umbrellas."], ["A group of umbrellas sitting next to each other."]], [["Two boats and a tractor on a beach."], ["A black and white photo of an old car and an old car."]], [["A refrigerator with a table hanging on it."], ["A refrigerator with magnets on it in a kitchen."]], [["Two cups and a table with a table."], ["Three coffee cups sitting on top of a table."]], [["An airplane and a plane flying in the sky."], ["An airplane is sitting in the water with a large boat."]], [["A group of cars on a traffic light."], ["A group of cars stopped at an intersection with a traffic light."]], [["A person flying a kite in the water."], ["A painting of kites flying in the sky."]], [["A bathroom with a sink and a tub."], ["A bathroom with a toilet and a bath tub and a shower."]], [["Two people sitting in front of a blue umbrella."], ["Three women standing in the rain holding umbrellas."]], [["A small plane parked on display at a show."], ["A fighter jet parked on display at an event."]], [["A teddy bear sitting next to a table with a tennis racket."], ["A teddy bear sitting next to a glass."]], [["A group of people sitting at a table eating food."], ["A group of people sitting at a table eating food."]], [["A bunch of clocks on a wall in a room."], ["A wall with three clocks on it and a picture on it."]], [["A sandwich in a box with food in it."], ["A piece of bread and a book on a tray."]], [["A cow and a calf standing in a field."], ["A cow and a baby calf standing in a field."]], [["A wooden bench sitting on the beach next to the ocean."], ["A wooden bench sitting on the beach next to the ocean."]], [["A tall tower with a clock on the top of it."], ["A tower with a clock on the top of it."]], [["A black cat sitting in the seat of a car."], ["A train is sitting on the tracks next to a window."]], [["A group of cars are stopped at a traffic light."], ["A group of cars stopped at a traffic light."]], [["A group of people sitting at a table."], ["A group of people sitting at a table with a car."]], [["A man in a skirt and tie holding a bag."], ["A man wearing a suit and tie standing in a room."]], [["A woman riding a bike down a city street with cars."], ["A man riding a bike down a city street with cars."]], [["A group of zebras standing in the grass."], ["A herd of zebras standing in the dirt."]], [["A man walking on a sidewalk next to a fire hydrant."], ["A red fire hydrant sitting on the side of a building."]], [["A statue of a clock with two birds on top of it."], ["A statue of a clock with two birds on it."]], [["An airplane flying in the sky."], ["An airplane flying in the sky."]], [["A kitchen with a sink and a window."], ["A green room with green walls and a counter."]], [["A teddy bear and a stuffed animal sitting on a bench."], ["A teddy bear sitting on a bench with a stuffed animal."]], [["A man and a woman standing next to a piece of cake."], ["A man and a woman holding an umbrella."]], [["A man riding a motorcycle down a street."], ["A man riding a horse with a backpack on a street."]], [["A plate of food and a bird on a table."], ["A plate with a bird and a sandwich and french fries."]], [["A yellow and pink bus parked in a field."], ["A yellow school bus parked in a field."]], [["A man and a woman sitting at a table with two pizzas."], ["Three people sitting at a table with pizza."]], [["A group of black and white cows in a barn."], ["A group of cows in a barn."]], [["A young boy and a girl sitting at a table with food."], ["A group of children sitting at a table with food."]], [["Two people playing a video game on a wii."], ["Two women playing a video game on a wii."]], [["A group of men in red uniforms riding horses."], ["Three men in red hats riding horses in a field."]], [["Two shots of two people standing on a table."], ["Three women standing in front of a pink wall."]], [["Two giraffes standing in a field with a tent."], ["Two giraffes standing in a field next to a plane."]], [["A baseball player holding a bat on a field."], ["A baseball player holding a bat on a field."]], [["A teddy bear sitting on the side of a tree."], ["A teddy bear sitting on top of a tree."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A black and white photo of a plane on a street."]], [["A bathroom with a sink and a mirror."], ["A bathroom with a sink and a mirror."]], [["A baseball player holding a bat on a field."], ["A baseball player holding a bat on a field."]], [["A bunch of vegetables on a cutting board with a knife."], ["A bunch of vegetables on a cutting board with a knife."]], [["A group of people skiing down a snow covered mountain."], ["A group of people skiing on a snow covered mountain."]], [["A toilet in a bathroom with a green wall."], ["A toilet with a seat in a bathroom."]], [["A clock tower in the middle of a street."], ["A clock tower in front of a building."]], [["A clock in the middle of a field."], ["A clock on a pole in the middle of a field."]], [["A white toilet in a bathroom with a table."], ["A white toilet sitting on top of a table with books."]], [["Two computer monitors and a keyboard on a desk."], ["Two computer monitors and a keyboard on a desk."]], [["A person holding a sandwich on a plate."], ["A banana and fruit in a paper bag."]], [["A man riding a skateboard on a ramp."], ["A group of people riding skateboards in a skate park."]], [["A person holding a piece of food in front of a building."], ["A person holding a donut in front of a donut shop."]], [["A person taking a picture of a dog in a car window."], ["A person holding a cell phone in the window of a car."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A black and white photo of a plane on a street."]], [["A pair of scissors sitting on top of a box."], ["A pair of scissors in a box in a car."]], [["A desk with three computers and a laptop."], ["An office with a group of computer monitors and a desk."]], [["A man sitting in a hospital bed holding a plate of food."], ["A man in a hospital bed with a plate of food."]], [["A black and white cat sitting next to a laptop computer."], ["A cat laying on top of a laptop computer."]], [["A man hitting a tennis ball with a racket."], ["A man holding a tennis racket on a tennis court."]], [["A blue sign on the side of a city street."], ["A sign on the side of a city street."]], [["A yellow and red train is on the tracks."], ["A train is sitting on the tracks in a city."]], [["A train is on a bridge over a city."], ["A blue train is on a bridge in a city."]], [["A group of cows standing in front of a church."], ["Two cows standing in front of a church."]], [["Two seagulls standing on rocks next to the water."], ["Two seagulls standing on rocks next to the water."]], [["A man riding on the back of an elephant."], ["A man standing next to an elephant."]], [["A desk with a laptop and a computer on it."], ["A desk with a laptop and a microphone."]], [["A train is on the tracks next to a dirt road."], ["A train is on the tracks next to a river."]], [["A black cat sitting on top of a television."], ["A television sitting on top of a table with a large television."]], [["A computer keyboard and a mouse on a desk."], ["A white keyboard and a mouse on a plate."]], [["Three people standing in front of a bakery."], ["Three men standing in front of a bakery."]], [["A yellow truck parked in a parking lot."], ["An old yellow truck parked next to a group of cars."]], [["A group of people standing on a snow covered mountain."], ["A group of people standing around in the snow."]], [["A group of people riding skis down a snow covered slope."], ["A group of people skiing down a snow covered slope."]], [["A baseball player holding a bat on a field."], ["A baseball player holding a bat on a field."]], [["A woman standing on a tennis court with a ball."], ["A man standing on a tennis court holding a racket."]], [["A man standing on the beach holding a surfboard."], ["A man and a child standing on the beach."]], [["A man standing on a tennis court holding a racket."], ["A man standing on a tennis court with a ball."]], [["A group of people skiing down a snow covered slope."], ["A group of people riding down a snow covered slope."]], [["Two people standing in the snow with a snowboard."], ["Two people standing in the snow in a field."]], [["A plate of broccoli and meat on a table."], ["A bunch of broccoli and nuts on a plate."]], [["A person holding a sandwich and a cup of coffee."], ["A person holding a sandwich and a drink."]], [["A tray with a sandwich and a salad on a table."], ["A tray with food and drinks and food in it."]], [["A cat laying on top of a laptop computer."], ["A cat sitting on top of a laptop computer."]], [["A red fire hydrant in the middle of a forest."], ["A red fire hydrant in the middle of the woods."]], [["A kitchen with a stove and a refrigerator."], ["A kitchen with a stove and a sink."]], [["A group of people walking on a city street with a double decker bus."], ["A double decker bus parked on the side of a street."]], [["A group of horses and a baby horse eating hay."], ["A group of horses and a baby horse standing next to hay."]], [["A bird standing in the water in a body of water."], ["A bird standing in the water in a body of water."]], [["A baseball player throwing a ball on a field."], ["A baseball player throwing a ball on a field."]], [["A man sitting at a table looking at his cell phone."], ["A man sitting at a table with a cup of coffee."]], [["A bus driving down a city street with a building."], ["A bus driving down a city street with buildings."]], [["A woman standing in a kitchen preparing food."], ["A woman standing in a kitchen preparing food."]], [["A man doing a trick in the air on a skateboard."], ["A man flying through the air on a skateboard."]], [["A pizza sitting on top of a table."], ["A pizza sitting on a plate on a table."]], [["A row of toilets in a bathroom with a window."], ["A bathroom with a row of toilets and a sink."]], [["A plate of food with broccoli and a table."], ["A bowl of soup with broccoli and vegetables."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A black and white photo of a plane on a street."]], [["A man walking a bike down a street."], ["A man walking a bike down a city street."]], [["A plate of food with rice and vegetables on a table."], ["A plate of rice and broccoli on a table."]], [["A small plane sitting on top of an airport runway."], ["A group of small planes sitting on an airport runway."]], [["A wooden bench sitting in the grass on a sidewalk."], ["A wooden bench sitting next to a sidewalk."]], [["A wooden table with plates of food on it."], ["A table with plates of food and candles on it."]], [["A man standing on a beach next to the ocean."], ["A group of birds standing on the beach."]], [["A cat is standing on the wall of a room."], ["A picture of a cat on the wall."]], [["A man and a woman standing next to each other."], ["A man and a woman standing in a room."]], [["A dog wearing a helmet sitting next to a motorcycle."], ["A picture of a dog with a motorcycle."]], [["A group of young people flying kites."], ["Two men standing on a street holding skateboards and chips."]], [["A woman taking a picture of a man on a cell phone."], ["A woman taking a picture of herself in a mirror."]], [["A street sign on a wooden pole."], ["Two street signs on a pole with a street sign."]], [["A person riding a skateboard at a skate park."], ["A person doing a trick on a skateboard at a skate park."]], [["A group of people with luggage at an airport."], ["A group of people with luggage at an airport."]], [["A woman standing in front of a refrigerator."], ["A woman holding a glass of wine in front of an open door."]], [["A group of street signs in front of a tall building."], ["A group of street signs on a pole in a city."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A man in a white shirt and tie."], ["A man in a white shirt and tie holding his hand."]], [["A blue suitcase sitting next to a pair of shoes."], ["A pair of shoes and a suitcase on a wooden table."]], [["A piece of chocolate cake with a drink in it."], ["A chocolate cake and a glass of beer."]], [["A plate of food on a table with a glass of wine."], ["A plate of food on a table with wine glasses."]], [["A plate of food with a salad and a table."], ["A plate with a salad and a salad on a table."]], [["A group of trucks parked in a parking lot."], ["A group of trucks parked in a parking lot with umbrellas."]], [["A herd of elephants walking in a field."], ["A herd of elephants walking in a field."]], [["A green broccoli plant growing in a field."], ["A bunch of broccoli plants on the ground."]], [["Two teddy bears sitting next to each other."], ["A group of teddy bears sitting next to a wall."]], [["A group of men standing in a room."], ["A group of stuffed animals sitting next to each other."]], [["A person riding a horse jumping over an obstacle."], ["A person riding a horse jumping over an obstacle."]], [["Two people riding in a horse drawn carriage."], ["Two people riding in a horse drawn carriage in the snow."]], [["A white sign in front of a brick building."], ["A sign in front of a building."]], [["A woman holding a tennis racket in front of a crowd."], ["A woman swinging a tennis racket on a court."]], [["A blender with food in it on a counter."], ["A blender sitting in front of a counter."]], [["A cat laying on top of a suitcase."], ["A cat laying on top of a suitcase."]], [["A donut hanging from a christmas tree."], ["A donut hanging from a christmas tree."]], [["A picture of a kitchen with a table."], ["A large kitchen with white appliances and a table."]], [["An orange tree with a green leaves on it."], ["A tree with a tree with a table."]], [["A man standing next to a bike on a street."], ["A man and a baby standing next to a bike."]], [["A group of people flying a kite in a field."], ["A person flying an orange and blue kite in the air."]], [["A man riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard in the ocean."]], [["A black and white photo of a man in a boat on the beach."], ["Two people in a boat on the beach next to the ocean."]], [["A young boy taking a picture of a cell phone."], ["A young boy taking a picture of a cell phone."]], [["An airplane parked on the runway at an airport."], ["An airplane parked on the runway at an airport."]], [["A person skiing down a snow covered slope."], ["A person skiing down a snow covered slope."]], [["A group of people riding horses on the beach."], ["A group of people riding horses on the beach."]], [["A group of people sitting on benches in a park."], ["A group of people sitting on a bench in a park."]], [["A bowl of food with vegetables and a fork."], ["A wooden tray of food with vegetables on it."]], [["A man and a woman on a skateboard with fire."], ["A man standing in front of a woman with a skateboard."]], [["A baseball player throwing a ball on a field."], ["A baseball player throwing a ball on a field."]], [["An elephant standing next to a tree in a field."], ["A group of men standing next to two horses in the ocean."]], [["A black refrigerator in a room with a table."], ["A black refrigerator in a room with a door."]], [["Two signs on a pole on a city street."], ["A parking lot with cars and a tower."]], [["A woman riding a motorcycle with a side car."], ["A woman riding a motorcycle on a street."]], [["A bunch of oranges in a bowl on a table."], ["A bowl of oranges on a table with a bowl."]], [["A garden with plants in the middle of a building."], ["A garden with plants in front of a house."]], [["A man and a group of sheep in a field."], ["A man holding two dogs in front of a crowd."]], [["A cat looking at a statue of a bear."], ["A man sitting in the window with a black cat."]], [["A woman holding a baseball bat next to a table."], ["A woman holding a baseball bat at night."]], [["A group of zebras standing next to a fence."], ["A herd of zebras standing next to a fence."]], [["A polar bear standing next to a rock."], ["A polar bear standing next to a rock."]], [["A birthday cake and a car on a table."], ["A bag and a remote control sitting next to it."]], [["A man riding a skateboard at a skate park."], ["A man standing in front of a bus."]], [["A building with a clock on the top of it."], ["A group of birds sitting on top of a building."]], [["A woman standing next to a brown horse."], ["A man standing next to a horse on a street."]], [["A person standing on top of a skateboard."], ["A person in a suit holding a skateboard with a red light."]], [["A black bear standing on top of a log."], ["A black bear is standing on top of a tree."]], [["A man in a santa hat holding a dog in front of a christmas tree."], ["A man wearing a santa hat with a small dog."]], [["A kitchen with a refrigerator and a microwave."], ["A small kitchen with a refrigerator and a microwave."]], [["A person riding skis on a rail in the snow."], ["A man riding skis on a rail in the snow."]], [["A food truck parked in front of a street."], ["A painting of people standing in front of an ice cream truck."]], [["A basket of fruit sitting on a table."], ["A basket of fruit with a red ribbon in it."]], [["A clock tower in the middle of a street."], ["A clock tower on the side of a street with cars."]], [["A group of women standing in front of a sign."], ["Three women standing next to a sign with bananas."]], [["A brown dog sitting next to a black and white dog."], ["A dog with a frisbee in its mouth."]], [["A pizza with meat and vegetables on top of a table."], ["A pizza with pizza with pizza sitting on top of it."]], [["A group of people standing in a store with bananas."], ["A group of people standing in a market with bananas."]], [["A young boy playing a video game on a wii."], ["A young boy playing a video game on a wii."]], [["A person riding a skateboard at a skate park."], ["A man riding a skateboard at a skate park."]], [["A man and a woman eating a piece of pizza."], ["Two women standing next to a pole in a room."]], [["A white toilet in a bathroom with a window."], ["A white toilet in a bathroom with a window."]], [["A plate of food with chicken and potatoes."], ["A plate of chicken and potatoes and potatoes."]], [["An airplane flying in the sky."], ["An airplane flying in the sky."]], [["A woman laying on a bed in a hotel room."], ["A person laying in a bed in a room."]], [["Two people playing a video game with a wii."], ["A woman holding a cat on a pole."]], [["A group of street signs on a pole on a street."], ["Two street signs in the water on a street with cars."]], [["A girl sitting at a desk with a laptop computer."], ["A cell phone sitting on top of a table."]], [["A dog standing on top of a skateboard."], ["A small dog standing on a skateboard."]], [["A bike parked in front of a red building."], ["A bike parked in front of a green building."]], [["A plate with a piece of cake on a table."], ["A plate with a cake on a table."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A black and white photo of two people riding on a horse."], ["A black and white photo of a person riding on a horse."]], [["A white truck parked on the side of a street sign."], ["A white car driving down a city street with a street sign."]], [["A black and white photo of boats parked next to a dock."], ["A group of cows standing next to a boat in the water."]], [["A person holding a cell phone in their hand."], ["A person holding a cell phone in their hand."]], [["A young boy swinging a tennis racket at a tennis ball."], ["A group of people playing tennis on a tennis court."]], [["A bedroom with a bed and a television on it."], ["A television sitting on a chair in a room with a book shelf."]], [["A group of zebras eating from a trough."], ["A group of zebras and a giraffe in a zoo."]], [["A living room with a couch and a television."], ["A living room with a couch and a television."]], [["A man riding a wave on a surfboard in the ocean."], ["A woman riding a wave on a surfboard in the ocean."]], [["A group of parking meters on the side of a street."], ["A row of parking meters in a parking lot."]], [["A man wearing a helmet riding a skateboard down a street."], ["A man riding a skateboard down a sidewalk."]], [["A person cutting a cake with a knife."], ["A person cutting a cake with a table."]], [["A man and a woman sitting at a table with an umbrella."], ["A man sitting at a table with an umbrella."]], [["A train is on the tracks next to a river."], ["A train is on the tracks next to a river."]], [["A traffic light on the side of a street."], ["A traffic light and a building in the background."]], [["A young boy in the air with a tie."], ["Young boys in ties standing in the fog."]], [["A man playing a video game in a living room."], ["A man reading a book with a dog in a table."]], [["A woman wearing a scarf looking at her cell phone."], ["A woman with red hair looking at her cell phone."]], [["A cat sitting next to a brick wall."], ["A cat sitting on the back of a couch."]], [["A small bathroom with a toilet and a table."], ["A small bathroom with a toilet and a window."]], [["A person riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard in the ocean."]], [["A kitchen with a table and chairs in it."], ["A kitchen with a table and a bath tub."]], [["A little girl sitting in a bowl on a table."], ["A little girl eating out of a bowl on a table."]], [["A group of ducks swimming in a body of water."], ["A flock of ducks swimming in a body of water."]], [["A man standing on the back of a truck."], ["A man standing on the back of a truck."]], [["An orange motorcycle parked in front of a group of motorcycles."], ["An orange motorcycle parked in front of a sign."]], [["A black and white cow standing next to a man."], ["A group of cows eating hay in a building."]], [["A black and white photo of people on a beach with sail boats."], ["A black and white photo of planes and planes in the water."]], [["A motorcycle parked on the side of a road."], ["A motorcycle driving down a road in the snow."]], [["Three people in a red boat in the water."], ["A group of people on a boat in the water."]], [["A large crowd of people standing in front of sheep."], ["A group of sheep standing in front of a building."]], [["A blue suitcase sitting on the ground."], ["A suitcase with a green plant in front of a car."]], [["A man riding a skateboard at a skate park."], ["A person riding a skateboard at a skate park."]], [["A man and a child on a snowboard down a snow covered slope."], ["A man walking in the snow flying a kite."]], [["A cat and a dog looking at a window."], ["A cat looking at its reflection in a mirror."]], [["A baseball player standing on the mound."], ["A baseball player standing on the mound on a field."]], [["A black and white photo of a man riding a horse."], ["A woman walking a dog on a leash."]], [["A bedroom with a bed and a table."], ["An old bed with clothes on top of it."]], [["A small bed with bottles of water on it."], ["A bed with bottles sitting on top of a table."]], [["A pizza is sitting in an oven."], ["A pizza is in an oven."]], [["A yellow bird sitting on a tree branch."], ["A yellow bird sitting on a tree branch."]], [["Two people standing in beds with a woman."], ["Two children sitting in beds in a parking lot."]], [["A man standing in front of a refrigerator."], ["A man standing in front of a refrigerator."]], [["An elephant standing next to a fence in a zoo."], ["Two elephants standing in front of a zoo."]], [["A kitchen sink with dishes in it."], ["A sink with a spoon in it on a bathroom sink."]], [["Three hot dogs with toppings on top of a table."], ["A plate of hot dogs and fries on a table."]], [["A group of birds sitting on top of a wooden roof."], ["A bird flying over a group of birds on a roof."]], [["A bus driving in the rain on a street."], ["A bus driving down a street in the rain."]], [["A young man kicking a soccer ball on a field."], ["A group of young men playing a game of soccer."]], [["An airplane flying in the sky over a dirt road."], ["A plane flying in the sky over a group of people."]], [["A black cat sitting in the grass."], ["A black cat sitting in the grass."]], [["A bathroom with a toilet and a bath tub."], ["A bathroom with a toilet and a shower."]], [["A laptop computer sitting on top of a wooden table."], ["A computer keyboard sitting next to a desk."]], [["A group of people standing around a bench."], ["A group of people standing around a bench with a frisbee."]], [["A plate of bread sitting next to a keyboard."], ["A pile of cheese and a pair of shoes."]], [["A cat standing in a bathroom next to a toilet."], ["A row of sinks in a bathroom with a checkered floor."]], [["A person riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard in the ocean."]], [["A man taking a picture of a cell phone."], ["A man talking on a cell phone next to a pair of shoes."]], [["A man standing under a sign in the grass."], ["A man holding a sign in the grass."]], [["A man doing a trick on a skateboard at a skate park."], ["A man flying through the air while riding a skateboard."]], [["A woman walking a small white dog on a leash."], ["A woman walking a dog down a sidewalk talking on a cell phone."]], [["A man riding a horse on a field next to the water."], ["A person riding a horse next to the water."]], [["A man doing a trick on a skateboard down a rail."], ["A man flying through the air while riding skis."]], [["A group of pictures of food in a bowl."], ["A group of bowls of food on a table."]], [["A white plate with a sandwich on a table."], ["A sandwich and a salad on a basket."]], [["Two hot dogs on a white plate."], ["A person holding a paper plate with two hot dogs in it."]], [["A black horse standing in a field."], ["A brown horse standing in a field of grass."]], [["A boat with people on top of a dock."], ["A boat is in the water next to the shore."]], [["A bathroom with a sink and a mirror."], ["A bathroom with a sink and a mirror."]], [["A red fire hydrant on the side of a street."], ["A red fire hydrant with a hose on it."]], [["A toilet with the seat up in a bathroom."], ["A toilet with a seat on top of it."]], [["A group of people standing next to a street signs."], ["A group of people standing in front of signs."]], [["A cat laying on top of a laptop computer."], ["A cat laying on top of a chair."]], [["A man standing on a tennis court holding a racket."], ["A man standing on a tennis court holding a racket."]], [["A cat standing in front of a television."], ["A cat standing in front of a computer monitor."]], [["An airplane flying in the sky with a flag."], ["An airplane flying in the sky with a flag."]], [["A group of stuffed teddy bears sitting on a table."], ["A group of stuffed animals sitting on top of a suitcase."]], [["A bathroom with a toilet and a sink and a tub."], ["A bathroom with a toilet and a sink and a shower."]], [["A group of bikes parked next to a building."], ["A bunch of bikes hanging on a wall with a clock."]], [["A man riding a snowboard down a snow covered slope."], ["A man riding a snowboard down a snow covered slope."]], [["A large clock in the middle of a building."], ["A large clock in the middle of a building."]], [["A boat is sitting in the water next to a lake."], ["A boat is sitting on the side of a river at night."]], [["An orange train is on the tracks in a forest."], ["An orange train is on the tracks in a forest."]], [["A man doing a trick on a skateboard on a street."], ["A man doing a trick on a skateboard in the air."]]], "scores": {"meteor": [[0.7687074829931974, 0.474468085106383], [0.32206632653061223, 0.32206632653061223], [0.7585268884703913, 0.43314500941619577], [0.28774193548387095, 0.4094799210006583], [0.5555555555555556, 0.551470588235294], [0.46890927624872564, 0.372], [0.3896604938271605, 0.5260416666666666], [0.7485875706214691, 0.3126050420168068], [0.6944444444444444, 0.4481927710843373], [0.5318681318681319, 0.2808302808302808], [0.46875, 0.46296296296296297], [0.8950617283950617, 0.300453514739229], [0.3468406593406593, 0.5952380952380953], [0.7519964507542148, 0.6859756097560975], [0.7687074829931974, 0.41396979503775616], [0.43069584736251404, 0.43069584736251404], [0.9995, 0.41802832244008714], [0.6989795918367346, 0.6852741096438575], [0.616925669350309, 0.611317254174397], [0.5645569620253165, 0.18072289156626503], [0.3506944444444444, 0.372], [0.5439024390243904, 0.5067567567567568], [0.9054545454545455, 0.8099489795918368], [0.5251825500842539, 0.3546348314606741], [0.6861724281549355, 0.8017676767676769], [0.6310013717421126, 0.6310013717421126], [0.8918539325842695, 0.8017676767676769], [0.3811965811965813, 0.7988733069639219], [0.5318681318681319, 0.5318681318681319], [0.22471910112359547, 0.27173913043478265], [0.5769944341372912, 0.5253507653061225], [0.5782312925170067, 0.5612244897959183], [0.6756756756756757, 0.5251825500842539], [0.6792413935271077, 0.5111111111111111], [0.6792413935271077, 0.6792413935271077], [0.5876795162509448, 0.5067567567567568], [0.7521527129370266, 0.37796610169491524], [0.9041027559546079, 0.9041027559546079], [0.6691919191919192, 0.6290648127382821], [0.5747427175998604, 0.32206632653061223], [0.25, 0.5616605616605616], [0.5439024390243904, 0.5439024390243904], [0.5011235955056179, 0.5495818399044207], [0.8099489795918368, 0.8833333333333334], [0.5813754073057795, 0.5813754073057795], [0.32206632653061223, 0.44158415841584164], [0.5913134484563056, 0.7349537037037036], [0.3835051546391753, 0.3795918367346939], [0.5160550458715595, 0.5160550458715595], [0.7789062500000001, 0.7789062500000001], [0.5681818181818182, 0.3795918367346939], [0.372, 0.3795918367346939], [0.618131868131868, 0.618131868131868], [0.7562196601941749, 0.6102825745682888], [0.446, 0.4505050505050505], [0.7390260631001373, 0.6388888888888888], [0.8017676767676769, 0.3188131313131313], [0.6233062330623306, 0.6388888888888888], [0.8819444444444444, 0.23379629629629628], [0.4000000000000001, 0.17523364485981308], [0.6657910689028086, 0.6852741096438575], [0.5888888888888889, 0.6657910689028086], [0.8737244897959183, 0.8629377676996723], [0.39453125, 0.34766355140186916], [0.4505050505050505, 0.25], [0.45731707317073167, 0.3194444444444444], [0.40879120879120884, 0.5495818399044207], [0.30789825970548856, 0.38490853658536583], [0.4179775280898876, 0.3506944444444444], [0.565083176127594, 0.37796610169491524], [0.46875, 0.46875], [0.8993827160493828, 0.8993827160493828], [0.625, 0.66167290886392], [0.29760000000000003, 0.35967741935483877], [0.5975308641975308, 0.46875], [0.9139118457300276, 0.9139118457300276], [0.782267115600449, 0.7017173423423423], [0.46875, 0.3116531165311653], [0.625, 0.40879120879120884], [0.5796973961998594, 0.4224058769513315], [0.6410256410256411, 0.6410256410256411], [0.37763136750763293, 0.37763136750763293], [0.1648351648351648, 0.20000000000000004], [0.4101694915254237, 0.34307065217391297], [0.625, 0.625], [0.4440665154950869, 0.582287961055982], [0.5569306930693068, 0.7585268884703913], [0.5625, 0.5681818181818182], [0.4207547169811321, 0.4207547169811321], [0.1875, 0.3012048192771084], [0.5260869565217392, 0.7575757575757577], [0.7687074829931974, 0.7687074829931974], [0.2222711267605634, 0.612864077669903], [0.23232323232323232, 0.2293577981651376], [0.5902439024390245, 0.5439024390243904], [0.4732510288065843, 0.5349990463475109], [0.7602601480152501, 0.4955555555555556], [0.4955555555555556, 0.5011235955056179], [0.7349537037037036, 0.5503634475597092], [0.8017676767676769, 0.6226379440665155], [0.4955555555555556, 0.4766949152542372], [0.5975308641975308, 0.5975308641975308], [0.9993141289437586, 0.34307065217391297], [0.7145928899082569, 0.3468406593406593], [0.5952065677966102, 0.5251825500842539], [0.6724489795918367, 0.3795918367346939], [0.7687074829931974, 0.9799382716049383], [0.41296296296296303, 0.33283582089552244], [0.5506172839506173, 0.3271604938271605], [0.32763532763532766, 0.125], [0.4732510288065843, 0.4732510288065843], [0.616925669350309, 0.7282110091743119], [0.6777108433734939, 0.5975308641975308], [0.38110236220472443, 0.04672897196261682], [0.18292682926829268, 0.1875], [0.605, 0.6964028776978417], [0.1851851851851852, 0.27777777777777773], [0.6962184873949581, 0.4849137931034482], [0.6310013717421126, 0.7361111111111112], [0.5076628352490421, 0.211864406779661], [0.446, 0.16129032258064518], [0.7913056930693071, 0.5876795162509448], [0.6, 0.5952380952380953], [0.8918539325842695, 0.6114130434782608], [0.5563218390804598, 0.6320224719101123], [0.30303030303030304, 0.30303030303030304], [0.6792413935271077, 0.6792413935271077], [0.5506172839506173, 0.5506172839506173], [0.7059558517284465, 0.5739795918367346], [0.15151515151515152, 0.4440366972477064], [0.8030303030303031, 0.49010989010989015], [0.4634661835748792, 0.26976495726495725], [0.5452674897119341, 0.505283273381295], [0.6532519549876025, 0.5679012345679012], [0.7309228039041704, 0.44642857142857145], [0.6918367346938775, 0.33513513513513515], [0.38027108433734946, 0.38265306122448983], [0.5202546296296297, 0.5555555555555556], [0.5698720166032515, 0.5747427175998604], [0.5773420479302832, 0.5773420479302832], [0.5739795918367346, 0.625], [0.5164292279411764, 0.27687590187590183], [0.41360294117647056, 0.41296296296296303], [0.46499999999999997, 0.6859756097560975], [0.372, 0.372], [0.5294873855053832, 0.5294873855053832], [0.32327586206896547, 0.4295051353874883], [0.4263888888888889, 0.4766949152542372], [0.5563218390804598, 0.5742821473158551], [0.8200597312095569, 0.6696428571428572], [0.6476468138275718, 0.4597938144329897], [0.5306603773584906, 0.485126253891387], [0.3896604938271605, 0.530952380952381], [0.8918539325842695, 0.7773446457234581], [0.6880733944954129, 0.14018691588785046], [0.3, 0.29523809523809524], [0.4440366972477064, 0.3444444444444445], [0.17241379310344826, 0.3177966101694915], [0.4810495626822157, 0.625], [0.27777777777777773, 0.31562500000000004], [0.6918367346938775, 0.6918367346938775], [0.38265306122448983, 0.10869565217391303], [0.5160550458715595, 0.5160550458715595], [0.46875, 0.40322580645161293], [0.36351165980795613, 0.27013251783893977], [0.21978021978021975, 0.34307065217391297], [0.8103975535168196, 0.6343858298036196], [0.8152173913043477, 0.6222271517302573], [0.9995, 0.5948372615039282], [0.256551724137931, 0.21767241379310345], [0.40879120879120884, 0.37500000000000006], [0.9993141289437586, 0.9993141289437586], [0.8287608596250572, 0.6656383483626008], [0.6974657995066158, 0.7687074829931974], [0.2929133858267717, 0.2929133858267717], [0.5782312925170067, 0.25510204081632654], [0.37500000000000006, 0.41682242990654206], [0.5616605616605616, 0.5616605616605616], [0.39480452674897115, 0.25], [0.46875, 0.46875], [0.3546348314606741, 0.3506944444444444], [0.5575, 0.5575], [0.6724489795918367, 0.5841316118284048], [0.4213483146067415, 0.25], [0.36764705882352944, 0.3669544740973313], [0.7948022959183674, 0.6724489795918367], [0.1834862385321101, 0.3181818181818182], [0.5215419501133786, 0.5215419501133786], [0.8301839254220206, 0.8301839254220206], [0.4505050505050505, 0.5739795918367346], [0.568544708029197, 0.3960396039603961], [0.4179775280898876, 0.48478260869565226], [0.66167290886392, 0.625], [0.616925669350309, 0.1851851851851852], [0.6859756097560975, 0.45925925925925926], [0.6954520089285714, 0.1875], [0.5377777777777778, 0.2450980392156863], [0.8421440865502825, 0.8421440865502825], [0.7361111111111112, 0.46875], [0.6600900423728814, 0.6600900423728814], [0.5964109781843773, 0.5625], [0.4536585365853659, 0.4481927710843373], [0.6578144078144077, 0.5472527472527473], [0.40888888888888886, 0.44034536891679743], [0.7014492753623188, 0.7014492753623188], [0.4523364485981308, 0.4523364485981308], [0.6233062330623306, 0.41666666666666663], [0.738954922628392, 0.738954922628392], [0.32763532763532766, 0.32763532763532766], [0.7361111111111112, 0.6320224719101123], [0.5555555555555555, 0.5253507653061225], [0.484, 0.23662551440329216], [0.5318681318681319, 0.4795698924731184], [0.5257009345794392, 0.3188131313131313], [0.43684710351377026, 0.43684710351377026], [0.6091911764705883, 0.5667811679127096], [0.4227272727272727, 0.4275862068965518], [0.32206632653061223, 0.5575], [0.47959183673469385, 0.47959183673469385], [0.45731707317073167, 0.47450980392156866], [0.4295051353874883, 0.4295051353874883], [0.3381818181818182, 0.4101694915254237], [0.26976495726495725, 0.23554104477611937], [0.4641544117647058, 0.446], [0.3177966101694915, 0.3747899159663866], [0.7500000000000001, 0.46562314246086783], [0.8861997310842195, 0.5111111111111111], [0.544452519379845, 0.48478260869565226], [0.8466372282608694, 0.755560651226783], [0.32206632653061223, 0.32206632653061223], [0.3872, 0.29523809523809524], [0.5160550458715595, 0.3468406593406593], [0.41360294117647056, 0.2715328467153285], [0.7853703279064436, 0.6222271517302573], [0.6071019473081329, 0.3155006858710563], [0.8152173913043477, 0.9298245614035089], [0.4732510288065843, 0.582287961055982], [0.5612244897959183, 0.5076058201058201], [0.5739795918367346, 0.3795918367346939], [0.4440366972477064, 0.40917431192660547], [0.12820512820512822, 0.2839506172839506], [0.5575, 0.4224058769513315], [0.44999999999999996, 0.5506172839506173], [0.19132653061224492, 0.3757575757575758], [0.4955555555555556, 0.34307065217391297], [0.2525, 0.436046511627907], [0.46875, 0.443841872413301], [0.3599374021909233, 0.5157198014340871], [0.5377777777777778, 0.05617977528089887], [0.1111111111111111, 0.3155006858710563], [0.7636335784313727, 0.32206632653061223], [0.5698720166032515, 0.5698720166032515], [0.2735294117647059, 0.3089774557165861], [0.16666666666666666, 0.10989010989010987], [0.41333333333333333, 0.36134651600753287], [0.7309228039041704, 0.7309228039041704], [0.6400966183574879, 0.647130647130647], [0.6724489795918367, 0.36831683168316837], [0.5902439024390245, 0.3896604938271605], [0.35046728971962615, 0.4054545454545455], [0.5625, 0.5569306930693068], [0.36831683168316837, 0.290625], [0.5438202247191011, 0.4213483146067415], [0.4472257653061224, 0.45272727272727276], [0.41802832244008714, 0.5111111111111111], [0.5563218390804598, 0.5563218390804598], [0.6465763875643715, 0.29224537037037035], [0.7711943069306932, 0.5989583333333334], [0.6009615384615385, 0.4445422535211268], [0.864795918367347, 0.4481927710843373], [0.446, 0.31250000000000006], [0.7270233196159123, 0.39453125], [0.7515909589642309, 0.6725967540574282], [0.18790849673202614, 0.3234880450070324], [0.38413413413413416, 0.2293577981651376], [0.8880208333333333, 0.7687074829931974], [0.5975308641975308, 0.5698720166032515], [0.2839506172839506, 0.42564102564102574], [0.5975308641975308, 0.5902439024390245], [0.6376262626262627, 0.6376262626262627], [0.618131868131868, 0.625], [0.2118288590604027, 0.21618150684931506], [0.6284569902727446, 0.6284569902727446], [0.6360544217687074, 0.6360544217687074], [0.4043478260869566, 0.4043478260869566], [0.7622047244094489, 0.6775541946145621], [0.4732510288065843, 0.34766355140186916], [0.8072916666666667, 0.6284569902727446], [0.32206632653061223, 0.5769944341372912], [0.7270233196159123, 0.31250000000000006], [0.6310013717421126, 0.6310013717421126], [0.703125, 0.1875], [0.6465763875643715, 0.2293577981651376], [0.9163223140495868, 0.6670168067226891], [0.5406060606060606, 0.6670494784189874], [0.5361402671755726, 0.5859375000000001], [0.9137614678899082, 0.537876167416119], [0.45510204081632655, 0.3876262626262626], [0.6332138590203108, 0.5260869565217392], [0.6506642512077294, 0.1851851851851852], [0.7687074829931974, 0.21978021978021975], [0.6724489795918367, 0.6988249845392702], [0.29224537037037035, 0.39118246687054015], [0.625, 0.5616605616605616], [0.5888888888888889, 0.600907029478458], [0.625, 0.625], [0.654320987654321, 0.4597938144329897], [0.8722527472527472, 0.7853703279064436], [0.7080965909090909, 0.5160550458715595], [0.854119425547997, 0.6696428571428572], [0.5300453514739228, 0.5300453514739228], [0.5503634475597092, 0.45510204081632655], [0.8918539325842695, 0.6777108433734939], [0.5902439024390245, 0.7687074829931974], [0.3547523427041499, 0.35907859078590787], [0.7098765432098765, 0.7098765432098765], [0.7937500000000002, 0.7937500000000002], [0.8654513888888888, 0.4955555555555556], [0.6936813186813185, 0.824175824175824], [0.45731707317073167, 0.446], [0.37878787878787884, 0.3188131313131313], [0.41333333333333333, 0.3506944444444444], [0.8211575489862951, 0.5503634475597092], [0.5667811679127096, 0.18382352941176472], [0.7212094907407407, 0.8287608596250572], [0.7789062500000001, 0.6312500000000001], [0.5076628352490421, 0.5076628352490421], [0.7934426229508196, 0.31250000000000006], [0.6859756097560975, 0.5813953488372093], [0.6657910689028086, 0.6657910689028086], [0.5208333333333333, 0.5208333333333333], [0.5989583333333334, 0.6849868660335421], [0.6443520642201835, 0.5300453514739228], [0.9990234375, 0.9990234375], [0.4472257653061224, 0.3506944444444444], [0.5931718481785236, 0.3806284418529316], [0.15, 0.15], [0.4505050505050505, 0.28714107365792757], [0.6215431415929203, 0.6289424860853432], [0.7948022959183674, 0.78677398989899], [0.48478260869565226, 0.36443494776828117], [0.8211575489862951, 0.6443520642201835], [0.5472527472527473, 0.600907029478458], [0.5452674897119341, 0.634712600636585], [0.7992187500000002, 0.32206632653061223], [0.4536585365853659, 0.7155612244897959], [0.8950617283950617, 0.5876795162509448], [0.8950617283950617, 0.3795918367346939], [0.32538659793814434, 0.3116531165311653], [0.6155365371955235, 0.647130647130647], [0.3639097744360902, 0.43314500941619577], [0.5424733996162567, 0.6904166666666668], [0.1851851851851852, 0.1851851851851852], [0.5215419501133786, 0.5461165048543689], [0.7521527129370266, 0.4810495626822157], [0.8030303030303031, 0.8030303030303031], [0.755560651226783, 0.8030303030303031], [0.41360294117647056, 0.5555555555555555], [0.2929133858267717, 0.20444444444444443], [0.3153153153153153, 0.5251825500842539], [0.4536585365853659, 0.46464646464646464], [0.5452674897119341, 0.4810495626822157], [0.600907029478458, 0.600907029478458], [0.5076628352490421, 0.4179775280898876], [0.6532519549876025, 0.6989795918367346], [0.66167290886392, 0.3177966101694915], [0.6988249845392702, 0.6988249845392702], [0.45510204081632655, 0.5333561996227062], [0.6988249845392702, 0.6171248568155785], [0.6114130434782608, 0.625], [0.3896604938271605, 0.25], [0.7361111111111112, 0.7361111111111112], [0.5269186712485682, 0.5269186712485682], [0.4776739356178608, 0.5876795162509448], [0.3444444444444445, 0.2388369678089304], [0.5863023175371843, 0.647130647130647], [0.537876167416119, 0.40760869565217384], [0.9530428249436514, 0.810909090909091], [0.5627906976744186, 0.3647058823529412], [0.4536585365853659, 0.4536585365853659], [0.5377777777777778, 0.5377777777777778], [0.46875, 0.46875], [0.6944444444444445, 0.6944444444444445], [0.40917431192660547, 0.4054545454545455], [0.4505050505050505, 0.15151515151515152], [0.41360294117647056, 0.2869318181818182], [0.7212094907407407, 0.7212094907407407], [0.446, 0.125], [0.625, 0.625], [0.6651234567901234, 0.2525], [0.9041027559546079, 0.7131391882595736], [0.5530265748031497, 0.40879120879120884], [0.5616605616605616, 0.4955555555555556], [0.5902439024390245, 0.31562500000000004], [0.6792413935271077, 0.15], [0.5199864498644986, 0.7361111111111112], [0.46296296296296297, 0.46296296296296297], [0.8918539325842695, 0.8918539325842695], [0.29523809523809524, 0.267478813559322], [0.4955555555555556, 0.3546348314606741], [0.738954922628392, 0.618131868131868], [0.703125, 0.5251825500842539], [0.6388888888888888, 0.2380952380952381], [0.8880208333333333, 0.9835843169176502], [0.8236151603498542, 0.6880733944954129], [0.5841316118284048, 0.5782312925170067], [0.9575062901873077, 0.806697108066971], [0.37878787878787884, 0.10752688172043011], [0.8918539325842695, 0.616925669350309], [0.6988249845392702, 0.4043478260869566], [0.551470588235294, 0.35493827160493824], [0.6447688564476887, 0.29760000000000003], [0.5813754073057795, 0.3747899159663866], [0.37500000000000006, 0.25555555555555554], [0.49975895870159076, 0.49975895870159076], [0.8819444444444444, 0.9993141289437586], [0.485126253891387, 0.43314500941619577], [0.39480452674897115, 0.39480452674897115], [0.38265306122448983, 0.3599374021909233], [0.5563218390804598, 0.5563218390804598], [0.34128440366972473, 0.41666666666666663], [0.6411049268192124, 0.14018691588785046], [0.4043478260869566, 0.5373493975903614], [0.618131868131868, 0.3188131313131313], [0.8918539325842695, 0.7861781076066792], [0.6181795634920636, 0.5681818181818182], [0.618131868131868, 0.5011235955056179], [0.9996243425995492, 0.9996243425995492], [0.4795698924731184, 0.6696428571428572], [0.611317254174397, 0.23023023023023023], [0.8236151603498543, 0.17857142857142858], [0.8017676767676769, 0.8017676767676769], [0.5304621848739496, 0.31525423728813556], [0.2485236220472441, 0.3357712765957447], [0.66167290886392, 0.49010989010989015], [0.7687074829931974, 0.7687074829931974], [0.6818181818181819, 0.520408163265306], [0.8687160326086956, 0.5679012345679012], [0.4634661835748792, 0.42720073103868417], [0.5739795918367346, 0.5739795918367346], [0.6782713085234094, 0.6988249845392702], [0.34128440366972473, 0.34128440366972473], [0.5162738496071829, 0.3757575757575758], [0.41666666666666663, 0.28714107365792757], [0.40879120879120884, 0.3260869565217391], [0.618131868131868, 0.2808302808302808], [0.5575, 0.5208333333333333], [0.4955555555555556, 0.625], [0.8152173913043477, 0.8152173913043477], [0.41333333333333333, 0.654320987654321], [0.446, 0.5667811679127096], [0.7789062500000001, 0.7789062500000001], [0.654320987654321, 0.654320987654321], [0.35830999066293184, 0.3811965811965813], [0.7485875706214691, 0.43069584736251404], [0.4282069970845481, 0.4795698924731184], [0.4240362811791383, 0.27555555555555555], [0.5506172839506173, 0.40879120879120884], [0.35118110236220473, 0.33573928258967634], [0.3878260869565217, 0.21475256769374415], [0.6226379440665155, 0.7212094907407407], [0.39574468085106385, 0.4505050505050505], [0.4732510288065843, 0.29523809523809524], [0.42613636363636365, 0.4399925107657742], [0.2652310924369748, 0.1293103448275862], [0.7773446457234581, 0.1234567901234568], [0.6944444444444445, 0.46890927624872564], [0.5645569620253165, 0.5717948717948719], [0.864795918367347, 0.864795918367347], [0.18691588785046728, 0.18518518518518517], [0.7773446457234581, 0.7773446457234581], [0.5318681318681319, 0.39453125], [0.5269186712485682, 0.3381818181818182], [0.582287961055982, 0.3468406593406593], [0.6506642512077294, 0.25302530253025296], [0.6944444444444445, 0.5876795162509448], [0.40879120879120884, 0.18292682926829268], [0.3468406593406593, 0.34307065217391297], [0.6392045454545455, 0.6392045454545455], [0.7052154195011338, 0.6320224719101123], [0.8993827160493828, 0.25510204081632654], [0.600907029478458, 0.7425742574257427], [0.5452674897119341, 0.09259259259259259], [0.46855921855921845, 0.16304347826086954], [0.8101794934841405, 0.8101794934841405], [0.650318287037037, 0.3611650485436893], [0.6792413935271077, 0.5739795918367346], [0.5495818399044207, 0.2293577981651376], [0.7937500000000002, 0.555775708341589], [0.3305340223944875, 0.625], [0.7309228039041704, 0.16666666666666666], [0.7390260631001373, 0.3188131313131313], [0.5782312925170067, 0.43509070294784574], [0.3234880450070324, 0.6696428571428572], [0.7861781076066792, 0.5377777777777778], [0.4732510288065843, 0.20000000000000004], [0.6320224719101123, 0.6320224719101123], [0.582287961055982, 0.6405895691609977], [0.4056437389770724, 0.4383680555555556], [0.34128440366972473, 0.5208333333333333], [0.654320987654321, 0.66167290886392], [0.6346938775510204, 0.6346938775510204], [0.600907029478458, 0.78677398989899], [0.6411049268192124, 0.6411049268192124], [0.6050290486564996, 0.5793795620437956], [0.4265202702702703, 0.4265202702702703], [0.15151515151515152, 0.2869318181818182], [0.28956422018348627, 0.28956422018348627], [0.4732510288065843, 0.4732510288065843], [0.3012048192771084, 0.33938172043010756], [0.6233062330623306, 0.6233062330623306], [0.7521527129370266, 0.6250000000000001]]}}