{"seed": 42, "num_examples": 256, "batch_size": 1, "captions": [[["An elephant is in the back of a truck."], ["An elephant in the back of a truck."]], [["A man doing a trick on a skateboard."], ["A man doing a trick on a skateboard on a street."]], [["A man standing on a tennis court holding a racket."], ["A man standing on a tennis court holding a ball."]], [["A man standing in front of a pizza in a box."], ["A man standing next to a box with a pizza."]], [["A pair of shoes and a pair of shoes on a table."], ["A girl sitting on a table with two pairs of scissors."]], [["A table with glasses of wine and bread on it."], ["A table with plates of food and glasses of wine."]], [["A living room with a couch and a table."], ["A living room with a couch and a table and a mirror."]], [["A man sitting at a table in a train station."], ["A group of people standing at a train station."]], [["A desk with two computer monitors and a keyboard."], ["A desk with two computer monitors and a keyboard."]], [["Two elephants and a baby elephant standing next to trees."], ["A group of elephants standing next to a tree."]], [["A bathroom with a toilet with a table."], ["A toilet with a seat on top of it."]], [["An airplane sitting on top of an airport runway."], ["An airplane sitting on top of an airport runway."]], [["A group of people riding a bike down a street."], ["Three men sitting on motorcycles in a gas station."]], [["Two giraffes and a baby giraffe standing next to a building."], ["A painting of giraffes and other animals in a building."]], [["A woman sitting on a toilet on a street."], ["A woman sitting on a toilet on the side of a street."]], [["A large clock on the side of a building."], ["A large clock in the side of a building."]], [["A man sitting on a beach next to a surfboard."], ["A man sitting on top of an umbrella."]], [["An orange cat laying on the hood of a car."], ["An orange cat laying on the hood of a car."]], [["A bride and groom standing next to a wedding cake."], ["A group of people standing around a table with cakes."]], [["A large dog sleeping on a bed."], ["A man laying in a bed holding toothbrushes."]], [["A baby laying in a bed with a blanket."], ["A baby laying in a hospital bed with a table."]], [["A train is sitting on the tracks at a train station."], ["A train is on the tracks at an airport."]], [["A stack of pancakes sitting on a plate on a table."], ["A stack of pancakes sitting on a plate on a table."]], [["A pair of scissors sitting on top of a table."], ["A pair of scissors sitting on top of a table."]], [["A book shelf with a bunch of books."], ["A book shelf with a bunch of books."]], [["Two birds sitting on top of a tree branch."], ["Two birds sitting on top of a tree branch."]], [["A woman sitting at a table eating food."], ["A woman taking a picture of herself in a kitchen."]], [["A man standing in the grass with a frisbee."], ["A man standing in the water with a frisbee."]], [["A parking meter sitting on the side of a street."], ["A parking meter on the side of a street."]], [["A phone sitting on a desk with a banana."], ["A half of a banana sitting on a desk with a phone."]], [["A group of people dressed in costumes walking down a street."], ["A group of people walking down a street talking on a cell phone."]], [["A table with glasses and a vase of flowers."], ["A table with a candle and a vase with flowers."]], [["A woman standing in a kitchen with a pot of food."], ["A woman cooking food in a pot on an oven."]], [["A clock tower in the middle of a street."], ["A building with a clock tower in front of it."]], [["Two tennis players shaking hands on a tennis court."], ["Two tennis players standing on top of a tennis court."]], [["A living room with a couch and a table."], ["A living room with a couch and a table and a window."]], [["A man sitting on a bench in front of a church."], ["A man sitting on a bench in front of a clock tower."]], [["A man riding on the back of an elephant."], ["A man riding on the back of an elephant."]], [["A stop sign with writing on it."], ["A stop sign with graffiti on the side of it."]], [["A white bathroom with a bath tub and a toilet."], ["A bathroom with a bath tub and a mirror."]], [["A large airplane sitting on top of an airport runway."], ["A group of people standing in front of an airplane."]], [["A blue bus parked on the side of a street."], ["A bus parked in front of a building."]], [["Two cats laying on top of a bed."], ["Two cats laying next to each other with a remote control."]], [["A pizza sitting on a plate next to a glass of beer."], ["A pizza sitting on top of a table with a glass of beer."]], [["A man riding a wave on a surfboard in the ocean."], ["A person riding a surfboard in the ocean."]], [["A plate with a sandwich and french fries."], ["A plate with a sandwich and french fries and a sandwich."]], [["A red and white bus parked in front of a building."], ["A bus parked in front of a building."]], [["A red and yellow train is on the tracks."], ["A train is sitting on the tracks next to a river."]], [["A black and white photo of a group of people."], ["A group of people standing in a cloudy sky."]], [["A man standing on a tennis court holding a racket."], ["A man standing on a tennis court holding a racket."]], [["A black and white stove top oven sitting in a kitchen."], ["A table with a bunch of food on top of it."]], [["A traffic light in the middle of a city street."], ["A painting of an intersection with a traffic light."]], [["A banana sitting on a plate next to a table."], ["A banana sitting on top of a plate."]], [["A young man wearing a white coat and a tie."], ["A man holding a white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white white."]], [["A person standing on skis on a snow covered slope."], ["A person standing on skis on top of a snow covered mountain."]], [["A kitchen with a table and a refrigerator."], ["A kitchen with a table and a refrigerator."]], [["A man flying through the air on a snowboard."], ["A man riding a snowboard on a snow covered slope."]], [["A pizza sitting on a plate next to a drink."], ["A plate of pasta and a pizza on a table."]], [["A cat playing with its reflection in a mirror."], ["A man looking at his reflection in a mirror."]], [["A vase with red flowers in it on a counter."], ["Flowers in front of an oven with a table."]], [["A group of people standing around a table with a cake."], ["A group of women standing around a table with a cake."]], [["A man and a woman standing next to each other."], ["An elderly man and a woman standing next to each other."]], [["A clock on a pole on a city street."], ["A clock tower in front of buildings on a street."]], [["A bathroom with a sink and a window."], ["An old truck parked next to an airplane."]], [["A man with a dog sitting on the stairs."], ["A group of people with luggage at an airport."]], [["A group of teddy bears sitting next to each other."], ["A group of teddy bears sitting next to an airplane."]], [["A young man riding a skateboard on a skate park."], ["A woman laying in a bed with a teddy bear and oranges."]], [["A stuffed teddy bear wearing a mask sitting on a bed."], ["A stuffed dog wearing goggles and goggles sitting on a bed."]], [["A group of people riding skis on a ski lift."], ["A group of people on top of a ski lift."]], [["A black bird sitting on a chair next to a woman."], ["A black bird sitting in front of chairs and chairs."]], [["A dining room with a table and chairs."], ["A dining room with a table and chairs."]], [["A young boy swinging a baseball bat at a ball."], ["A baseball player holding a bat at a ball on a field."]], [["A city street at night with a traffic light."], ["A city street at night with a green traffic light."]], [["A person standing on skis in the snow."], ["A person standing on skis on a snow covered slope."]], [["A bedroom with a bed with pillows on it."], ["A bedroom with a bed with grapes and a book."]], [["A man doing a trick on a skateboard at a skate park."], ["A man doing a trick on a skateboard at a skate park."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A group of horses grazing in a field."], ["A black and white photo of people on horses."]], [["A large swimming pool with a table in it."], ["A swimming pool with chairs and a table in it."]], [["A group of people standing on an airplane."], ["A group of people looking out the window of an airplane."]], [["A black cat sitting in front of a door."], ["A black dog sitting in front of a door."]], [["A woman standing on a tennis court with a ball."], ["A woman standing on a tennis ball on a court."]], [["A man standing on a tennis court with a racket."], ["A man standing on a tennis court holding a racket."]], [["A large bed with red pillows on top of it."], ["A large bed in a hotel room with a desk."]], [["An airplane flying over a tree in the sky."], ["An airplane flying in the sky over trees."]], [["A construction truck and orange cones on a street."], ["A large truck driving down a street with orange cones."]], [["A hot dog and a bottle of beer."], ["A painting of a sandwich and a bottle of beer."]], [["A red stop sign on the side of a street."], ["A stop sign on the side of a street with a street."]], [["A polar bear laying on the ground."], ["A polar bear laying on a blanket with a wall."]], [["A bunch of carrots and vegetables in baskets."], ["A bunch of baskets of carrots in baskets."]], [["A group of teddy bears sitting next to each other."], ["A pile of stuffed teddy bears sitting next to each other."]], [["A train is on the tracks under a bridge."], ["A train is sitting on the tracks at a train station."]], [["A plate of food on a table."], ["A plate of food on a table with a dog and a pizza."]], [["A street with a building and a sign on it."], ["An empty street with buildings and a street sign."]], [["A seagull flying over a beach next to the ocean."], ["A bird flying over a beach next to the ocean."]], [["A cat laying on top of a laptop computer."], ["A cat laying on top of a laptop."]], [["A group of people standing in front of a bus."], ["A group of people standing in a parking lot with buses."]], [["A bike sitting on the side of a train."], ["A train with a bike on the side of it."]], [["A man holding a sign in a kitchen."], ["A man holding a sign in a room."]], [["A black dog sitting in front of a mirror."], ["A black dog standing in a bathroom with a book."]], [["A person flying a kite next to the ocean."], ["A woman flying a kite next to the ocean."]], [["A person holding a cell phone in their hand."], ["A person holding a cell phone and two clocks."]], [["A row of bikes parked next to each other."], ["A row of bikes parked next to each other."]], [["Two elephants standing next to each other in a zoo."], ["Two elephants standing next to a dead elephant."]], [["A man holding a vase of flowers on a wall."], ["A woman holding a bouquet of flowers on a wall."]], [["A brown horse standing next to a barbed wire fence."], ["A horse and a baby horse standing in the sand."]], [["A red double decker bus with people on it."], ["A double decker bus with people on top of it."]], [["A motorcycle parked in the grass in a field."], ["A man standing next to a bike in the hay."]], [["A black stove top oven sitting in a kitchen."], ["A black stove top oven sitting in a kitchen."]], [["A kitchen with a blender on a counter."], ["A man sitting at a picnic table with food."]], [["A group of people flying kites in a field."], ["A painting of people flying kites in a field."]], [["A group of people sitting around a table eating food."], ["A large group of people sitting around a table eating food."]], [["Two cars parked in a parking lot with a surfboard on top of it."], ["A small car with two cars parked on a street with surfboards."]], [["A man standing next to a fire hydrant with water."], ["A row of parking meters on the side of a street."]], [["A person flying a bunch of kites in the air."], ["A large group of people flying kites in the air."]], [["A herd of cows grazing in a field."], ["A herd of cows grazing in a field."]], [["A bus parked on the side of a street."], ["A food truck parked on the side of a street."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A parking meter on the side of a street."], ["A rainbow in the top of a parking meter."]], [["A woman eating a sandwich and a drink."], ["A woman eating a donut and a cup of coffee."]], [["A horse standing next to a building."], ["A horse standing in the snow next to a barn."]], [["A man standing on a snowboard on a snow covered slope."], ["A young boy standing on a snowboard on a snow."]], [["A person riding a motorcycle on a track."], ["A man riding a motorcycle on a race track."]], [["A double decker bus driving down a street."], ["A red and white double decker bus driving down a street."]], [["A man sitting on a motorcycle."], ["A man sitting on a motorcycle next to a truck."]], [["A baseball player swinging a bat at a ball."], ["A baseball player swinging a bat at a game."]], [["A man and a woman laying on a bed."], ["A woman laying on a chair with a guitar."]], [["A group of pictures of food on a table."], ["A group of pictures of food on a table."]], [["A group of people playing tennis on a tennis court."], ["A group of people playing tennis on a tennis court."]], [["A double decker bus on a city street."], ["A red double decker bus driving down a city street with cars."]], [["A man taking a picture of himself in a mirror."], ["A man holding a cell phone in front of his face."]], [["A group of people playing with a cow on a beach."], ["A group of men with cows on the beach."]], [["A man in a costume standing on a trolley."], ["A man standing in the back of an ice cream truck."]], [["A woman playing a video game with a wii."], ["Two women playing a video game with a wii controller."]], [["A group of construction workers standing next to a fire hydrant."], ["Three construction workers standing next to a yellow fire hydrant."]], [["A white toilet with two skateboards on top of it."], ["A white toilet with two sets of toilet paper."]], [["Two giraffes and a baby giraffe standing next to a building."], ["Two giraffes and a baby giraffe standing next to a building."]], [["A plate of food and a cup of coffee."], ["A pizza and a cup of coffee on a table."]], [["A parking meter sitting on the side of a street."], ["A parking meter on the side of a street."]], [["A man doing a trick on a skateboard over an orange cone."], ["A man doing a trick on a skateboard over an orange cone."]], [["A group of people standing in a field."], ["A group of people standing in front of a cow."]], [["A man brushing his teeth in front of a mirror."], ["A young boy playing a video game with a wii."]], [["A man standing on a street next to a pole."], ["A man riding a skateboard down the stairs."]], [["A living room with chairs and a table."], ["A living room with a clock on the ceiling."]], [["Two young men playing a video game with a wii."], ["Two young men playing a video game with a wii."]], [["A group of people standing around a table with food."], ["A group of people standing around a table of food."]], [["A zebra standing next to each other on a field."], ["A zebra and a baby zebra standing on the beach."]], [["A woman standing on a tennis court holding a ball."], ["A man jumping in the air with a tennis racket."]], [["A cat sitting on a chair."], ["A cat laying on a chair on the beach."]], [["A blue bike parked on the side of a street."], ["A blue bike parked next to a rack in the snow."]], [["A group of people sitting at a table."], ["A group of people sitting at tables eating food."]], [["A young boy holding a baseball bat and a ball."], ["A young boy holding a baseball bat and a helmet."]], [["A young boy riding a skateboard in a street."], ["A man riding a skateboard on the street."]], [["A herd of giraffes running in a field."], ["A herd of giraffes running in a field."]], [["Two men in suits and ties standing on a street."], ["An old man and a woman standing in the street."]], [["A street sign with a person on it."], ["A street sign on top of a pole."]], [["A man holding a tennis ball on a tennis court."], ["A man swinging a tennis racket on a tennis court."]], [["A group of boats sitting in a harbor."], ["A dog and a group of people on boats in the water."]], [["A man wearing a red hat talking on a cell phone."], ["A woman smoking a cigarette in a restaurant."]], [["A woman playing with a frisbee in a field."], ["A young boy wearing a hat and a tie."]], [["A teddy bear sitting on top of a red jacket."], ["A teddy bear sitting on a red pillow."]], [["A man sitting in front of a cake."], ["A man holding a purple flower next to a cake."]], [["A group of people walking in the rain with umbrellas."], ["A person standing in the water with an umbrella."]], [["Three people standing on skis in the snow."], ["A man and a child on skis in the snow with an umbrella."]], [["A person standing next to a pile of luggage."], ["A red fire hydrant sitting next to a red fire hydrant."]], [["A white truck parked on the side of a street."], ["A street sign in front of a fire hydrant."]], [["A man walking on the tracks next to a train."], ["A person standing on the tracks with a train."]], [["A person riding a wave on a surfboard in the ocean."], ["A woman riding a wave on a surfboard in the ocean."]], [["A banana split is sitting on top of a table."], ["A banana split is sitting in a bowl with a table."]], [["A bedroom with a sink and a bed in it."], ["A lamp sitting on a table next to a bed."]], [["A wooden bench next to a truck on a street."], ["Two white trucks parked next to a wooden bench."]], [["A desk with two computer monitors and a laptop."], ["A desk with three computer monitors and a laptop."]], [["A man riding on the back of a brown horse."], ["A person riding a horse on a dirt road."]], [["A man riding a dirt bike on a dirt road."], ["A person riding a dirt bike in a field."]], [["A man flying through the air while riding a snowboard."], ["A man riding skis down a snow covered slope."]], [["A pizza sitting on top of a kitchen counter."], ["A pizza sitting on top of a stove."]], [["A person with a backpack looking in a small refrigerator."], ["A woman taking a picture of a cat with an umbrella."]], [["A city street at night with cars and traffic lights."], ["A city street at night with cars and people on bikes."]], [["A group of people playing a game of frisbee."], ["A group of men playing a game of frisbee."]], [["An open refrigerator with food in a room."], ["An open refrigerator with food in it."]], [["A kitchen with a stove and a refrigerator."], ["A kitchen with a stove and a refrigerator."]], [["Two cats sitting in front of a window."], ["Two cats sitting in front of a window at night."]], [["A statue of a clock on top of a street."], ["A statue with a clock tower with a ball."]], [["A large television in a bathroom with two sinks."], ["A bathroom with three sinks and a television in it."]], [["A dog laying on the floor in a room."], ["A dog laying on the floor next to a desk."]], [["A group of people standing in a field."], ["A group of people standing in a field with a frisbee."]], [["A black cat sitting next to a bottle of water."], ["A small cat sitting on a table."]], [["A person flying a kite on the beach."], ["A group of people flying kites on the beach."]], [["A woman sitting in a chair holding an umbrella."], ["A woman sitting in a chair holding an umbrella."]], [["Two giraffes standing in the middle of a field."], ["Two giraffes walking in the middle of a field."]], [["A desk with a laptop and a chair."], ["A chair with a laptop computer sitting on a desk."]], [["A bedroom with a bed and a fireplace."], ["A bedroom with a bed and a fireplace."]], [["A small bird standing on a tree branch."], ["A bird sitting on top of a tree branch."]], [["A bus with a picture on the side of it."], ["A bus with a picture on the side of a street."]], [["A zebra standing next to a tree in a field."], ["A woman standing next to a zebra in a field."]], [["A person sitting at a table with plates of pizza and salad."], ["Two plates of food and a glass of beer on a table."]], [["A man sleeping in a bed with a cat."], ["A woman sleeping in a bed with two cats."]], [["A man riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard in the ocean."]], [["A group of zebras standing in the dirt."], ["Two zebras standing next to each other on a wall."]], [["A group of planes flying in formation in the sky."], ["A group of planes flying in formation in the sky."]], [["A bedroom with a laptop and a dresser."], ["A group of luggage sitting next to a dresser."]], [["A picture of cupcakes on a television."], ["A group of cupcakes in a display case."]], [["A group of children feeding a giraffe at a zoo."], ["A young child standing next to a giraffe."]], [["A group of people standing around with animals in a street."], ["A group of people standing on the side of a street."]], [["A little girl eating a banana."], ["A little girl with a banana in her mouth."]], [["A bride and groom standing in a wedding."], ["A bride and groom cutting a wedding cake."]], [["A desk with a computer sitting on top of it."], ["A desk with a laptop and pictures on it."]], [["A man and a woman standing in front of a fruit stand."], ["A man and a woman standing in front of a fruit stand."]], [["An airplane flying in the sky."], ["An airplane flying in the sky."]], [["A group of zebras grazing in a field."], ["A group of zebras grazing in the grass."]], [["A small dog wearing a red bow tie sitting on steps."], ["A dog sitting on the floor in a room."]], [["A baby standing next to a pile of apples."], ["A person standing in front of a fruit stand."]], [["Two elephants standing next to each other in a field."], ["An elephant standing next to a baby elephant."]], [["A picture of a man on a bathroom floor."], ["A picture of a urinal in a bathroom with teddy bears."]], [["A train is on the tracks in a field."], ["A white train is on the tracks in a field."]], [["A man and a woman sitting on a park bench."], ["Two people sitting on benches in a park."]], [["A train is sitting on the tracks."], ["A train is sitting on the tracks."]], [["A tree with red apples on top of it."], ["An apple tree hanging on a wall in a room."]], [["A man standing on a tennis court holding a ball."], ["A man standing on a tennis court holding a ball."]], [["A group of people standing next to an airplane."], ["An airplane flying in the sky over a beach."]], [["A statue of a cow standing in a street."], ["A statue of a cow standing on the side of a street."]], [["A kitchen with a stove and a table."], ["A kitchen with a stove and a table."]], [["A cake and a table in a bakery."], ["A bunch of plates of food in a window."]], [["A dog in the side view mirror of a car."], ["A rear view mirror of a horse in a car."]], [["A toy is sitting next to a desk with a computer."], ["A toy is sitting next to a computer keyboard."]], [["A pizza sitting next to a can of soda."], ["A pizza and a can of soda and a pizza."]], [["A desk with a laptop computer sitting on top of it."], ["A desk with a laptop computer sitting on top of it."]], [["A crowd of people standing on a street with a traffic light."], ["A group of people standing in front of a building."]], [["A woman sitting at a table with two slices of pizza."], ["A woman sitting at a table eating pizza with a plate."]], [["A truck driving down a road with hay."], ["A truck with a dog driving down a road."]], [["A group of street signs on a pole."], ["A painting of a horse in front of a brick oven."]], [["A group of surfboards sitting on top of a beach."], ["A group of chairs on the beach next to the ocean."]], [["A man standing on a tennis court with a ball."], ["A man holding a tennis ball on a tennis court."]], [["A bathroom with a sink and a toilet in a mirror."], ["A bathroom with a sink and a toilet in it."]], [["A group of chefs preparing food in a kitchen."], ["A group of chefs preparing food in a kitchen."]], [["A group of people standing around a cake."], ["A group of people standing around a tray with a cake."]], [["A woman riding a pink bike down a street."], ["A man riding a pink bike down a street."]], [["A plate of food and a glass of wine on a table."], ["A plate of food on a table with bread and a glass of wine."]], [["A white cat laying on an office chair."], ["An orange cat laying on top of a chair."]], [["Two people standing in front of a bakery."], ["Three people looking at donuts in front of a donut shop."]], [["A group of people with umbrellas."], ["A group of umbrellas on top of a building."]], [["Two boats and a tractor on a beach."], ["A boat sitting on top of a beach."]], [["A refrigerator with a table in a room."], ["A mirror on the side of a bed in a room."]], [["Two cups and a table with a table."], ["A cup of coffee sitting on the beach with a surfboard."]], [["An airplane flying in the sky with a plane."], ["An airplane flying over a city street with a light."]], [["A group of cars on a city street with a traffic light."], ["A group of cars driving down a street with a large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large large."]], [["A person flying a kite in the water."], ["A person flying a kite in the water."]], [["A bathroom with a sink and a tub."], ["A bathroom with a toilet and a shower curtain."]], [["Two people sitting in front of a blue umbrella."], ["Three women and a woman sitting in front of an umbrella."]], [["A small plane parked on display at an airport."], ["A display window of a fighter jet on display in a store."]], [["A teddy bear sitting next to a man holding a tennis racket."], ["A woman holding an elephant s trunk."]], [["A group of people sitting at a table eating food."], ["A group of people sitting at a table eating food."]], [["A clock on a wall next to a mirror."], ["A clock on the side of a wall."]], [["A sandwich and food in a box."], ["A bag of food with a kite and a table."]], [["A cow and a calf standing in a field."], ["A cow and a cow standing in a field."]], [["A wooden bench sitting on the beach next to the ocean."], ["A bench sitting on the beach next to the ocean."]]], "scores": {"meteor": [[0.7687074829931974, 0.7853703279064436], [0.32206632653061223, 0.42216721672167207], [0.7585268884703913, 0.7585268884703913], [0.28774193548387095, 0.36525974025974023], [0.5555555555555556, 0.27777777777777773], [0.46890927624872564, 0.45074722802506817], [0.3896604938271605, 0.3996598639455783], [0.7485875706214691, 0.3811965811965813], [0.6944444444444444, 0.6944444444444444], [0.5318681318681319, 0.654320987654321], [0.46875, 0.46296296296296297], [0.7060399917542773, 0.7060399917542773], [0.3468406593406593, 0.3506944444444444], [0.5373493975903614, 0.6859756097560975], [0.8017676767676769, 0.9139118457300276], [0.43069584736251404, 0.3757575757575758], [0.7500000000000001, 0.4213483146067415], [0.6989795918367346, 0.6989795918367346], [0.616925669350309, 0.13761467889908252], [0.5645569620253165, 0.14018691588785046], [0.3506944444444444, 0.3468406593406593], [0.48478260869565226, 0.4955555555555556], [0.9054545454545455, 0.9054545454545455], [0.5251825500842539, 0.5251825500842539], [0.6861724281549355, 0.6861724281549355], [0.6310013717421126, 0.6310013717421126], [0.8918539325842695, 0.5625], [0.33929649758454106, 0.3066153997831016], [0.5318681318681319, 0.5681818181818182], [0.41666666666666663, 0.4000000000000001], [0.5769944341372912, 0.6004008746355685], [0.5782312925170067, 0.4263888888888889], [0.520408163265306, 0.5616605616605616], [0.6792413935271077, 0.5111111111111111], [0.6792413935271077, 0.5625], [0.5876795162509448, 0.5067567567567568], [0.7521527129370266, 0.8220833333333335], [0.9041027559546079, 0.9041027559546079], [0.6691919191919192, 0.618131868131868], [0.537876167416119, 0.5747427175998604], [0.5616605616605616, 0.25], [0.4536585365853659, 0.5575], [0.5011235955056179, 0.6400966183574879], [0.8099489795918368, 0.7410096046459682], [0.6545430672268908, 0.2949766355140187], [0.32206632653061223, 0.44158415841584164], [0.9086363636363638, 0.6465763875643715], [0.23662551440329216, 0.5353535353535354], [0.5160550458715595, 0.29224537037037035], [0.7789062500000001, 0.7789062500000001], [0.5060506050605059, 0.30789825970548856], [0.372, 0.3757575757575758], [0.618131868131868, 0.703125], [0.582287961055982, 0.22822085889570554], [0.446, 0.41802832244008714], [0.6388888888888888, 0.6388888888888888], [0.8017676767676769, 0.372], [0.6233062330623306, 0.5199864498644986], [0.8819444444444444, 0.5377777777777778], [0.40879120879120884, 0.2222222222222222], [0.6953898514851486, 0.6657910689028086], [0.5888888888888889, 0.6657910689028086], [0.8629377676996723, 0.38490853658536583], [0.39453125, 0.12], [0.4505050505050505, 0.11904761904761907], [0.45731707317073167, 0.45731707317073167], [0.5616605616605616, 0.16129032258064518], [0.30789825970548856, 0.38027108433734946], [0.40879120879120884, 0.27472527472527475], [0.565083176127594, 0.485126253891387], [0.46875, 0.46875], [0.8993827160493828, 0.45848267622461175], [0.625, 0.618131868131868], [0.29760000000000003, 0.647130647130647], [0.4505050505050505, 0.38490853658536583], [0.9139118457300276, 0.9139118457300276], [0.782267115600449, 0.782267115600449], [0.46875, 0.1234567901234568], [0.625, 0.40879120879120884], [0.5796973961998594, 0.35830999066293184], [0.6410256410256411, 0.5747427175998604], [0.37763136750763293, 0.4970472440944882], [0.1648351648351648, 0.20000000000000004], [0.4101694915254237, 0.5616605616605616], [0.625, 0.8918539325842695], [0.4440665154950869, 0.46890927624872564], [0.5076628352490421, 0.3279411764705883], [0.5625, 0.6592637054821929], [0.4207547169811321, 0.5251825500842539], [0.1875, 0.125], [0.5472527472527473, 0.34307065217391297], [0.7687074829931974, 0.6114130434782608], [0.2222711267605634, 0.27027027027027023], [0.1834862385321101, 0.1851851851851852], [0.5902439024390245, 0.6859756097560975], [0.4732510288065843, 0.5349990463475109], [0.7602601480152501, 0.47920792079207924], [0.4955555555555556, 0.3468406593406593], [0.5503634475597092, 0.6465763875643715], [0.8017676767676769, 0.31562500000000004], [0.4955555555555556, 0.4590482026143791], [0.5975308641975308, 0.5975308641975308], [0.9993141289437586, 0.9993141289437586], [0.7145928899082569, 0.5257009345794392], [0.5952065677966102, 0.36134651600753287], [0.446, 0.5111111111111111], [0.7687074829931974, 0.6918367346938775], [0.41296296296296303, 0.45731707317073167], [0.5506172839506173, 0.5506172839506173], [0.3194444444444444, 0.2504960317460318], [0.650318287037037, 0.5300453514739228], [0.616925669350309, 0.5769944341372912], [0.5943152454780362, 0.3757440476190476], [0.38110236220472443, 0.19965277777777776], [0.38490853658536583, 0.12195121951219512], [0.605, 0.605], [0.1851851851851852, 0.18292682926829268], [0.6962184873949581, 0.6962184873949581], [0.6310013717421126, 0.3896604938271605], [0.5076628352490421, 0.4766949152542372], [0.35866477272727276, 0.446], [0.7913056930693071, 0.6918367346938775], [0.6, 0.6792413935271077], [0.8918539325842695, 0.8466372282608694], [0.5563218390804598, 0.446], [0.30303030303030304, 0.3535353535353535], [0.6792413935271077, 0.25252525252525254], [0.5506172839506173, 0.5506172839506173], [0.6724489795918367, 0.6724489795918367], [0.1530612244897959, 0.40180180180180186], [0.618131868131868, 0.46464646464646464], [0.4634661835748792, 0.41333333333333333], [0.5452674897119341, 0.22590361445783136], [0.5679012345679012, 0.5724489795918367], [0.7309228039041704, 0.484], [0.6918367346938775, 0.31794871794871804], [0.38027108433734946, 0.38027108433734946], [0.5202546296296297, 0.4024496937882765], [0.5698720166032515, 0.5747427175998604], [0.5773420479302832, 0.5773420479302832], [0.5739795918367346, 0.372], [0.5164292279411764, 0.1694915254237288], [0.34128440366972473, 0.2607709750566893], [0.46499999999999997, 0.46296296296296297], [0.372, 0.372], [0.5294873855053832, 0.625], [0.43314500941619577, 0.43314500941619577], [0.4263888888888889, 0.4766949152542372], [0.5563218390804598, 0.46296296296296297], [0.8200597312095569, 0.6777108433734939], [0.6476468138275718, 0.6411049268192124], [0.43314500941619577, 0.485126253891387], [0.3896604938271605, 0.4179775280898876], [0.8918539325842695, 0.8918539325842695], [0.6880733944954129, 0.22865853658536583], [0.3, 0.3872], [0.4440366972477064, 0.4440366972477064], [0.17241379310344826, 0.21505376344086022], [0.4810495626822157, 0.16163793103448273], [0.27777777777777773, 0.13888888888888887], [0.6918367346938775, 0.45510204081632655], [0.43509070294784574, 0.21767241379310345], [0.5160550458715595, 0.23662551440329216], [0.46875, 0.3006535947712418], [0.36351165980795613, 0.23232323232323232], [0.20000000000000004, 0.3506944444444444], [0.8103975535168196, 0.3444444444444445], [0.8152173913043477, 0.6222271517302573], [0.9995, 0.6657910689028086], [0.256551724137931, 0.2929133858267717], [0.40879120879120884, 0.654320987654321], [0.9993141289437586, 0.8819444444444444], [0.7181571815718157, 0.7349537037037036], [0.6974657995066158, 0.6792413935271077], [0.2929133858267717, 0.11904761904761907], [0.25252525252525254, 0.25510204081632654], [0.37500000000000006, 0.2869318181818182], [0.5616605616605616, 0.5769944341372912], [0.39480452674897115, 0.4440665154950869], [0.46875, 0.4746835443037974], [0.3546348314606741, 0.3546348314606741], [0.5575, 0.6859756097560975], [0.6724489795918367, 0.5948372615039282], [0.41666666666666663, 0.27472527472527475], [0.36764705882352944, 0.5616605616605616], [0.7948022959183674, 0.6284097797534854], [0.1834862385321101, 0.17045454545454547], [0.5215419501133786, 0.3444444444444445], [0.8301839254220206, 0.8301839254220206], [0.4505050505050505, 0.3811965811965813], [0.5841316118284048, 0.4641544117647058], [0.4179775280898876, 0.4179775280898876], [0.66167290886392, 0.625], [0.616925669350309, 0.5769944341372912], [0.7740169238427077, 0.6233062330623306], [0.7150900900900901, 0.44285714285714284], [0.5377777777777778, 0.2839506172839506], [0.8421440865502825, 0.7095046854082998], [0.605, 0.7332282110091743], [0.7485875706214691, 0.7485875706214691], [0.5964109781843773, 0.37878787878787884], [0.39952531645569617, 0.3194444444444444], [0.6578144078144077, 0.4213483146067415], [0.6428433641975309, 0.4958545918367347], [0.7014492753623188, 0.5162738496071829], [0.4523364485981308, 0.35046728971962615], [0.6233062330623306, 0.4955555555555556], [0.9670781893004115, 0.9670781893004115], [0.32763532763532766, 0.32763532763532766], [0.7361111111111112, 0.9990234375], [0.5555555555555555, 0.4955555555555556], [0.5681818181818182, 0.13888888888888887], [0.5318681318681319, 0.16], [0.3444444444444445, 0.2869318181818182], [0.43684710351377026, 0.43314500941619577], [0.6091911764705883, 0.35046728971962615], [0.4227272727272727, 0.4227272727272727], [0.3188131313131313, 0.372], [0.47959183673469385, 0.47959183673469385], [0.4505050505050505, 0.23148148148148148], [0.5033238366571701, 0.4770408163265306], [0.34766355140186916, 0.34766355140186916], [0.2720905172413793, 0.16666666666666666], [0.4641544117647058, 0.446], [0.34307065217391297, 0.41333333333333333], [0.5948372615039282, 0.372], [0.8861997310842195, 0.8861997310842195], [0.544452519379845, 0.21978021978021975], [0.8466372282608694, 0.6777108433734939], [0.32206632653061223, 0.23662551440329216], [0.3872, 0.15625000000000003], [0.5160550458715595, 0.21739130434782605], [0.41360294117647056, 0.28956422018348627], [0.6250000000000001, 0.7937500000000002], [0.9041027559546079, 0.9041027559546079], [0.8918539325842695, 0.8152173913043477], [0.4732510288065843, 0.4732510288065843], [0.5612244897959183, 0.4958010335917313], [0.5739795918367346, 0.6988249845392702], [0.370911214953271, 0.36079545454545453], [0.12820512820512822, 0.15151515151515152], [0.5575, 0.22030651340996166], [0.5011235955056179, 0.34307065217391297], [0.19132653061224492, 0.14851485148514848], [0.3506944444444444, 0.3116531165311653], [0.44285714285714284, 0.22441520467836257], [0.46875, 0.46875], [0.3599374021909233, 0.35493827160493824], [0.5377777777777778, 0.27777777777777773], [0.23148148148148148, 0.17006802721088438], [0.7636335784313727, 0.10309278350515463], [0.5698720166032515, 0.5698720166032515], [0.3896604938271605, 0.39453125], [0.17045454545454547, 0.1648351648351648], [0.41333333333333333, 0.31794871794871804], [0.7309228039041704, 0.7602601480152501]]}}