{"seed": 42, "num_examples": 512, "batch_size": 1, "captions": [[["An elephant in the back of a truck."], ["An elephant standing next to a truck with an elephant in front of it."]], [["A person doing a trick on a skateboard."], ["A man doing a trick on a skateboard in a parking lot."]], [["A man standing on a tennis court holding a racket."], ["A man standing on a tennis court holding a racket."]], [["A man standing in a box with a pizza in it."], ["A man standing next to a suitcase."]], [["A pair of shoes and a pair of shoes on a table."], ["A woman sitting on a table with a group of knives."]], [["A table with glasses of wine and bread on it."], ["A table with plates of bread and glasses of wine."]], [["A living room with a couch and a table."], ["A hotel room with a red couch and a desk and a television."]], [["A man sitting at a table with a bike."], ["A man riding a horse drawn carriage at a train station."]], [["A desk with two computer monitors and a keyboard."], ["A group of computer monitors and a keyboard."]], [["Two elephants and a baby elephant standing in a zoo."], ["An elephant standing in front of a fountain."]], [["A bathroom with a toilet with a table."], ["A bathroom with a toilet and a toilet paper on the toilet."]], [["A large airplane sitting on top of an airport runway."], ["An airplane taking off from an airport."]], [["A group of people riding a bike down a street."], ["A man riding on the back of a motorcycle."]], [["Two giraffes and a baby giraffe standing next to a building."], ["A baby giraffe standing next to a rock."]], [["A woman sitting on a toilet on a street."], ["A woman sitting on a couch holding a guitar."]], [["A large clock on the side of a wall."], ["A clock hanging on the wall of a bathroom."]], [["A man sitting on a beach next to a surfboard."], ["A man laying on a beach with a surfboard."]], [["An orange cat laying on the hood of a car."], ["A car with a cat sleeping in the car."]], [["A bride and groom standing next to a wedding cake."], ["A bride and groom standing in front of a wedding cake."]], [["A large dog sleeping on a bed."], ["A dog laying on a bed next to a book shelf."]], [["A baby laying in a bed with a blanket."], ["A baby sleeping on a blanket on a bed."]], [["A train is sitting on the tracks in a train yard."], ["A train is sitting on the tracks in a train yard."]], [["A stack of pancakes sitting on a plate on a table."], ["A stack of pancakes sitting on a plate on a table."]], [["A pair of scissors sitting on top of a table."], ["A pair of scissors sitting on top of a pile of rocks."]], [["A book shelf with a bunch of books."], ["A book shelf with a bunch of books."]], [["Two birds sitting on top of a tree branch."], ["Two birds sitting on top of a tree branch."]], [["A woman sitting at a table eating food."], ["A woman sitting at a table eating food."]], [["A man standing in a field with a frisbee."], ["A dog playing with a yellow frisbee in a field."]], [["A parking meter sitting on the side of a street."], ["A park bench sitting in the middle of a park."]], [["A phone sitting on top of a desk with a banana."], ["A desk with a banana and a banana on it."]], [["A group of people in costumes walking down a street."], ["A group of people standing in front of a street."]], [["A table with a vase of flowers on it."], ["A group of beds in a vase with flowers in it."]], [["A woman standing in a kitchen with a pot of food."], ["A woman standing in a kitchen holding a pot of food."]], [["A clock tower in the middle of a street."], ["A clock tower in front of a group of cars."]], [["Two tennis players standing on a tennis court."], ["Two tennis players standing on top of a tennis court."]], [["A living room with a couch and a table."], ["A living room with couches and a window."]], [["A man sitting on a bench in front of a church."], ["A black and white photo of a man sitting on a bench."]], [["A man riding on the back of an elephant."], ["A man riding on the back of an elephant."]], [["A stop sign with writing on it."], ["A stop sign with a sign with a writing on it."]], [["A white bathroom with a bath tub and a sink."], ["A picture of a person in front of a bathroom mirror."]], [["A large airplane sitting on top of an airport runway."], ["Two people standing in front of an airplane."]], [["A blue bus parked on the side of a street."], ["A double decker bus parked on the street."]], [["Two cats laying on top of a bed."], ["A black and white cat playing with a toy in the water."]], [["A pizza sitting on a plate next to a glass of beer."], ["A pizza on a plate with a glass of beer."]], [["A man riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard in the ocean."]], [["A plate with a sandwich and french fries."], ["A plate with a sandwich and french fries and a salad."]], [["A red and white bus parked in front of a building."], ["A bus parked on the side of a building."]], [["A train is sitting on the tracks."], ["A train is sitting on the tracks in the woods."]], [["A black and white photo of a group of people."], ["A black and white photo of a group of people with frisbees."]], [["A man standing on a tennis court holding a racket."], ["A man holding a tennis racket on a tennis court."]], [["A black and white stove top oven sitting in a kitchen."], ["A stove top oven with a table in it."]], [["A traffic light over a city street with a building."], ["A traffic light over a street with buildings."]], [["A banana sitting on a plate next to a table."], ["A banana sitting on top of a plate."]], [["A man in a white uniform holding a knife."], ["A statue of a person in a room with books."]], [["A person standing on skis on a snow covered slope."], ["A woman riding skis down a snow covered slope."]], [["A kitchen with a table and a refrigerator."], ["A kitchen with a table and chairs in it."]], [["A man flying through the air on a snowboard."], ["A brown bear laying on the floor under an umbrella."]], [["A pizza sitting on a plate next to a garnish."], ["A pizza sitting on a wooden table next to a bottle of wine."]], [["A cat playing with its reflection in a mirror."], ["A woman looking at her reflection in a mirror."]], [["A vase with red flowers in front of a fireplace."], ["Flowers in front of a microwave with wine glasses."]], [["A group of women standing around a table with a cake."], ["A group of people standing around a table with food on it."]], [["A man and a woman standing next to each other."], ["An old man and a woman standing next to each other."]], [["A clock on a pole on a city street."], ["A clock on the side of a city street."]], [["A bathroom with two sinks and a wall."], ["A kitchen with a stove and a table."]], [["A man with a dog sitting on the stairs."], ["A person with a tie on top of stairs."]], [["A group of teddy bears sitting next to each other."], ["A group of teddy bears sitting next to each other."]], [["A young man riding a skateboard at a skate park."], ["A man holding an upside down skateboard in the air."]], [["A stuffed teddy bear wearing a mask on a bed."], ["A teddy bear sitting next to a pile of purple yarn."]], [["A group of people skiing down a ski lift."], ["A group of people skiing down a snow covered slope."]], [["A black bird sitting on a chair next to a woman."], ["A bird sitting on a chair with a chair."]], [["A dining room with a table and chairs."], ["A dining room with a table and chairs."]], [["A young boy swinging a baseball bat at a ball."], ["A baseball player holding a bat at a ball."]], [["A city street at night with a traffic light."], ["A painting of a man on a city street."]], [["A woman standing on skis in the snow."], ["A man riding skis down a snow covered slope."]], [["A wooden bed with pillows on top of it."], ["A bed with white flowers in front of a fireplace."]], [["A man doing a trick on a skateboard at a skate park."], ["A man doing a trick on a skateboard at a skate park."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard."]], [["A group of horses grazing in a field."], ["A dog running with a soccer ball in its mouth."]], [["A swimming pool with a table and a table."], ["A large swimming pool with chairs and a beach."]], [["A group of people standing on an airplane."], ["A group of people standing next to an airplane."]], [["A black cat sitting in front of a door."], ["A cat laying on the floor in front of a door."]], [["A woman standing on a tennis court with a ball."], ["A woman hitting a tennis ball on a tennis court."]], [["A man standing on a tennis court with a ball."], ["Two people standing on a tennis court with a dog."]], [["A large bed with red pillows on top of it."], ["A bedroom with a bed with a desk."]], [["An airplane flying over a tree in the sky."], ["An airplane flying in the sky over palm trees."]], [["A construction truck and orange cones on a street."], ["A construction truck and orange cones in a field."]], [["A hot dog and a bottle of soda on tin foil."], ["A person holding a bottle of beer and a hot dog."]], [["A red stop sign on the side of a street."], ["A stop sign on a sidewalk."]], [["A white polar bear laying on top of a rock."], ["A animal standing on the arm of a couch with people."]], [["A bunch of carrots and vegetables in baskets."], ["A bunch of carrots and vegetables in a store."]], [["A group of teddy bears sitting next to each other."], ["Two teddy bears sitting on top of a glass table."]], [["A train is on the tracks under a bridge."], ["A train is on the tracks."]], [["A plate of food on a table."], ["A white plate of food on a table."]], [["A street with a building and a sign on it."], ["A city street with a man on the side of it."]], [["A seagull flying over a beach next to the ocean."], ["A bird flying over a beach next to the ocean."]], [["A kitten laying on top of a laptop computer."], ["A kitten laying on top of a laptop computer."]], [["A group of people standing in front of a bus."], ["A group of people standing in front of a bus."]], [["A bike sitting on the side of a train."], ["A train with a bike on the side of it."]], [["A man holding a sign in a kitchen."], ["A man standing next to a sign in a room."]], [["A black dog sitting in front of a mirror."], ["A black dog sitting on the floor in front of a mirror."]], [["A person flying a kite next to the ocean."], ["A person taking a picture of flowers in the ocean with the ocean."]], [["A person holding a cell phone in their hand."], ["A person holding a small device in their hand."]], [["A group of bikes parked next to each other."], ["A group of bikes parked next to stairs."]], [["Two elephants standing next to each other in a zoo."], ["Two people standing in the snow with an umbrella."]], [["A man holding a vase of flowers on a wall."], ["A woman brushing her teeth in a bathroom."]], [["A brown horse standing next to a barbed wire fence."], ["A painting of a horse and two baby horses."]], [["A red double decker bus with people on it."], ["A double decker bus parked on the side of a street."]], [["A motorcycle parked in the grass next to a tent."], ["A man standing in front of a tent at sunset."]], [["A black stove top oven sitting in a kitchen."], ["A microwave oven sitting on top of a table."]], [["A blender sitting on top of a table."], ["A table with a group of blue vases sitting on it."]], [["A group of people flying kites in a field."], ["A group of people flying kites in the air."]], [["A group of people sitting at a table eating food."], ["A group of people sitting around a table eating food."]], [["Two cars parked in a parking lot with a surfboard on top of it."], ["A car parked in the rain with horses."]], [["A man standing next to a fire hydrant with water."], ["A dog is drinking water from a fire hydrant."]], [["A group of people flying kites in the air."], ["A person flying through the air while riding a board."]], [["A herd of cows grazing in a field."], ["A herd of cows standing in a field behind a fence."]], [["A bus parked on the side of a street."], ["A bus parked on the side of a street."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A parking meter on the side of a street."], ["A parking sign on the side of a sidewalk."]], [["A woman eating a sandwich and a drink."], ["A woman eating a sandwich in a room."]], [["A horse grazing in the grass next to a house."], ["A horse grazing in the grass next to a house."]], [["A man standing on a snowboard on a snow covered slope."], ["A man standing on a snowboard on the top of a snow covered slope."]], [["A person riding a motorcycle on a race track."], ["A person riding a motorcycle on a track."]], [["A double decker bus driving down a street."], ["A double decker bus driving down a street."]], [["A man sitting on a motorcycle."], ["A man standing next to a motorcycle in a garage."]], [["A baseball player swinging a bat at a ball."], ["A baseball player swinging a bat at a ball."]], [["A man and a woman laying on a bed."], ["A man laying on a bed in a room."]], [["A group of pictures of a table with food."], ["A group of pictures of food and drinks."]], [["A group of people playing tennis on a tennis court."], ["Two men playing tennis on a tennis court."]], [["A double decker bus on a city street."], ["A double decker bus on a city street."]], [["A man taking a picture of himself with his cell phone."], ["A man taking a picture of himself in a mirror."]], [["A group of people playing with a cow on a beach."], ["A group of elephants playing with a rope."]], [["A man in a costume standing on a trolley."], ["A man in a costume standing in a train."]], [["A woman playing a video game with a wii."], ["Two women playing a video game with a wii."]], [["A group of construction workers standing next to a fire hydrant."], ["Two construction workers standing next to a yellow fire hydrant."]], [["A white toilet with two shirts on top of it."], ["A white toilet with two white rolls of toilet paper on it."]], [["Two giraffes and a baby giraffe standing next to a building."], ["A baby giraffe standing next to a building."]], [["A plate of food and a cup of coffee."], ["A plate of food and a cup of coffee."]], [["A parking meter sitting on the side of a street."], ["A man standing next to a parking meter."]], [["A man doing a trick on a skateboard over an orange cone."], ["A man doing a trick on a skateboard over an orange cone."]], [["A group of people standing in a field."], ["A group of people standing in front of a large american flag."]], [["A man brushing his teeth in front of a mirror."], ["A woman brushing her teeth in front of a bathroom mirror."]], [["A man standing on a street next to a pole."], ["A man holding a skateboard on the street."]], [["A group of chairs in a living room."], ["A room with chairs and a table in it."]], [["Two young men playing a video game with a wii."], ["Two men playing a video game with a wii."]], [["A group of people standing around a table."], ["A group of men standing around a table with food."]], [["A zebra standing next to a baby zebra."], ["Two zebras standing next to each other on the dirt."]], [["A woman standing on a tennis court holding a ball."], ["A woman standing on a tennis court holding a racket."]], [["A cat sitting on a chair."], ["A cat sitting on a chair next to two purse."]], [["A blue bike parked on the side of a street."], ["A blue bike parked next to a bike rack on a street."]], [["A group of people sitting at a table."], ["A group of people sitting in chairs in a room eating food."]], [["A young boy holding a baseball bat."], ["A young boy holding a baseball bat and a ball."]], [["A young boy riding a skateboard in a park."], ["A young boy riding a skateboard down a street."]], [["A herd of giraffes running in a field."], ["A herd of giraffes walking in a field."]], [["Two men in suits and ties standing on a street."], ["A man in a tie holding a microphone on a street."]], [["A street sign with a person on it."], ["A street sign with a man on it."]], [["A man holding a tennis ball on a tennis court."], ["A woman standing on a court with a tennis ball."]], [["A group of boats sitting in front of a fence."], ["A group of boats are parked at a dock."]], [["A man wearing a red hat talking on a cell phone."], ["A man talking on a cell phone in front of a restaurant."]], [["A woman with a frisbee in a field."], ["A young boy holding a frisbee in a field."]], [["A teddy bear sitting on top of a red jacket."], ["A teddy bear sitting on top of a pillow."]], [["A man cutting a cake in front of a table."], ["A man standing in the water with a large teddy bear."]], [["A group of people walking in the rain with umbrellas."], ["A person walking down a street in the water."]], [["Three people standing on skis in the snow."], ["A group of people skiing down a snow covered slope."]], [["A pile of luggage with a person standing next to it."], ["A bunch of luggage sitting on the ground."]], [["A white truck parked on the side of a street."], ["A car driving down a street with trees."]], [["A man walking on the tracks next to a train."], ["A man walking on the tracks next to a train."]], [["A person riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard in the ocean."]], [["A banana split is sitting on top of a table."], ["A banana with whipped cream on top of a bench."]], [["A lamp in a bed in a room with a table."], ["A bedroom with a bed and a mirror."]], [["A wooden bench with a truck on it."], ["A truck parked next to a bench in the water."]], [["A desk with two computer monitors and a laptop."], ["An office with a laptop computer sitting on a desk."]], [["A man riding a horse on a dirt road."], ["A man riding on the back of a brown horse."]], [["A man riding a dirt bike on a dirt road."], ["A group of people riding horses on a dirt road."]], [["A man flying through the air while riding a snowboard."], ["A person riding a snowboard down a snow covered slope."]], [["A pizza sitting on top of a kitchen counter."], ["A pizza sitting on top of a kitchen counter with a knife."]], [["A person with a backpack looking in a small refrigerator."], ["A group of people standing in front of a refrigerator."]], [["A city street at night with cars and traffic lights."], ["A group of people standing on the side of cars."]], [["A group of people playing a game of frisbee."], ["Two men playing with a frisbee in the sand a fence."]], [["An open refrigerator with food in a room."], ["An open refrigerator with food in front of a microwave."]], [["A kitchen with a stove and a refrigerator."], ["A kitchen with a stove and a refrigerator."]], [["Two cats sitting in front of a window."], ["Two cats sitting in front of a window."]], [["A statue of a clock tower in the middle of it."], ["A statue of a man with a clock tower."]], [["A large television in a bathroom with two sinks."], ["A bathroom with two sinks and a television in it."]], [["A room with a desk and a dog laying on the floor."], ["A teddy bear sitting in front of a book in a library with books."]], [["A group of people standing in a field."], ["A group of people standing in the grass with frisbees."]], [["A black and white cat sitting next to a bottle of water."], ["A person looking out a window with a cat sitting in a window."]], [["A person flying a kite on the beach."], ["A man flying a kite in the sky."]], [["A woman sitting in a chair holding an umbrella."], ["A woman in a dress holding an umbrella."]], [["Two giraffes standing in the middle of a field."], ["Two giraffes standing in the middle of a field."]], [["A desk with a laptop and a chair."], ["A desk with a laptop computer sitting on top of it."]], [["A bedroom with a bed and a fireplace."], ["A bedroom with a bed and a fireplace."]], [["A small bird standing on a tree branch."], ["A bird sitting on top of a tree branch."]], [["A bus with a picture on the side of a street."], ["A bus with a picture on the side of it."]], [["A zebra standing next to a tree in a field."], ["A zebra standing in front of a tree."]], [["A table with plates of pizza and a salad."], ["Two plates with a slice of pizza and a salad."]], [["A man sleeping in a bed with a cat."], ["A woman laying on a bed with a window."]], [["A person riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard in the ocean."]], [["A group of zebras walking in the dirt."], ["Three zebras standing on the side of a road."]], [["A group of jets flying in formation in the sky."], ["A group of planes flying in formation in the sky."]], [["A room with a bed and luggage and a dresser."], ["A room with luggage and a bed in it."]], [["A picture of a group of cupcakes on a table."], ["A cell phone with two bottles on top of it."]], [["A group of children feeding a giraffe."], ["A group of children standing at a baseball game."]], [["A group of people and animals in a field."], ["A herd of sheep walking down a street."]], [["A little girl eating a banana."], ["A woman sitting in a chair with a banana on her face."]], [["A bride and groom standing in a wedding."], ["A bride and groom cutting a wedding cake."]], [["A desk with a computer monitor and a keyboard."], ["A desk with a computer sitting on top of it."]], [["A man and a woman standing in front of a fruit stand."], ["A man and a woman standing in front of fruit at a fruit stand."]], [["An airplane flying in the sky."], ["An airplane flying in the sky."]], [["A herd of zebras grazing in a field."], ["A herd of zebras grazing in a field."]], [["A small dog wearing a red bow tie sitting on steps."], ["A woman standing in a kitchen with a pot."]], [["A young boy standing next to a pile of apples."], ["A person holding a bag of fruit."]], [["Two elephants standing next to each other in the dirt."], ["A baby elephant eating a piece of food."]], [["A picture of a group of people on a bathroom floor."], ["A man laying on the floor next to boxes of bread."]], [["A train is sitting on the tracks in a field."], ["A train is sitting on the tracks."]], [["A man and a woman sitting on a bench."], ["A man and a little girl sitting on park benches."]], [["A train is on the tracks in the snow."], ["A picture of a train on the tracks in the snow."]], [["A tree with red apples in it."], ["A group of flowers in the grass next to a tree."]], [["A man standing on a tennis court holding a ball."], ["A woman standing on a tennis court holding a racket."]], [["A group of people standing next to an airplane."], ["A group of animals in the snow."]], [["A statue of a cow standing in a street."], ["A statue of an elephant holding a sign."]], [["A kitchen with a stove and a table."], ["A chair with a cell phone sitting in it."]], [["A cake and pastries on a table in a restaurant."], ["A large cake sitting in front of a window."]], [["A rear view mirror of a motorcycle in a street."], ["A rear view mirror with a horse in a car."]], [["A toy is sitting on a desk with a computer."], ["A toy is sitting in front of a computer monitor."]], [["A pizza sitting next to a can of soda on a table."], ["A pizza and a can of soda on the grass and pizza."]], [["A desk with a laptop computer sitting on top of it."], ["An office with a laptop computer sitting in an office."]], [["A crowd of people standing on a sidewalk."], ["A crowd of people standing in front of a building with skateboards."]], [["A woman sitting at a table with a slice of pizza."], ["A woman sitting at a table with plates of food."]], [["A truck driving down a road with hay."], ["A truck driving down a road with hay."]], [["A group of street signs on a pole."], ["Two street signs on a pole in front of a fireplace."]], [["A group of surfboards sitting on top of a beach."], ["A person laying on the beach with a surfboard."]], [["A man standing on a tennis court with a ball."], ["A man jumping in the air on a tennis court."]], [["A bathroom with a sink and a mirror."], ["A bathroom with a bath tub and a table."]], [["A man preparing food in a kitchen."], ["Two men standing at a counter with food in an oven."]], [["A group of people standing around a cake."], ["A black and white photo of a child in a horse drawn carriage."]], [["A woman riding a pink bike down a street."], ["A man walking down a city street with cars."]], [["A plate of food and a glass of wine on a table."], ["A plate of food on a table with a glass of wine."]], [["A white cat laying on an office chair."], ["A white cat laying on a desk under a computer desk."]], [["Two people standing in front of a bakery."], ["A group of women standing in a store."]], [["A group of people with umbrellas."], ["A group of people with umbrellas in the rain."]], [["Two boats and a tractor on a beach."], ["A black and white photo of a man next to a boat."]], [["A refrigerator with a table in a room."], ["A bathroom with a shower in it and a table."]], [["Two cups and a table with a table."], ["Three cups with a person on top of a rug."]], [["An airplane flying in the sky with a large kite."], ["A person flying through the air while riding skis."]], [["A group of cars stopped at a traffic light."], ["A group of cars are parked on a traffic light with a white building."]], [["A person flying a kite in the water."], ["A plane flying over a tree in the water."]], [["A bathroom with a sink and a tub."], ["A bathroom with a sink and a tub and a shower."]], [["Two people sitting in front of a blue umbrella."], ["Two women sitting on the grass holding umbrellas."]], [["A small plane parked on display at an airport."], ["A display of planes on display at a museum."]], [["A teddy bear sitting on top of a table with a tennis racket."], ["A woman brushing her teeth in the water."]], [["A group of people sitting at a table eating food."], ["A group of people sitting at a table eating food."]], [["A bunch of clocks on a wall in a room."], ["A large vase sitting on top of a wall with a clock."]], [["A tray with a sandwich and fruit in it."], ["A tray of food with orange juice and a table."]], [["A cow and a calf standing in a field."], ["A cow and a baby calf standing in a field."]], [["A wooden bench sitting on the beach next to the ocean."], ["A guitar case sitting on the beach next to the ocean."]], [["A tall tower with a clock on the top of it."], ["A tower with a clock on the top of it."]], [["A black cat sitting in the seat of a car."], ["A cat sitting in the seat of a car."]], [["A group of cars stopped at a traffic light."], ["A traffic light sitting in front of cars."]], [["A group of people sitting at a table."], ["A woman sitting at a table with an umbrella."]], [["A man in a skirt and tie holding a racket."], ["A man wearing a hat holding his hand on his head."]], [["A woman riding a bike down a city street with cars."], ["A woman riding a bike on a city street with cars."]], [["A group of zebras standing in the dirt."], ["A herd of zebras eating hay on the side of a road."]], [["A man walking down a sidewalk with luggage in front of a building."], ["A red fire hydrant in the snow in a building."]], [["A statue of a clock with two birds on top of it."], ["A statue of an elephant in the back of a truck."]], [["An airplane flying in the sky."], ["An airplane with a candle on top of a bed."]], [["A kitchen with a sink and a window."], ["A kitchen with wooden cabinets and a counter."]], [["A teddy bear and a stuffed animal sitting on a bench."], ["A teddy bear sitting on top of a wooden bench."]], [["A man and a woman holding a piece of cake."], ["A man and a woman standing in a hotel room."]], [["A man riding a motorcycle down a street."], ["A man riding a motorcycle down a highway with giraffes."]], [["A plate with a sandwich and a bird on a table."], ["A plate of food and a fork on a table with boats."]], [["A yellow and pink bus parked in a field."], ["A pink bus parked on the grass in a field."]], [["A man and a woman sitting at a table with pizza."], ["Two men sitting at a table with two pizzas."]], [["A group of black and white cows in a barn."], ["A herd of cows laying in the hay in a barn."]], [["A young boy and a girl sitting at a table with food."], ["A young child sitting at a table with a plate of food."]], [["Two people playing a video game on a wii."], ["Two people playing a video game on a television."]], [["A group of people riding on horses in a field."], ["Two men riding horses in the sand."]], [["Two shots of two people standing on a table."], ["A man looking at his reflection in a display mirror."]], [["Two giraffes standing in a field of grass."], ["Two giraffes standing in the desert."]], [["A baseball player holding a bat on a field."], ["A baseball player holding a bat on a field."]], [["A teddy bear sitting on the side of a tree."], ["A large teddy bear sitting on the side of a street."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A black and white photo of a plane sitting on a street."]], [["A bathroom with a sink and a mirror."], ["A bathroom with a sink and a mirror."]], [["A baseball player holding a bat on a field."], ["A baseball player holding a bat on a field."]], [["A bunch of vegetables on a cutting board with a knife."], ["A group of carrots on a cutting board with a knife."]], [["A group of people skiing on a snow covered mountain."], ["A group of people standing on top of a snow covered mountain."]], [["A toilet in a bathroom with a green wall."], ["A bathroom with a toilet and a cup of coffee."]], [["A clock tower in the middle of a street."], ["A tower with a building in front of it."]], [["A clock on a pole in the middle of a field."], ["A clock in the middle of a park."]], [["A white toilet sitting in a bathroom with a desk."], ["A toilet with a table in a room."]], [["Two computer monitors and a keyboard on a desk."], ["Two computer monitors sitting on a desk with a keyboard."]], [["A person holding a sandwich in front of a table."], ["A person holding a sandwich on a table."]], [["A man riding a skateboard at a skate park."], ["A group of people riding a wave on surfboards."]], [["A person holding a piece of food in front of a building."], ["A person holding a half eaten doughnut in front of a building."]], [["A person taking a picture of a dog in a car window."], ["A person taking a picture of a goat in a car."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A black and white photo of a man sitting on a street."]], [["A pair of scissors sitting on top of a wooden box."], ["A pair of scissors sitting on top of a box with a pair of scissors."]], [["A desk with three computer monitors and a keyboard."], ["A desk with two computer monitors and a laptop."]], [["A man sitting in a hospital bed holding a plate of food."], ["A man sitting in a room holding a plate of food."]], [["A black and white cat sitting next to a laptop computer."], ["A cat sitting in front of a laptop computer keyboard."]], [["A man hitting a tennis ball with a racket."], ["A man jumping in the air with a tennis racket."]], [["A blue sign on the side of a street."], ["A sign in front of a building."]], [["A yellow and red train is on the tracks."], ["A train is sitting in the fog."]], [["A train is on a bridge over a city."], ["A painting of a train on a bridge."]], [["A group of cows standing in front of a church."], ["A group of cows standing in front of a church."]], [["Two seagulls standing on rocks next to the water."], ["Two seagulls standing on the beach next to the ocean."]], [["A man riding on the back of an elephant."], ["Two elephants standing next to a bird on a street."]], [["A desk with a laptop and a computer on it."], ["A desk with a computer sitting on top of it."]], [["A train is on the tracks next to a dirt road."], ["A train is sitting on the tracks at a train station."]], [["A black cat sitting on top of a television."], ["A television with an orange in front of it."]], [["A computer keyboard and a mouse on a desk."], ["A computer mouse sitting on top of a table."]], [["Three people standing in front of a bakery."], ["Three men standing in front of a display of donuts."]], [["A yellow truck parked in a parking lot."], ["A yellow truck parked in a field with balloons."]], [["A group of people standing on a snow covered mountain."], ["A group of people standing on a beach with skis."]], [["A group of people skiing down a snow covered slope."], ["A group of people skiing down a snow covered slope."]], [["A baseball player holding a bat on a field."], ["A baseball player holding a bat on a field."]], [["A woman standing on a tennis court holding a ball."], ["A woman standing on a tennis court with a ball."]], [["A man standing on the beach holding a surfboard."], ["A man standing on a beach with a surfboard."]], [["A man swinging a tennis racket on a tennis court."], ["A man standing on a tennis court holding a racket."]], [["A group of people skiing down a snow covered slope."], ["A man riding a snowboard down a snow covered slope."]], [["A group of people standing in the snow."], ["A man standing next to a sign in the snow."]], [["A white plate of broccoli and meat on it."], ["A pile of broccoli and strawberries on a table."]], [["A person holding a sandwich and a cup of coffee."], ["A stuffed animal and a drink on a table."]], [["A tray with a sandwich and a salad on a table."], ["A tray with a sandwich and a cup of coffee."]], [["A cat laying on top of a laptop computer."], ["A cat laying on top of a remote control."]], [["A red fire hydrant in the middle of a forest."], ["A red fire hydrant in the middle of a forest."]], [["A kitchen with a stove and a refrigerator."], ["A kitchen with a stove and a refrigerator."]], [["A group of people walking on a city street with a double decker bus."], ["A double decker bus on a city street."]], [["A group of horses and a baby horse eating hay."], ["A person riding on the back of a herd of elephants."]], [["A bird standing in the water in a body of water."], ["A bird standing in the water next to the shore."]], [["A baseball player throwing a ball on a field."], ["A baseball player throwing a ball on a field."]], [["A man sitting at a table looking at his cell phone."], ["A man sitting at a table with a cell phone."]], [["A bus driving down a city street with a building."], ["A bus driving down a city street with tall buildings."]], [["A woman standing in a kitchen preparing food."], ["A woman standing in a kitchen preparing food."]], [["A man doing a trick on a skateboard in the air."], ["A man doing a trick in the air on a skateboard."]], [["A pizza sitting on top of a table."], ["A pizza sitting on top of a plate at a game."]], [["A row of toilets in a bathroom with a window."], ["A bathroom with two sinks and a window."]], [["A bowl of food with broccoli and vegetables on a table."], ["A bowl of food with vegetables and a wooden spoon."]], [["A black and white photo of plane sitting on a plane black and plane."], ["A black and white photo of a plane on a street."]], [["A man walking a bike down a street."], ["A man riding a bike down a street with an umbrella."]], [["A plate of food with rice and vegetables on a table."], ["A plate of pasta and broccoli on a table."]], [["A small plane sitting on top of an airport runway."], ["A painting of an airplane sitting on a runway."]], [["A wooden bench sitting in the middle of a park."], ["A bench sitting on the side of a sidewalk next to a sidewalk."]], [["A wooden table with plates of food on it."], ["A table with plates of food and flowers."]], [["A man standing on the beach next to the ocean."], ["A person standing on a beach looking at the ocean."]], [["A cat is on the wall of a room."], ["A picture of a clock on the wall."]], [["A man and a woman standing next to each other."], ["A man and a woman standing in front of a door holding a baseball bat."]], [["A dog wearing a helmet sitting next to a motorcycle."], ["A picture of a man with a cell phone."]], [["A group of young people flying kites."], ["A group of people flying kites in front of houses."]], [["A woman taking a picture of a man on a cell phone."], ["A man taking a picture of himself and tie holding a tie."]], [["A street sign on a wooden pole."], ["A street sign on a pole with a street sign."]], [["A person doing a trick on a skateboard at a skate park."], ["A man doing a trick on a skateboard at a skate park."]], [["A group of people with luggage in an airport."], ["A group of people with luggage at an airport."]], [["A woman standing in front of a refrigerator."], ["A woman standing in front of a refrigerator."]], [["A group of street signs in front of a tall building."], ["Two street signs in front of a tall building."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A man in a white shirt and tie."], ["A man in a white shirt and tie holding a guitar."]], [["A blue suitcase sitting next to a wooden table."], ["A suitcase and a pair of shoes in a room."]], [["A person holding a piece of chocolate cake with a drink."], ["A person holding a chocolate cake and a glass of wine."]], [["A plate of food on a table with a glass of wine."], ["A plate of food on a table with a glass of wine."]], [["A plate of food with a salad and a table."], ["A plate of food with a salad and a table."]], [["A group of trucks parked in a parking lot."], ["A group of trucks parked in a parking lot."]], [["A herd of elephants walking in a field."], ["A herd of elephants walking in a field."]], [["A green broccoli plant growing in a field."], ["A green plant growing in the grass in a field."]], [["Two teddy bears sitting next to each other."], ["A painting of a teddy bear sitting next to each other."]], [["A group of people standing in a room."], ["Three men standing in a living room playing a video game."]], [["A person riding a horse jumping over an obstacle."], ["A person riding a horse jumping over an obstacle."]], [["Two people riding in a horse drawn carriage."], ["A painting of people riding horses in the water."]], [["A white sign in front of a brick building."], ["A white sign sitting on the side of a brick wall."]], [["A woman holding a tennis racket in front of a crowd."], ["A tennis player holding a racket on a tennis court."]], [["A blender sitting on top of a counter."], ["A blender with a fruit in it on a counter."]], [["A cat laying on top of a suitcase."], ["A cat laying on top of a pile of luggage."]], [["A donut hanging from a christmas tree."], ["A donut is sitting on top of a christmas tree with a pair of scissors."]], [["A kitchen with a stove and a refrigerator."], ["A picture of a kitchen with a refrigerator."]], [["An orange tree with a green leaves on it."], ["A tree with leaves on it in a field."]], [["A man standing next to a bike on a street."], ["A man standing next to a bike with a baby on a bike."]], [["A group of people flying a kite in a field."], ["A person holding a kite in a field."]], [["A person riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A man standing in a boat on the beach."], ["A black and white photo of a boat in the ocean."]], [["A young boy taking a picture of a cell phone."], ["A group of people standing around a table in a room."]], [["An airplane parked on the runway at an airport."], ["A large airplane sitting on top of an airport runway."]], [["A person skiing down a snow covered slope."], ["A man riding skis down a snow covered slope."]], [["A group of people riding horses on the beach."], ["A group of people riding horses in the water."]], [["A group of people sitting on a bench in a park."], ["A group of people sitting on benches in a park."]], [["A bowl of food with a fork on a table."], ["A salad in a bowl with scissors and vegetables."]], [["A man riding a skateboard on a rail with fire."], ["A group of people in the dark with lights."]], [["A baseball player throwing a ball on a field."], ["A baseball player throwing a ball on a field."]], [["An elephant standing next to a tree in a field."], ["An elephant walking in the grass next to a fence."]], [["A black refrigerator in a room with a table."], ["A black refrigerator in front of a door."]], [["Two signs on a pole on a city street."], ["Two street signs on the side of a road."]], [["A woman sitting on a motorcycle with a side car."], ["A woman sitting on a motorcycle with a side car."]], [["A bunch of oranges in a glass bowl on a table."], ["A bowl of oranges on a cutting board."]], [["A garden with plants in front of a building."], ["A garden with plants in front of a building."]], [["A man and a group of sheep in a field."], ["A group of sheep standing in front of a man on a field."]], [["A cat looking at a statue in front of a window."], ["A window with animals and bread in front of a window."]], [["A woman holding a baseball bat next to a table."], ["A woman holding a baseball bat in front of people."]], [["A group of zebras standing next to a fence."], ["Two zebras standing next to a stone wall."]], [["A polar bear standing next to a rock."], ["A polar bear standing in the grass in a field."]], [["A birthday cake and a bag on a table."], ["A bunch of cell phones and a bag on a table."]], [["A man riding a skateboard at a skate park."], ["A man riding a skateboard on a ramp."]], [["A building with a clock on the top of it."], ["A building with a clock tower on top of it."]], [["A woman standing next to a brown horse."], ["A horse standing on the side of a road."]], [["A person standing on a skateboard."], ["A picture of a man standing on top of an skateboard."]], [["A black bear standing on top of a log."], ["A black bear walking in the woods at night."]], [["A man in a santa hat holding a dog in front of a christmas tree."], ["A man in a santa hat holding a dog in a christmas tree."]], [["A kitchen with a refrigerator and a microwave."], ["A kitchen with a stove and a window."]], [["A man riding skis on a rail in the snow."], ["A man riding skis on a rail in the snow."]], [["A food truck parked in front of a building."], ["A picture of an food truck with people standing next to it."]], [["A basket of fruit in a table."], ["A basket of fruit with a red ribbon in it."]], [["A clock tower in the middle of a street."], ["A picture of a street with cars and a clock tower."]], [["A group of women standing in front of a sign."], ["Three women standing next to each other with bananas."]], [["A brown dog sitting next to a black and white dog."], ["A woman holding a tennis racket in the air."]], [["A pizza sitting on top of a table."], ["A sandwich with meat and vegetables on a table."]], [["A group of people standing in a store with bananas."], ["A group of people standing in a bar with fruits and vegetables."]], [["A young boy playing a video game in a living room."], ["A young boy playing a video game on a wii."]], [["A person riding a skateboard at a skate park."], ["A man riding a skateboard at a skate park."]], [["A man and a woman eating a piece of pizza."], ["Two women standing next to each other."]], [["A white toilet in a bathroom with a window."], ["A toilet in a bathroom with a window."]], [["A plate of chicken and potatoes and vegetables."], ["A bowl of vegetables and meat in it."]], [["A large airplane flying in the sky."], ["A large white bird flying in the sky."]], [["A woman laying in a bed in a room."], ["A person laying on a bed in a bedroom with lights."]], [["Two people playing a video game with a wii."], ["Two women playing a video game with a wii."]], [["A group of street signs on a pole on a street."], ["An old picture of a street sign on a city street."]], [["A girl sitting at a desk with a laptop computer."], ["A cat sitting at a table with a laptop."]], [["A dog standing on top of a skateboard."], ["A dog on a leash standing on a skateboard."]], [["A bike parked in front of a red building."], ["A bike parked in front of a house with a street."]], [["A plate with a piece of cake on a table."], ["A piece of cake flying in the sky."]], [["A man riding a wave on a surfboard in the ocean."], ["A person riding a wave on a surfboard in the ocean."]], [["A black and white photo of a girl riding on a horse."], ["A picture of two people riding horses in the snow."]], [["A white truck parked on the side of a street sign."], ["A street sign on the side of a truck."]], [["A black and white photo of boats parked next to a dock."], ["A black and white photo of cars and planes in the water."]], [["A person holding a cell phone in their hand."], ["A person holding a cell phone in their hand."]], [["A young boy swinging a tennis racket at a tennis ball."], ["A group of people playing tennis on a tennis court."]], [["A bedroom with a bed and a television on it."], ["A room with a bunch of scissors and a table with books."]], [["A herd of zebras eating from a trough."], ["A group of zebras eating from the water."]], [["A living room with a couch and a television."], ["A living room with a couch and a coffee table."]], [["A man riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the water."]], [["A group of parking meters on a city street."], ["A row of parking meters on the side of a street."]], [["A man wearing a helmet riding a skateboard down a street."], ["A young man riding a skateboard down a street."]], [["A bride and groom cutting a wedding cake."], ["A person cutting a cake with a knife."]], [["A man and a woman sitting at a table with an umbrella."], ["A woman sitting at a table with balloons."]], [["A train is on the tracks next to a river."], ["A group of boats on the side of a river."]], [["A traffic light on a city street with a building."], ["A train is sitting on the tracks next to a train."]], [["A young boy in the air with a tie."], ["Young boys playing baseball in the fog with a bat."]], [["A man playing a video game in a living room."], ["A man and a dog watching a television."]], [["A woman looking at her cell phone in a field."], ["A man in a yellow jacket looking at his cell phone."]], [["A cat sitting next to a brick wall."], ["A cat sitting on top of a bed in front of a mirror."]], [["A small bathroom with a toilet and a table."], ["A small bathroom with a toilet and a table."]], [["A person riding a wave on a surfboard in the ocean."], ["A man riding a wave on a surfboard in the ocean."]], [["A kitchen with a table and chairs in it."], ["A kitchen with a table and chairs in it."]], [["A little girl sitting in a bowl on a table."], ["A little girl sitting in a bowl on a table."]], [["A group of swans swimming in a body of water."], ["A lake with trees in the water with trees."]], [["A man standing on the back of a truck."], ["A man standing on the back of a truck."]], [["Two motorcycles parked next to each other in a street."], ["Three children standing next to motorcycles with a sign."]], [["A black and white cow standing in a barn."], ["A black and white cow standing in a barn."]], [["A group of people standing on a beach with boats."], ["A black and white photo of an ocean with a boat."]], [["A motorcycle parked on the side of a road."], ["A motorcycle parked on the side of a road."]], [["A group of people in a red boat in the water."], ["A man riding in a red boat in the water."]], [["A herd of sheep standing in front of a building."], ["A large crowd of people standing in front of a building."]], [["A suitcase sitting on the ground in the dirt."], ["A person laying on the ground next to a blue bag."]], [["A man riding a skateboard at a skate park."], ["A group of boats are sitting in the water."]], [["A man and a child on a snowboard down a snow covered slope."], ["A man walking in the snow with a plane."]], [["A dog and a dog looking at a window."], ["A cat standing next to a group of dogs."]], [["A baseball player standing on the mound."], ["A baseball player standing on the mound holding a glove."]], [["A man riding on the back of a horse."], ["A young child riding on the back of a horse."]], [["A bedroom with a bed and a table."], ["A bedroom with a bed with an umbrella on it."]], [["A small bed with bottles of water on a wooden floor."], ["A small bed with bottles of water on it."]], [["A pizza is sitting in front of an oven."], ["A pizza is sitting in front of an oven."]], [["A yellow bird sitting on a tree branch."], ["A small yellow bird sitting in a tree."]], [["A woman standing in two beds in a parking lot."], ["Two beds with a group of stuffed animals on it."]], [["A man standing in front of a refrigerator."], ["A man standing in front of a refrigerator."]], [["An elephant standing in front of a fence."], ["An elephant standing in front of a fence in an enclosure."]], [["A kitchen sink with a table with dishes on it."], ["A bathroom sink with a bunch of items on it."]], [["Two hot dogs with toppings on a table."], ["Two hot dogs in baskets on a table."]], [["A group of birds sitting on top of a wooden roof."], ["A group of birds sitting on top of a roof."]], [["A bus driving down a street in the rain."], ["A bus driving in the rain in the water."]], [["A young man kicking a soccer ball on a field."], ["A picture of a man with a clock."]], [["An airplane flying in the sky over a road."], ["A large airplane flying in the sky over people flying kites."]], [["A black cat sitting in the grass."], ["A black cat sitting in the grass."]], [["A bathroom with a toilet and a bath tub."], ["A bathroom with a toilet and a bath tub."]], [["A laptop computer sitting on top of a wooden table."], ["A computer keyboard and a table with a table."]], [["A group of people standing around a bench."], ["A group of people standing around a bench with frisbees."]], [["A plate of bread and a keyboard on a table."], ["A plate of bread and apple on a table."]], [["A cat standing in a bathroom with a toilet."], ["A cat standing on the floor next to a toilet."]], [["A person riding a wave on a surfboard in the ocean."], ["A white dog standing on the beach in the ocean."]], [["A man taking a picture of a cell phone."], ["A group of people standing in front of a stage."]], [["A man standing under a sign in the grass."], ["A man holding a sign in the grass holding a sign."]], [["A man doing a trick on a skateboard at a skate park."], ["A man doing a trick on a skateboard in the air."]], [["A woman walking a small white dog down a sidewalk."], ["A woman sitting on the floor with a laptop."]], [["A man riding a horse on a field next to the water."], ["A person riding a horse in front of mountains."]], [["A man riding a skateboard down a rail."], ["A man riding a skateboard down a rail in front of people."]], [["A person holding a bowl of food with food."], ["A picture of food in a plate and a table."]], [["A white plate with a sandwich on a table."], ["A sandwich in a basket on a table."]], [["Two hot dogs on a white plate."], ["A tray of food with noodles and vegetables on a tray."]], [["A black horse standing in a field."], ["A black and white photo of a horse standing in a field."]], [["A boat is sitting in the water next to a beach."], ["A large boat is sitting next to a body of water."]], [["A bathroom with a sink and a mirror."], ["A bathroom with a sink and a mirror."]], [["A red fire hydrant on the side of a street."], ["An old red fire hydrant sitting next to a tree."]], [["A toilet with the seat up in a bathroom."], ["A plane flying over a pile of clothes."]], [["A group of people standing next to a group of signs."], ["A group of people standing at a market."]], [["A cat laying on top of a laptop computer."], ["A cat laying on top of a white horse with a remote control."]], [["A man standing on a tennis court holding a racket."], ["A man holding a tennis racket on a tennis court."]], [["A cat standing in front of a computer monitor."], ["A dog sitting on a bed in front of a television."]], [["An airplane flying in the sky with a flag."], ["An airplane flying in the sky with a flag."]], [["A group of stuffed teddy bears sitting on a table."], ["A bunch of stuffed animals sitting on a table."]], [["A bathroom with a toilet and a sink and a tub."], ["A bathroom with a toilet and a sink and a shower."]], [["A group of bikes parked next to a building."], ["A picture of bikes parked next to a building."]], [["A man riding a snowboard down a snow covered slope."], ["Three pictures of a man riding a snowboard down a snow covered slope."]], [["A large clock in the middle of a building."], ["A large clock in the middle of a building."]], [["A boat is sitting in the water next to a lake."], ["A green truck parked in the park next to the water."]], [["An orange train is on the tracks."], ["A train is on the tracks in the fog."]], [["A man doing a trick on a skateboard on a city street."], ["A man doing a trick on a skateboard in the air."]]], "scores": {"meteor": [[0.7853703279064436, 0.5921052631578948], [0.47908863920099876, 0.6388888888888888], [0.7585268884703913, 0.7585268884703913], [0.4094799210006583, 0.10309278350515463], [0.5555555555555556, 0.21897810218978098], [0.46890927624872564, 0.45074722802506817], [0.3896604938271605, 0.4730983302411874], [0.5913134484563056, 0.4810495626822157], [0.6944444444444444, 0.34766355140186916], [0.3468406593406593, 0.28714107365792757], [0.46875, 0.4795698924731184], [0.8950617283950617, 0.2634593356242841], [0.3468406593406593, 0.5952380952380953], [0.5373493975903614, 0.5438202247191011], [0.8017676767676769, 0.43684710351377026], [0.3757575757575758, 0.6792413935271077], [0.7500000000000001, 0.6411049268192124], [0.6989795918367346, 0.30303030303030304], [0.616925669350309, 0.611317254174397], [0.5645569620253165, 0.611317254174397], [0.3506944444444444, 0.1111111111111111], [0.5373493975903614, 0.5373493975903614], [0.9054545454545455, 0.9054545454545455], [0.5251825500842539, 0.4320647177790035], [0.6861724281549355, 0.6861724281549355], [0.6310013717421126, 0.6310013717421126], [0.8918539325842695, 0.8918539325842695], [0.3811965811965813, 0.1968503937007874], [0.5318681318681319, 0.3468406593406593], [0.40760869565217384, 0.31562500000000004], [0.5160550458715595, 0.2929133858267717], [0.5681818181818182, 0.36831683168316837], [0.520408163265306, 0.6384943181818182], [0.6792413935271077, 0.5111111111111111], [0.600907029478458, 0.5625], [0.5876795162509448, 0.5503634475597092], [0.7521527129370266, 0.46046046046046046], [0.9041027559546079, 0.9041027559546079], [0.6691919191919192, 0.5555555555555555], [0.537876167416119, 0.3381818181818182], [0.5616605616605616, 0.1530612244897959], [0.4536585365853659, 0.46499999999999997], [0.5011235955056179, 0.2450980392156863], [0.8099489795918368, 0.56747552149851], [0.6545430672268908, 0.5813754073057795], [0.32206632653061223, 0.44158415841584164], [0.9086363636363638, 0.41296296296296303], [0.3835051546391753, 0.7789062500000001], [0.5160550458715595, 0.6058098915241772], [0.7789062500000001, 0.6724489795918367], [0.5060506050605059, 0.46296296296296297], [0.5160550458715595, 0.3795918367346939], [0.618131868131868, 0.703125], [0.6988249845392702, 0.20000000000000004], [0.446, 0.41666666666666663], [0.6388888888888888, 0.7390260631001373], [0.8017676767676769, 0.12195121951219512], [0.6233062330623306, 0.5247058823529411], [0.8819444444444444, 0.5377777777777778], [0.40879120879120884, 0.2222222222222222], [0.6657910689028086, 0.6782713085234094], [0.5888888888888889, 0.785891089108911], [0.8629377676996723, 0.4505050505050505], [0.41682242990654206, 0.1875], [0.4505050505050505, 0.18939393939393942], [0.45731707317073167, 0.45731707317073167], [0.40879120879120884, 0.15], [0.3116531165311653, 0.30789825970548856], [0.3506944444444444, 0.49010989010989015], [0.565083176127594, 0.31794871794871804], [0.46875, 0.46875], [0.8993827160493828, 0.5679012345679012], [0.625, 0.5506172839506173], [0.4179775280898876, 0.18518518518518517], [0.5975308641975308, 0.45731707317073167], [0.9139118457300276, 0.9139118457300276], [0.782267115600449, 0.6284569902727446], [0.46875, 0.3116531165311653], [0.3506944444444444, 0.5377777777777778], [0.5796973961998594, 0.754985754985755], [0.6410256410256411, 0.742296918767507], [0.37763136750763293, 0.6775541946145621], [0.1648351648351648, 0.40879120879120884], [0.4101694915254237, 0.34766355140186916], [0.625, 0.8819444444444444], [0.4440665154950869, 0.39480452674897115], [0.5569306930693068, 0.3747899159663866], [0.5625, 0.46458333333333335], [0.8103975535168196, 0.3381818181818182], [0.1875, 0.2469135802469136], [0.5472527472527473, 0.4263888888888889], [0.7687074829931974, 0.4310344827586207], [0.2222711267605634, 0.39453125], [0.1834862385321101, 0.23232323232323232], [0.5902439024390245, 0.6859756097560975], [0.6226379440665155, 0.6226379440665155], [0.7602601480152501, 0.7602601480152501], [0.4955555555555556, 0.3468406593406593], [0.5503634475597092, 0.582287961055982], [0.8017676767676769, 0.9880128061946244], [0.4955555555555556, 0.39574468085106385], [0.5975308641975308, 0.5975308641975308], [0.8819444444444444, 0.66167290886392], [0.7145928899082569, 0.3506944444444444], [0.5952065677966102, 0.14018691588785046], [0.446, 0.2974186307519641], [0.7687074829931974, 0.7095046854082998], [0.6981085116973618, 0.3661764705882353], [0.5506172839506173, 0.41666666666666663], [0.1875, 0.34843750000000007], [0.650318287037037, 0.4732510288065843], [0.7282110091743119, 0.616925669350309], [0.5943152454780362, 0.46875], [0.38110236220472443, 0.3506944444444444], [0.1234567901234568, 0.3116531165311653], [0.605, 0.35006703411291523], [0.1851851851851852, 0.1851851851851852], [0.6962184873949581, 0.6962184873949581], [0.6310013717421126, 0.39753401360544216], [0.5076628352490421, 0.5796973961998594], [0.5111111111111111, 0.5111111111111111], [0.7913056930693071, 0.7632211538461539], [0.5574156746031746, 0.6], [0.8918539325842695, 0.8918539325842695], [0.5563218390804598, 0.1648351648351648], [0.30303030303030304, 0.30303030303030304], [0.6792413935271077, 0.5782312925170067], [0.46296296296296297, 0.5575], [0.6724489795918367, 0.5739795918367346], [0.1530612244897959, 0.1530612244897959], [0.8030303030303031, 0.618131868131868], [0.4634661835748792, 0.33083645443196], [0.5452674897119341, 0.3444444444444445], [0.5679012345679012, 0.5679012345679012], [0.7309228039041704, 0.484], [0.6918367346938775, 0.29411764705882354], [0.38027108433734946, 0.38265306122448983], [0.5202546296296297, 0.5202546296296297], [0.5698720166032515, 0.605], [0.5773420479302832, 0.5773420479302832], [0.5739795918367346, 0.3647058823529412], [0.5164292279411764, 0.21897810218978098], [0.34128440366972473, 0.32206632653061223], [0.605, 0.33476548514142496], [0.372, 0.4505050505050505], [0.44999999999999996, 0.6133120078740157], [0.32327586206896547, 0.21657250470809788], [0.4263888888888889, 0.4263888888888889], [0.5563218390804598, 0.5902439024390245], [0.8200597312095569, 0.6696428571428572], [0.6476468138275718, 0.5514705882352942], [0.5306603773584906, 0.43314500941619577], [0.3896604938271605, 0.3896604938271605], [0.8918539325842695, 0.7773446457234581], [0.6880733944954129, 0.18072289156626503], [0.3, 0.3], [0.4440366972477064, 0.372], [0.31525423728813556, 0.3155006858710563], [0.4810495626822157, 0.6938463010814431], [0.2336448598130841, 0.21367521367521372], [0.6918367346938775, 0.6988249845392702], [0.33075299085151305, 0.31250000000000006], [0.5160550458715595, 0.3472222222222222], [0.46875, 0.5472527472527473], [0.47920792079207924, 0.39453125], [0.20000000000000004, 0.22471910112359547], [0.8103975535168196, 0.8103975535168196], [0.8152173913043477, 0.8152173913043477], [0.9995, 0.5888888888888889], [0.3993055555555555, 0.2601398601398601], [0.5739795918367346, 0.647130647130647], [0.9993141289437586, 0.4766949152542372], [0.8287608596250572, 0.7181571815718157], [0.6974657995066158, 0.40879120879120884], [0.2929133858267717, 0.46369203849518814], [0.25252525252525254, 0.2450980392156863], [0.37500000000000006, 0.28956422018348627], [0.5616605616605616, 0.206043956043956], [0.39480452674897115, 0.48478260869565226], [0.46875, 0.5439024390243904], [0.3546348314606741, 0.3546348314606741], [0.5575, 0.5575], [0.42216721672167207, 0.48443619872191296], [0.41666666666666663, 0.27472527472527475], [0.6881754609027336, 0.23489932885906042], [0.7948022959183674, 0.5625], [0.18018018018018017, 0.3191489361702128], [0.5215419501133786, 0.45510204081632655], [0.8301839254220206, 0.5739795918367346], [0.4505050505050505, 0.4505050505050505], [0.5841316118284048, 0.568544708029197], [0.4179775280898876, 0.4179775280898876], [0.66167290886392, 0.625], [0.5769944341372912, 0.616925669350309], [0.7740169238427077, 0.49387755102040815], [0.6944444444444444, 0.4399925107657742], [0.5377777777777778, 0.20202020202020204], [0.7095046854082998, 0.7095046854082998], [0.7361111111111112, 0.45925925925925926], [0.6600900423728814, 0.7485875706214691], [0.36134651600753287, 0.2191840277777778], [0.4536585365853659, 0.12195121951219512], [0.38659793814432986, 0.3506944444444444], [0.4543245869776481, 0.3], [0.7014492753623188, 0.33938172043010756], [0.4523364485981308, 0.35046728971962615], [0.4737654320987654, 0.6233062330623306], [0.9670781893004115, 0.9421702404158545], [0.32763532763532766, 0.32763532763532766], [0.6320224719101123, 0.6320224719101123], [0.5555555555555555, 0.21842355175688513], [0.484, 0.14150943396226415], [0.5318681318681319, 0.29760000000000003], [0.47920792079207924, 0.4054545454545455], [0.43314500941619577, 0.20609318996415774], [0.5876795162509448, 0.5625], [0.2222222222222222, 0.27173913043478265], [0.3835051546391753, 0.38027108433734946], [0.47959183673469385, 0.3524904214559387], [0.4505050505050505, 0.2373417721518987], [0.5033238366571701, 0.3], [0.34766355140186916, 0.12820512820512822], [0.2808302808302808, 0.27555555555555555], [0.446, 0.446], [0.3177966101694915, 0.2929133858267717], [0.618872549019608, 0.47450980392156866], [0.8861997310842195, 0.37500000000000006], [0.5011235955056179, 0.21505376344086022], [0.6861413043478259, 0.7602601480152501], [0.32206632653061223, 0.32206632653061223], [0.3872, 0.4472257653061224], [0.5160550458715595, 0.3271604938271605], [0.41360294117647056, 0.5164292279411764], [0.7853703279064436, 0.8654513888888888], [0.6071019473081329, 0.31250000000000006], [0.8918539325842695, 0.2127659574468085], [0.4732510288065843, 0.3303703703703704], [0.5612244897959183, 0.5076058201058201], [0.5739795918367346, 0.44158415841584164], [0.370911214953271, 0.2336448598130841], [0.12820512820512822, 0.3155006858710563], [0.5575, 0.6490885416666666], [0.5011235955056179, 0.21978021978021975], [0.19132653061224492, 0.20000000000000004], [0.38490853658536583, 0.3155006858710563], [0.4464285714285715, 0.37751677852349], [0.46875, 0.2583333333333333], [0.3599374021909233, 0.520408163265306], [0.5377777777777778, 0.22030651340996166], [0.23148148148148148, 0.1736111111111111], [0.7562196601941749, 0.11235955056179774], [0.5698720166032515, 0.5698720166032515], [0.2735294117647059, 0.2551020408163265], [0.3506944444444444, 0.37500000000000006], [0.41333333333333333, 0.36134651600753287], [0.7309228039041704, 0.6400966183574879], [0.6400966183574879, 0.647130647130647], [0.6724489795918367, 0.5162738496071829], [0.3896604938271605, 0.11235955056179774], [0.35046728971962615, 0.650318287037037], [0.5625, 0.31250000000000006], [0.36831683168316837, 0.36831683168316837], [0.5438202247191011, 0.6670494784189874], [0.3074380165289256, 0.2813953488372093], [0.41802832244008714, 0.2727272727272727], [0.5563218390804598, 0.3468406593406593], [0.6465763875643715, 0.6284569902727446], [0.7711943069306932, 0.5111111111111111], [0.6087662337662337, 0.4536585365853659], [0.864795918367347, 0.7181571815718157], [0.31250000000000006, 0.36764705882352944], [0.7270233196159123, 0.45731707317073167], [0.541304347826087, 0.8819444444444444], [0.18790849673202614, 0.5831325301204818], [0.38413413413413416, 0.5717962860820004], [0.8880208333333333, 0.9993141289437586], [0.43314500941619577, 0.4208695652173913], [0.2839506172839506, 0.22865853658536583], [0.6225, 0.5088141025641026], [0.6376262626262627, 0.6376262626262627], [0.618131868131868, 0.48478260869565226], [0.2118288590604027, 0.21471088435374147], [0.6284569902727446, 0.6284569902727446], [0.6360544217687074, 0.6360544217687074], [0.4043478260869566, 0.38027108433734946], [0.6775541946145621, 0.6938463010814431], [0.4732510288065843, 0.40917431192660547], [0.8072916666666667, 0.5300453514739228], [0.5769944341372912, 0.41682242990654206], [0.6859756097560975, 0.5011235955056179], [0.6310013717421126, 0.6488185975609756], [0.5439024390243904, 0.5575], [0.5452674897119341, 0.18518518518518517], [0.9163223140495868, 0.6614583333333333], [0.5406060606060606, 0.41967780788918996], [0.5361402671755726, 0.5813953488372093], [0.9996243425995492, 0.672514619883041], [0.4505050505050505, 0.4505050505050505], [0.6332138590203108, 0.6400966183574879], [0.6506642512077294, 0.3468406593406593], [0.7687074829931974, 0.3468406593406593], [0.6792413935271077, 0.38659793814432986], [0.29224537037037035, 0.32538659793814434], [0.625, 0.35046728971962615], [0.5888888888888889, 0.5888888888888889], [0.625, 0.647130647130647], [0.654320987654321, 0.31562500000000004], [0.8722527472527472, 0.40879120879120884], [0.7080965909090909, 0.35830999066293184], [0.854119425547997, 0.23148148148148148], [0.5300453514739228, 0.4590482026143791], [0.5503634475597092, 0.5625], [0.8918539325842695, 0.654320987654321], [0.5902439024390245, 0.5902439024390245], [0.35907859078590787, 0.35907859078590787], [0.7098765432098765, 0.7098765432098765], [0.8993827160493828, 0.7937500000000002], [0.8654513888888888, 0.5679012345679012], [0.5616605616605616, 0.6936813186813185], [0.45731707317073167, 0.3116531165311653], [0.6861724281549355, 0.5888888888888889], [0.5975308641975308, 0.3506944444444444], [0.8211575489862951, 0.1851851851851852], [0.5667811679127096, 0.7253676470588236], [0.7212094907407407, 0.5208333333333333], [0.7789062500000001, 0.7789062500000001], [0.5076628352490421, 0.5076628352490421], [0.7934426229508196, 0.17482517482517482], [0.6859756097560975, 0.18072289156626503], [0.6657910689028086, 0.5902439024390245], [0.5208333333333333, 0.5208333333333333], [0.5989583333333334, 0.6918367346938775], [0.6443520642201835, 0.5251825500842539], [0.9990234375, 0.9990234375], [0.4634661835748792, 0.4472257653061224], [0.5931718481785236, 0.611317254174397], [0.15, 0.1530612244897959], [0.36831683168316837, 0.25555555555555554], [0.6215431415929203, 0.6289424860853432], [0.7948022959183674, 0.5569306930693068], [0.48478260869565226, 0.36443494776828117], [0.8211575489862951, 0.41296296296296303], [0.4361263736263736, 0.5461165048543689], [0.5452674897119341, 0.6465763875643715], [0.7789062500000001, 0.5888888888888889], [0.45925925925925926, 0.5329861111111112], [0.8950617283950617, 0.3542857142857143], [0.8950617283950617, 0.15151515151515152], [0.32538659793814434, 0.43314500941619577], [0.6155365371955235, 0.4795698924731184], [0.3639097744360902, 0.43314500941619577], [0.6904166666666668, 0.6904166666666668], [0.1851851851851852, 0.1851851851851852], [0.5215419501133786, 0.5215419501133786], [0.7521527129370266, 0.6830929487179487], [0.8030303030303031, 0.8030303030303031], [0.755560651226783, 0.7080965909090909], [0.5377777777777778, 0.4766949152542372], [0.4958545918367347, 0.43945312499999994], [0.3153153153153153, 0.3153153153153153], [0.4536585365853659, 0.4536585365853659], [0.5452674897119341, 0.5452674897119341], [0.600907029478458, 0.600907029478458], [0.5076628352490421, 0.37796610169491524], [0.6532519549876025, 0.6289424860853432], [0.7773446457234581, 0.2272727272727273], [0.6988249845392702, 0.6988249845392702], [0.45510204081632655, 0.3188131313131313], [0.6988249845392702, 0.44158415841584164], [0.6114130434782608, 0.582287961055982], [0.46499999999999997, 0.38490853658536583], [0.7361111111111112, 0.6233062330623306], [0.5269186712485682, 0.5357142857142857], [0.34766355140186916, 0.4776739356178608], [0.3444444444444445, 0.3444444444444445], [0.5863023175371843, 0.598404255319149], [0.537876167416119, 0.40888888888888886], [0.810909090909091, 0.9530428249436514], [0.7390260631001373, 0.4323630136986301], [0.4536585365853659, 0.15625000000000003], [0.5377777777777778, 0.22865853658536583], [0.46875, 0.46296296296296297], [0.6944444444444445, 0.5975308641975308], [0.4054545454545455, 0.40917431192660547], [0.46668667466986796, 0.27555555555555555], [0.3758169934640523, 0.08333333333333333], [0.7212094907407407, 0.7212094907407407], [0.446, 0.31562500000000004], [0.625, 0.605], [0.6651234567901234, 0.3506944444444444], [0.8833333333333334, 0.8833333333333334], [0.6428433641975309, 0.3546348314606741], [0.5679012345679012, 0.5679012345679012], [0.5902439024390245, 0.43764705882352933], [0.7711943069306932, 0.3126050420168068], [0.5199864498644986, 0.7181571815718157], [0.46296296296296297, 0.32206632653061223], [0.8918539325842695, 0.618131868131868], [0.29523809523809524, 0.18181818181818182], [0.4955555555555556, 0.7131391882595736], [0.738954922628392, 0.49010989010989015], [0.703125, 0.353968253968254], [0.6205128205128205, 0.36144578313253006], [0.8880208333333333, 0.5679012345679012], [0.8236151603498542, 0.6967453145917002], [0.5841316118284048, 0.5215419501133786], [0.806697108066971, 0.806697108066971], [0.48888888888888893, 0.309436274509804], [0.7120253164556962, 0.616925669350309], [0.6988249845392702, 0.36831683168316837], [0.551470588235294, 0.3155006858710563], [0.6447688564476887, 0.23148148148148148], [0.5964109781843773, 0.26976495726495725], [0.37500000000000006, 0.43725490196078437], [0.4359925788497217, 0.49975895870159076], [0.8819444444444444, 0.9993141289437586], [0.485126253891387, 0.32608695652173914], [0.39480452674897115, 0.3984942886812045], [0.3599374021909233, 0.2607709750566893], [0.7641465677179964, 0.755560651226783], [0.41666666666666663, 0.46464646464646464], [0.6411049268192124, 0.5162738496071829], [0.4043478260869566, 0.40760869565217384], [0.618131868131868, 0.5377777777777778], [0.8918539325842695, 0.6411049268192124], [0.6181795634920636, 0.5060506050605059], [0.618131868131868, 0.3546348314606741], [0.9996243425995492, 0.9054545454545455], [0.44285714285714284, 0.3468406593406593], [0.611317254174397, 0.7212094907407407], [0.8236151603498543, 0.6084656084656085], [0.8017676767676769, 0.8017676767676769], [0.5304621848739496, 0.31525423728813556], [0.2485236220472441, 0.19810508182601205], [0.5011235955056179, 0.5438202247191011], [0.7687074829931974, 0.7602601480152501], [0.6818181818181819, 0.6818181818181819], [0.654320987654321, 0.8687160326086956], [0.4634661835748792, 0.4240362811791383], [0.38448275862068976, 0.5739795918367346], [0.6782713085234094, 0.600907029478458], [0.34128440366972473, 0.23445463812436282], [0.31562500000000004, 0.14851485148514848], [0.41666666666666663, 0.2808302808302808], [0.40879120879120884, 0.3546348314606741], [0.4990583804143125, 0.2652310924369748], [0.5575, 0.45634920634920634], [0.4955555555555556, 0.4955555555555556], [0.8152173913043477, 0.8333333333333334], [0.41333333333333333, 0.41333333333333333], [0.446, 0.446], [0.7789062500000001, 0.5208333333333333], [0.654320987654321, 0.654320987654321], [0.12711864406779658, 0.17094017094017094], [0.5681818181818182, 0.5681818181818182], [0.23445463812436282, 0.2303832116788321], [0.4240362811791383, 0.4240362811791383], [0.5373493975903614, 0.5616605616605616], [0.4429133858267717, 0.3331163194444444], [0.3757575757575758, 0.6354359925788496], [0.6226379440665155, 0.10101010101010102], [0.39574468085106385, 0.4505050505050505], [0.41296296296296303, 0.3444444444444445], [0.42613636363636365, 0.582287961055982], [0.5681818181818182, 0.49010989010989015], [0.7773446457234581, 0.27472527472527475], [0.6157965194109771, 0.6944444444444445], [0.45925925925925926, 0.45925925925925926], [0.864795918367347, 0.39453125], [0.1834862385321101, 0.13761467889908252], [0.7773446457234581, 0.7773446457234581], [0.3546348314606741, 0.31250000000000006], [0.446, 0.28956422018348627], [0.5257009345794392, 0.4213483146067415], [0.6506642512077294, 0.5472527472527473], [0.5876795162509448, 0.45925925925925926], [0.40879120879120884, 0.3546348314606741], [0.3506944444444444, 0.21739130434782605], [0.6392045454545455, 0.6392045454545455], [0.7052154195011338, 0.7052154195011338], [0.8993827160493828, 0.41333333333333333], [0.600907029478458, 0.8950617283950617], [0.31525423728813556, 0.26976495726495725], [0.3506944444444444, 0.49010989010989015], [0.8101794934841405, 0.412087912087912], [0.650318287037037, 0.15], [0.6792413935271077, 0.6284097797534854], [0.5495818399044207, 0.5569306930693068], [0.8993827160493828, 0.21842355175688513], [0.3305340223944875, 0.5377777777777778], [0.8918539325842695, 0.7439104674127717], [0.3155006858710563, 0.5902439024390245], [0.5782312925170067, 0.3795918367346939], [0.3234880450070324, 0.48478260869565226], [0.7861781076066792, 0.7230634189159536], [0.31250000000000006, 0.18181818181818182], [0.6320224719101123, 0.6320224719101123], [0.582287961055982, 0.34403669724770647], [0.4056437389770724, 0.125], [0.3381818181818182, 0.34766355140186916], [0.654320987654321, 0.5437352245862884], [0.6346938775510204, 0.446], [0.78677398989899, 0.5569306930693068], [0.6411049268192124, 0.6411049268192124], [0.6050290486564996, 0.315843621399177], [0.4265202702702703, 0.4265202702702703], [0.15151515151515152, 0.15151515151515152], [0.28956422018348627, 0.31111357586512867], [0.4732510288065843, 0.4732510288065843], [0.3012048192771084, 0.15625000000000003], [0.5205314009661836, 0.5506172839506173], [0.8300000000000002, 0.6250000000000001]]}}